{"Politics": {"gonzaga": {"Watching the session: A guide": "BATON ROUGE — A legislative session that could make historic changes in Louisiana begins today. Battles are expected over taxation, health care, education and more. ... will get under way for real when Gov. Bobby Jindal addresses the ...", "Rutgers reviewing all practice videos": "Rutgers officials are reviewing practice videos of all sports to see if any coach engaged in behavior like the type that cost men's basketball coach Mike Rice his job, and the university is planning to hire a consultant to do an independent ...", "Senator Mike Lee Praises Momentum for Protecting Second Amendment Rights, Launches #Protect2A": "“The American people deserve a meaningful and transparent debate about gun laws before those who seek further Second Amendment restrictions use procedural tricks and back-room deals to push through controversial legislation.” WASHINGTON ...", "Senate confirms White to head SEC": "The U.S. Senate has confirmed Mary Jo White's nomination as chairman of the Securities and Exchange Commission, clearing the way for her to become the first former prosecutor to lead the agency that oversees Wall Street. White was swiftly approved Monday ...", "Never-Ending Newt": "I supported Newt enthusiastically in the primaries. He´s brilliant, imaginative and fearless, and never apologizes for conservative ideas. And yet...I knew he would lose the minute he let Romney get under his skin. He was great at eviscerating Obama´s ...", "Medical coverage for retirees worries cities": "HOQUIAM, Wash. – After this coastal city’s 1979 ladder truck finally broke down a few years ago, firefighters have continued their duties by using hand ladders that only reach a couple of stories up. Without the cash to buy a proper ...", "Risch vows to stall U.N. arms treaty": "WASHINGTON – An international framework for controlling the global arms trade appears to be headed for a brick wall on Capitol Hill, and Idaho’s junior senator is among the chief bricklayers. “Save your ink. It’s not going anywhere,” U ...", "State to unveil Pure Michigan license plates": "Michigan is planning to start selling two license plates featuring the Pure Michigan tourism logo. One of the plates being unveiled Monday will replace the state's standard license plate. The second plate will gradually replace the \"Spectacular Peninsulas ...", "GWU students rally behind embattled Newman Center priest": "Catholic students at George Washington University in Washington, DC are rallying behind Father Greg Shaffer, who runs the school’s Newman Center and who has come under fire for his statements about Church teaching, particularly those ...", "Udupi: Sudhakar Shetty chosen BJP candidate, Raghupati Bhat assures full support": "Udupi, Apr 5: Sudhakar Shetty has been chosen as BJP candidate from Udupi constituency for the upcoming state Assembly elections to be held on May 5. His candidature comes in the wake of MLA Raghupati Bhat's decision not to contest following the sleaze CD ...", "Iowa Republicans struggle against disarray": "Republicans in Iowa had looked forward to capturing a U.S. Senate seat after their longtime Democratic nemesis, Tom Harkin, announced in January that he was retiring. But months later, the GOP is no closer to naming a top-tier candidate to run ...", "Sandy Hook families to ride AF-1 to DC, lobby Senate": "Eleven family members of children killed at Sandy Hook elementary school will fly to Washington with President Barack Obama on board Air Force One Monday, according to a senior administration official and representatives of the families. They'll ...", "The Daily Caller": "The Obama administration’s current push to encourage banks to grant high-risk housing loans to lower-class borrowers insured by taxpayer-funded programs provided by the Federal Housing Administration (FHA) may be complicated by the fact that ..."}, "westeros": {"Cheating on Megan is an entirely different proposition from cheating on Betty.": "Seth, since you set the broader historical scene I will zero in on the personal dramas. In the highly controlled world of Matthew Weiner, very little happens by accident, so we would be remiss not to speculate on the significance of that Siren ...", "Republican Pat Toomey: Obama's best hope for gun control?": "fter weeks of stalled negotiations and setbacks, it looks like President Obama could finally score a victory in his push for increased gun control. His hopes now center on a Republican with an \"A\" rating from the National Rifle Association: Sen. Pat Toomey ...", "Making policy is tough": "War is endemic, and personal ambition is rampant. All this and the people in the land of Westeros are facing the frightening prospect of massive climate change in the form of a decades-long winter. Do they have the will to resist this? No. Sound familiar?", "Kevin James Endorses Eric Garcetti For LA Mayor": "City Councilman Eric Garcetti earned the endorsement of former rival Kevin James on Tuesday, giving him the backing of all of the other major candidates from the March 5 primary for his runoff mayoral campaign against City Controller Wendy Greuel. Greuel ...", "Mad Men creator dismisses Tagg Romney: Republicans should be thrilled": "Speaking to CNN on Thursday, Mad Men creator Matthew Weiner dismissed concerns that his show unfairly attacked late Michigan governor George Romney. A character on the popular AMC series, who was working for New York City’s mayor John Lindsay ...", "‘Game of Thrones’ Recap: “Valar Dohaeris”": "As is necessary with a show like Game of Thrones, the first episode of this third season is concerned both with reiterating the larger forces advancing on Westeros—it begins beyond the Wall, where Samwell Tarly is pursued by the White Walkers ...", "Mojo - March 2013": "They remain a fitting commentary, for as in the real world, politics in Westeros is not getting any less sleazy. What would this influence look like? There could be clues from Zuckerberg's last foray into advocacy work, the high-profile $100 ...", "Opening Belz, April 1": "but too many still drive to MSP to fly – News Tribune New Columbia journalism dean doesn’t have a Twitter account – NY Times Parody: Mike Allyn’s Westeros Playbook – Free Beacon", "The man America needs: Stannis Baratheon": "That leader is: Stannis Baratheon, true heir to the Iron Throne of Westeros. While Obama and Congressional Republicans sat around blaming each other before, during, and after the improperly handled sequestration crisis, Stannis took action.", "Nine Political Lessons From HBO's Hit Show 'Game Of Thrones'": "Here, we dissect some of the best political lessons from the land of Westeros. Note: This slideshow contains spoilers for seasons 1 and 2 only. At the start of the show, King Robert Baratheon has run the crown into a vast amount of debt to the richest man ...", "Petraeus Apologizes For Affair: 'My Recent Journey Was My Own Doing'": "David H. Petraeus used his first public appearance since his resignation to apologize for the affair that led to his undoing in November. Petraeus delivered a 25-minute keynote address on Tuesday to a crowd of more than 600 people at a dinner ...", "Act now, and receive two extra things! Three things for the price of ONE thing!": "It’s Stop Talking Man and his faithful sidekick Seriously Shut the Fuck Up Boy. Season 3 of Game Of Thrones: everyone in Westeros agrees to settle power succession though an actual Game of \"Musical Thrones. If you do 13 consecutive roundhouse ...", "US arms control advocates must show they like guns": "NEW YORK (AP) — Lobbying for gun control in the United States often means proving how much you like firearms. New York Gov. Andrew Cuomo, whose state recently passed some of the strictest gun control measures in the country, often reminds ..."}, "facebook": {"Professor Posts On Facebook: Being Sexually Assaulted By A State Trooper Is Hilarious!": "Ed. note: This post appears courtesy of our friends at Techdirt. We’ll be sharing law-related posts from Techdirt from time to time in these pages. If you’ve ever wondered why public agencies have such ridiculously stringent social media policies (for ...", "RIVERSIDE: Candidate, city at odds over Facebook post": "A Riverside council candidate’s comments on the city’s Facebook page have raised a 21st-century question: Are government-run social media sites a virtual public square where free speech reigns or are they public resources that can’t ...", "Internal Affairs: San Jose Councilman Kansen Chu sells Cisco stock, buys Facebook, turns profit": "Ordinarily, the economic interest statements that public officials must file every April are about as compelling as cold oatmeal. But every now and then, you can get an insight into their decision-making and trading prowess. Consider the stock ...", "Daily flag salute in schools, Facebook passwords, medical marijuana: Oregon Legislature today": "School districts in Oregon would be required to display the United States flag in every classroom and provide time for students to recite the Pledge of Allegiance at least once a day, under legislation being considered in a House committee this afternoon.", "Facebook charging users $1 to message 'strangers,' more for celebrities": "April 8, 2013 2:36 p.m. | Facebook has started charging its users $1 to send messages to the inbox of people outside their friends circle. If I'd read this on April Fool's Day, I would have thought it was a joke, but as the photo below shows, it ...", "Michigan Politician's Antigay Facebook Post Linked to Holocaust Denier": "Dave Agema, the Republican National Committee member former Michigan state representative who has been roundly criticized for a recent antigay Facebook post, has drawn his “facts” about homosexuality from some extremely disreputable sources ...", "'Spotted: Stratford' Facebook page pulls in a fifth of the town": "MORE than a fifth of the town’s 25,000 population have signed up to a new Facebook page called “Spotted in Stratford.” The online phenomenon exploded just before Easter when a Stratford-upon-Avon couple set up the page, allowing people to anonymously ...", "Ken Braun: Dave Agema should resign after Facebook post citing a Holocaust denier": "Michigan GOP National Committeeman Dave Agema’s doggedly stubborn refusal to back down from his decision to post the essay “Everyone Should Know These Statistics on Homosexuals” on his Facebook page has created a furious debate about the accuracy of ...", "District clerk says Facebook pic poking fun at policy, not glorifying Stalin": "Update at 9:14 p.m.: Gary Fitzsimmons tonight changed the profile picture on his Facebook page. Stalin’s out. Gandhi’s in. The picture depicts a giant banner of Fitzsimmons hanging on the side of the George Allen civil courts building in downtown Dallas.", "Snyder declines comment on calls for Agema to resign following anti-gay Facebook post": "Lansing — Gov. Rick Snyder on Monday declined to say whether Republican National Committeeman Dave Agema should remain in the position after posting an anti-gay article on his Facebook page that has drawn calls for his resignation from fellow ...", "Facebook charging users $1 to email message \"strangers,\" more for celebrities": "April 8, 2013 2:36 p.m. | Facebook has started charging its users $1 to send messages to the inbox of people outside their friends circle. If I'd read this on April Fools day, I would have thought it was a joke, but as the photo below shows, it ...", "Sheryl Sandberg, Facebook exec, seen laying groundwork for life in politics": "Sheryl Sandberg, fresh off a media tour to promote her book on women in the workplace, is building the foundation for a life in the public eye that supersedes her day-to-day duties as operating chief at Facebook Inc. Summers's former cabinet position of ...", "Facebook's Sheryl Sandberg urges support for more women leaders in business": "Women in business must overcome their fears and “take a seat at the table” in order to succeed in the corporate world, Facebook chief operating officer, Sheryl Sandberg said during a visit to Philadelphia on Thursday. “You may not think you belong ..."}, "apple": {"Protege of rotten apple": "He had the perfect mentor. Sigfredo “Siggy” Gonzalez — a convict-turned-confidential witness against Assemblyman Eric Stevenson — learned his criminal craft at the knee of former state Sen. Pedro Espada. Gonzalez, 44, was employed in 2009-2010 as ...", "Will This Tech Giant Launch a Smart TV Before Apple?": "While most people following the race to release a smart TV are looking to Apple, Google, or Samsung, in this video, Motley Fool tech and telecom analyst Andrew Tonner tells investors about one unexpected tech giant making a big push to get there ...", "Judge Gives Green Light To Claims That Apple And Google Agreed To Suppress Salaries": "A judge on Friday cited strengths of a suit charging Silicon Valley giants with secretly agreeing not to \"poach\" each other's workers but shot down a request for broad class action status. US District Court Judge Lucy Koh reasoned that plaintiffs in a ...", "An Apple Victory And a Disappointing Jobs Report: Market Recap": "March served up another heaping pile of disappointing jobs data on Friday morning. The employment situation report, issued by the Bureau of Labor Statistics, showed that the United States added just 88,000 non-farm payrolls for the month. This is less than ...", "Don't Get Too Excited on Apple (AAPL) Given Risks of Near-Term 'Miss' - Oppenheimer": "Just as Apple's (NASDAQ: AAPL) stock is starting to get legs again, analysts at Oppenheimer are trying to dampen near-term expectations. Oppenheimer analyst Ittai Kidron lowered his price target Tuesday from $600 to $550 and said he sees risk to near term ...", "RIVERSIDE: Teachers honored with Crystal Apple awards": "Riverside City Mayor Rusty Bailey and Riverside Unified District Superintendent Rick Miller were among the speakers Thursday night, March 28, honoring RUSD teachers at the annual Crystal Apple awards. The teachers are chosen by seminary students ...", "[Pics] Nostalgic Moments Of Steve Jobs Returning Back To Apple In 1996": "Steve Jobs once said that getting fired from Apple was the best thing that could have happened to him, it made him rethink about himself and recreate things that he could not have done staying at Apple. But one iconic day in the history of Apple ...", "Apple's 'Spaceship' Campus $2bn Over Budget and A Year Behind Schedule": "Construction on the 2.8 million square foot headquarters, known as Campus 2, was due to start last year with a completion date pegged at the end of 2015, but this has slipped a year as the original \"under $3bn\" budget may now exceed $5bn (£3 ...", "New York corruption scandal revives tradition of rotten Big Apple machine": "It sounded like a script from an episode of The Wire or a gritty cop movie. Certainly the setting – a restaurant in Manhattan – was one that Hollywood would have approved. But as local Republican politician Daniel Halloran, a city councilman ...", "The Big Apple is at the core of New York's political rot": "Just when you thought Gov. Cuomo had imposed law and order in Albany, state Sen. Malcolm Smith of Queens is arrested in a brazen bribery plot. New York truly is an Empire State — of corruption. And New York City is the undisputed capital. The city has 43 ...", "Gays hate apple pie! A Kansas congressman writes the dumbest anti-gay marriage op-ed ever": "Please, please say that this was your version of an April Fool’s day gag, Tim Huelskamp. Please say this was your Onion-like parody of the absurd, hyperbolic bluster which makes the opponents of marriage equality seem so dumb and silly.", "Hagel's Enlisted Chats: Fruit of Knowledge or Poisoned Apple?": "Chuck Hagel announced March 29 he will act on his name-brand affection for enlisted troops by hosting a monthly lunch with a group of young soldiers, sailors, airmen and Marines. This tactic of circumnavigating the chain of command and drinking ...", "San Diego hotel mogul's political reach extends to Big Apple": "Robert Gleason, the CFO and general counsel at Evans Hotels - one of three homegrown San Diego hotel empires behind the lawsuit against Democratic mayor Bob Filner in an unsuccessful effort to force him to sign a city funding contract negotiated ..."}, "banana": {"US: Senate Appropriations chairwoman disavows “Monsanto Protection Act”": "Food activists outraged at what they have termed the \"Monsanto Protection Act\" — a provision that, as noted here, snuck into law late last month as a part of a broader spending bill — have directed significant blame at Sen. Barbara Mikulski, D-Md ...", "The banana republic in which we stand": "found here.. http://www.dailykos.com/story/2013/04/07/1199585/-The-banana-republic-in-which-we-stand?showAll=yes Imagine you lived in a country where there was a pretense of democracy; elections were still held, congress still sat down and ...", "Miami Dolphins and County Agree To \"Framework\" On Sun Life Deal": "Miami voters are one step closer this morning to getting the chance to weigh in on whether their tax dollars should go toward another big-ticket stadium project. Miami-Dade Mayor Carlos Giminez announced that the city and the Miami Dolphins have agreed on ...", "Fixing the Banana Republic": "The front page has an absolutely must see TED talk by Lawrence Lessig. If you haven't seen it yet, stop reading this, go to the front page and scroll down until you find it. Watch, then come back here. We need ideas on how to fix the problem ...", "The Cake Boss' Black and White Cookies": "Black and white cookies, topped with half white fondant, and half chocolate, have a deep heritage in New York City, but their popularity has spread over the years, and they're a constant good-seller at Carlo's. If you've ever had a black and white cookie ...", "Senate confirms White to head SEC": "WASHINGTON—The U.S. Senate has confirmed Mary Jo White's nomination as chairman of the Securities and Exchange Commission, making her the first former prosecutor to lead the federal agency that oversees Wall Street. White was approved Monday ...", "CALIFORNIA FOCUS - UTILITY REGULATORS CREATING A BANANA REPUBLIC?": "CALIFORNIA FOCUS - UTILITY REGULATORS CREATING A BANANA REPUBLIC? Banana republics got their appellation during the 1920s, when dictators ruling countries like Honduras and Guatemala made decisions on the say-so of banana growing companies ...", "Obradovich: Step carefully: 3 key Legislature issues remaining": "They know full well, however, the staircase to the stars is strewn with roller skates, banana peels and marbles. All of these proposals have the potential to affect the lives of many Iowans in a tangible way. All of them also carry real ...", "Dunbarton: a town lost to the atom [The Augusta Chronicle, Ga.]": "As the families packed and left, the businesses closed too. Gone were Schumpert's Lumber Mill, Leigh Banana Case Co. and many smaller companies. Churches and schools were abandoned. Even the dead were evacuated. Across the entire site ...", "CRASHING THE TEA PARTY": "I finally got an idea. I peeled away the nylon tape and took a tiny little piece of banana out of my bowl of puffed rice and smeared it at the edge of the tiny break in the screen and sat back to watch. It took a good half-hour for her to scour the 40 ...", "Pentagon struggles with high cost of health care": "The loud, insistent calls in Washington to rein in the rising costs of Social Security and Medicare ignore a major and expensive entitlement program _ the military's health care system. Despite dire warnings from three defense secretaries about the ...", "Four women senatorial bets": "Santa Banana, under that rule, anybody can just qualify! Let’s rewind a bit and see how the party-list system found its way to the 1987 Cory Constitution. The party-list system was actually a copy of the German Constitution which provided ...", "Appeal isn’t everything – as a banana proved": "So how will history remember David Miliband? A key figure in the New Labour revolution? The best leader his party never had? A ditherer, who had his chance but blew it? Or simply as the brother of someone important? All perhaps, or none; history tends to ..."}}, "Business": {"gonzaga": {"‘We can’t sit here and meddle in mediocrity’": "“If you see recruits and their families come in to see your facilities and then they go to UCLA … or even just a smaller school like Gonzaga, and their facilities are much better than ours, [it’s clear that] we got left behind,” he sai", "Then & Now: Service stations popular until 1970s": "There were cars before the advent of the gas station. Early fuel stops were general stores where a motorist could fill a gas can. The debut of Ford’s Model T in 1908 opened travel to the masses, and purpose-built gas stations appeared quickly ...", "GETTING AHEAD: Sunday, April 7": "Short is a 19-year employee of the Montana DNRC. She has a degrees in forestry from the University of Montana and organizational leadership from Gonzaga University. Chelsea Elwood has joined the firm of David Mirisch Enterprises, which consults on ...", "Getting There: Businesses pinched by work on Francis": "Merchants in the vicinity of Market Street and Francis Avenue are feeling the double-whammy of two major road projects going on side by side. “It’s been pretty horrible,” said Jeff Toole, owner of Tobacco, Beer & More at 3123 E. Francis ...", "Timothy Peters sworn in as sheriff's deputy": "Timothy Peters has joined some famous company fighting sexual predators on the Internet. The driver in NASCAR's Camping World Truck Series was sworn in Saturday at Martinsville Speedway as a reserve deputy sheriff and spokesperson for the Safe Surfin ...", "Frog-phobic man awarded $1.6M over runoff flooding": "Paul Marinaccio Sr. traces his fear of frogs to a childhood incident in Italy when a man holding bullfrogs chased him away after he'd wandered from the vineyard where his parents worked. Decades later, he found himself describing his phobia to a ...", "Vodka supplier CEDC files for Ch. 11 protection": "Vodka producer Central European Distribution Corp. is seeking Chapter 11 bankruptcy protection to cut more than $665 million of its debt. The company is asking a U.S. Bankruptcy Court in Delaware to approve a reorganization plan, which would ...", "Stocks erase losses": "U.S. stocks cut their losses and turned higher Monday afternoon, rebounding from one of their worst weeks of the year. But the gains remained slim as investors gear up for the start of earnings. Investors also continued to closely monitor Europe ...", "Gonzaga Denies Knights of Columbus Student Group Because it’s Catholic": "Spokane's Gonzaga University has denied a Knights of Columbus group application to be recognized as an official student organization. Those seeking the status were notified of the University’s decision at a meeting on March 7. The group was ...", "Mangalore: Karnataka Bank gets four new deputy general managers": "Mangalore, Apr 6: Karnataka Bank has promoted four of its assistant general managers as deputy general managers. They are Muralidhar Krishna Rao, Nagaraja Rao B, Venkappaya K and Rudraiah H S. Muralidhar Krishna Rao joined the Bank as an officer in the ...", "Magnolia Bridge midnight march draws 50 transit supporters": "As a New Orleans style band played “The Wheels on the Bus” and “This Land is Your Land,” some 50 people marched across the Magnolia Bridge at about 11:45 p.m. Saturday. They were calling for new funding sources to prevent what King County Metro ...", "Turning a sow's ear into a silk purse?": "Indiana? Out! Kansas? Out! Gonzaga? Out! Now I'm trying to figure out how to lessen my pain. Is there any way I can deduct my initial \"investment\" ($50)? This is a tough call for many businesspeople since the misinformation about employee or ...", "Stocks extend losses after worst week of 2013": "U.S. stocks fell again Monday, extending their losses from one of the worst weeks of the year, as investors geared up for the start of earnings. Investors were also closely monitoring Europe's debt crisis and nuclear tensions on the Korean ..."}, "westeros": {"Homeowners can hope for a cut": "INTEREST rates are likely to remain unchanged tomorrow when the Reserve Bank of Australia Board meets for the third time this year. The cash rate has stayed at 3 per cent since December last year, when it fell by 25 basis points (0.25 percentage points ...", "What is 'chained CPI' and why are liberals so mad it's in Obama's budget?": "The government uses the consumer price index (CPI) to measure inflation. According to the Department of Labor, the CPI measures how much the cost of a \"market basket of consumer goods\" changes over time. That basket includes things like housing, food ...", "Craft Brewers Face Regulatory Challenges": "One craft brewer, for example, told DeCelle that an FDA regulator who inspected his brewery had suggested that the new FSMA required the brewery to refrigerate its grain—something that flies in the face of beermaking and industry standards ...", "Shell to shut key Nigeria pipeline to repair oil theft damage": "Shell plans to temporarily shut a key oil pipeline in southern Nigeria later this month to repair damage caused by oil thieves, leading to a cut of around 150,000 barrels per day, the company said Tuesday. The Nembe Creek Trunkline in Nigeria ...", "Today in business: 5 things you need to know": "U.S. Treasury Secretary Jack Lew is meeting with Mario Draghi, the president of the European Central Bank, on Monday in a bid to get the region's leaders to ease back on the austerity measures they're using to combat their debt crisis. Lew, on his first ...", "US Treasury chief urges EU to ease off austerity": "BRUSSELS (AP) — European countries should ease off their austerity and adopt more growth-friendly policies, U.S. Treasury Secretary Jacob Lew said Monday as he kicked off a series of meetings with the region’s top leaders. America’s ...", "‘Game of Thrones’ season 3 ratings and illegal downloads breaking records": "Game of Thrones on HBO ratings are looking good as announced today, April 1st, 2013. The numbers look even better than the season 2 finale. HBO’s Game Of Thrones returned for its third season with a record-breaking 4.4 million viewers last night. The one ...", "Figures support view of experts": "IT has been a long-held view that the longer you hold on to your residential property, the more it will grow in value. That is, of course, unless you happen to decide to sell in the middle of the GFC or some other upset to the economy which can set that ...", "GE to buy Lufkin Industries for about $3B": "NEW YORK (AP) — General Electric Co. will buy the oilfield equipment maker Lufkin Industries, Inc. for about $3 billion, furthering an effort by GE to grow its oil and gas operations. GE said Monday it would pay Lufkin shareholders $88.50 per ...", "'Game of Thrones' season premiere breaks piracy records": "The third season premiere of \"Game of Thrones\" did very well for HBO, with 6.7 million subscribers tuning into the program during the multiple airings Sunday night. However, the program broke another kind of record this week, with people who ...", "Sen. Bernie Sanders: Arkansas spill shows need to move away from carbon-based economy": "Monday night on MSNBC, Independent Sen. Bernie Sanders of Vermont said the recent oil spill in Arkansas illustrated why the United States needed to adopt more eco-friendly energy sources. “It really raises the broader question and that is ...", "Massive Food Stamp Scam Busted At South Florida Convenience Store": "A pair of convenience store owners in south Florida have been busted for allegedly conducting a massive food stamp scam and using taxpayer money to stock their own shelves. Police say Bassam Sale Abu Diab, 55, and his son, Matthew Bassam Abu Diab, 22 ...", "These Three Countries Are Winning the 'Game of Thrones'": "\"Game of Thrones,\" based on the best-selling \"A Song of Ice and Fire\" book series by author George R.R. Martin, is the story of seven feuding families fighting for control of the fictional Westeros kingdom. The series, full of sex, back-stabbing and bloody ..."}, "facebook": {"Will you pay for Facebook messages to non-friends?": "BANGALORE, INDIA: Majority of Facebook's popularity can be attributed to its free service. Doing those things which have of late become a standard for survival --- Connecting with friends, making new friends, sharing, chatting, etc, for free was a model ...", "More job-seekers, employers using Facebook connections to fill vacancies": "ATLANTA - Kareem Taylor's senior year at Clark Atlanta University was quickly approaching, and he was starting to worry about his future. Would he be able to land a job as a voice actor or would he end up back home with his parents like so many ...", "How to Get More Shares on Facebook": "When it comes to marketing your law firm on Facebook, sharing is not just a good thing, it’s the key to making this social media network work for your practice. So how do you get more shares? This infographic does a good job of aggregating the latest ...", "Citigroup To File Facebook Claim, Undecided On Suing Nasdaq -Sources": "Citigroup Inc. (C) plans to file a claim seeking compensation from Nasdaq OMX Group Inc. (NDAQ) for losses the bank suffered trading in last May's market debut of Facebook Inc. (FB), according to people close to the discussions. However ...", "Citigroup to File Facebook Claim": "Citigroup Inc. (C) plans to file a claim seeking compensation from Nasdaq OMX Group Inc. (NDAQ) for losses the bank suffered trading in last May's market debut of Facebook Inc. (FB), according to people close to the discussions. Citigroup is ...", "Facebook loses million SA users": "ANC MP Sue van der Merwe was recovering well after she was assaulted during a robbery at her Cape Town home, her brother said on Monday. University of the Free State vice-chancellor Professor Jonathan Jansen on Monday morning dismissed ... Somini Sengupta ...", "Check out Facebook Home's new commercial as ad blitz starts": "The new ad, which was part of the launch event, started running on television during Saturday's NCAA Final Four games, according to AllThingsD. More ads produced by ad firm Wieden + Kennedy are expected soon. Facebook is also advertising ...", "Who Stands To Be Hurt By the 'Facebook Phone'": "Big whoop, there’s a \"Facebook phone.” That was my first reaction to Mark Zuckerberg’s announcement last week. Can you blame me? The Facebook phone isn’t even a phone; it’s an “apperating system” that you either install on your Android phone ...", "Citi May File Suit Against Nasdaq (NDAQ) Over Botched Facebook (FB) IPO": "Citigroup (NYSE: C) is planning to file a claim against Nasdaq OMX (Nasdaq: NDAQ) over the botched IPO of social media giant Facebook (Nasdaq: FB) last May. The WSJ noted Monday night that Citi is currently exploring options for its claim under a proposed ...", "Facebook charging users $1 to email message \"strangers,\" more for celebrities": "April 8, 2013 2:36 p.m. | Facebook has started charging its users $1 to send messages to the inbox of people outside their friends circle. If I'd read this on April Fools day, I would have thought it was a joke, but as the photo below shows, it ...", "IRS to collect personal info from Facebook, Twitter": "You have just about a week left to file your taxes -- the deadline is next Monday, April 15. But this year, the IRS will be collecting more than just your money. According to several reports, the agency will also be collecting personal information from ...", "Vote on Facebook to help Food Bank of Iowa earn grant": "The Food Bank of Iowa is vying for grant money from Wal-Mart in the Fighting Hunger Together national campaign that includes more than 300 hunger relief groups across the country. Money will be awarded to programs that get the most votes for ...", "Bunny Wailer Uses the Power Vested in Him by Facebook and Wikipedia to Excommunicate Snoop Lion from Rastafarianism": "Neville Livingston, a.k.a. Bunny Wailer, has officially excommunicated Snoop Lion from the \"Rastafari Community.\" I say \"officially\": He made a Facebook post wherein he said, \"SNOOP LION IS OFFICIALLY EXCOMMUNICATED FROM THE RASTAFARI COMMUNITY!\" and then ..."}, "apple": {"Will Apple Bring Ron Johnson Back Into the Fold?": "After the market closed J.C. Penney announced that Ron Johnson, the company’s CEO, was being replaced with Mike Ullman, the man that Johnson had replaced. CJ Takeaway: Obviously J.C. Penney’s Board was not willing to wait to see if the company could a ..", "J.C. Penney ousts former Apple retail boss Ron Johnson from CEO position": "In what may go down as the biggest failure to export Apple Inc.’s spectacular success to another company, J.C. Penney chief executive Ron Johnson has been pushed out of the retailer in favour of the man he replaced. The retailer said late ...", "Rotten system eating into apple trade": "The next time you step out to buy apples, know for sure that the high price you are paying is not because of any shortfall in production. The price is actually manipulated by a well-knit network of agents and contractors. So while you end up ...", "Former Apple Store Chief Ron Johnson Leaves CEO Position At JC Penney": "Ron Johnson, the man who helped create the Apple Store alongside Steve Jobs, has left his role as the CEO of JC Penney. Johnson resigned from Apple back in 2011 to accept the JC Penney position. Morale at JC Penney has weakened since Johnson was put in charge.", "U.S. patent office retracts rejection of Apple's iPad Mini trademark": "The U.S. Patent and Trademark Office (USPTO) last week reversed itself, withdrawing a rejection of Apple's trademark application for \"iPad Mini,\" according to a document published by the agency. The U.S. Patent and Trademark Office (USPTO) last ...", "Will Apple bring Ron Johnson back?": "“After the market closed J.C. Penney announced that Ron Johnson, the company’s CEO, was being replaced with Mike Ullman, the man that Johnson had replaced,” Chuck Jones writes for Forbes. “Obviously J.C. Penney’s Board was not willing ...", "Cassidy: Former Apple retail guru Ron Johnson dumped by J.C. Penney": "One of the defining characteristics of Silicon Valley is how entrepreneurs swing boldly from job to job, sometimes navigating wildly into little-charted territory with a mind to turn an industry sector upside down. But sometimes, as in the case ...", "JC Penney looks to former CEO Ullman to secure its future after former Apple exec's plan flops": "NEW YORK, N.Y. - J.C. Penney is hoping its former CEO can revive the retailer after a risky turnaround strategy backfired and led to massive losses and steep sales declines. The company's board of directors ousted CEO Ron Johnson after only 17 months on ...", "Former Apple exec Ron Johnson loses CEO role at J.C. Penney": "NEW YORK -- J.C. Penney's board of directors has ousted CEO Ron Johnson, the former Apple (AAPL) retail guru, after only 16 months on the job as a risky turnaround strategy backfired and led to massive losses and steep sales drops. The ...", "Apple now selling refurbished redesigned 27\" iMacs at over $400 off list": "The Online Apple Store is now selling refurbished versions of the newly redesigned 27-inch iMac, with a variety of configurations offering savings of up to $400 off retail pricing. The thin all-in-one desktops made their debut on Apple's \"Special Deals ...", "Can Apple's iPhone Sales Hold Up This Quarter?": "In just over two weeks, Apple will be stepping up to the earnings plate to try and redeem itself after last quarter's relentless sell-off. Fears have begun mounting lately that the company may miss its own revenue gui ... Apple Inc. continues to claim the ...", "Microsoft Warranty Criticized in China After Apple Woes": "Microsoft Corp. (MSFT)’s after-sales service of its Surface tablet has attracted criticism from China’s state-owned radio, following similar reports in the past month targeting Apple Inc. (AAPL) The Surface Pro should follow the nation’s ...", "Former Apple Retail Chief Johnson Ousted as JC Penney CEO": "Former Apple retail chief Ron Johnson has been ousted as CEO of JC Penney after assuming the role in Nov. 2011. Myron E. (Mike) Ullman III, who served as JC Penney chairman and CEO for seven years before Johnson took over, will return to the ..."}, "banana": {"Banana Republic Creative Head receives Doctorate in Arts": "Banana Republic is proud to announce Simon Kneen, Creative Director and Executive Vice President, Design, has been awarded a Doctor of Arts honoris causa from Kingston University in London, United Kingdom. A Kingston University graduate, Kneen was ...", "Forget expensive serums, just a banana a day can banish puffy eyes": "Forget spending hundreds of pounds every year on the latest beauty creams and serums, according to top Hollywood nutritionist Kimberly Snyder, simply eating the right foods can do wonders for your skin and hair. Snyder, whose clients have included Drew ...", "Rwanda: Kirehe Banana Cooperative in Rwf50 Million Loss, Risks Collapse": "At least Rwf48 million was reported missing in a banana cooperative, known as Kamara, in Kirehe District. This was disclosed yesterday at a meeting organised by the district officials, to settle standing disputes among the cooperative's top leaders.", "Villa Banana HD for iPad Released - Fun Match 3 Game": "[prMac.com] Sheffield, United Kingdom - Notus Games studio today is pleased to announce the worldwide App Store release of the new Villa Banana HD. The game has been released in English, German, Russian and Ukrainian. Eight more languages will be added ...", "SouthPark Banana Republic to celebrate reopening": "CHARLOTTE, N.C. -- The Banana Republic is finally open for business following the severely damaging July 2012 roof collapse at SouthPark Mall. The store officially opened its doors a week ago, last Wednesday, but is celebrating their official ...", "Opinion: surviving Panama’s banana crisis cooperatively": "Near the archetypal banana town of Changuinola in Panama’s North Western province of Bocas del Toro, just a few kilometres from the Rio Sixaola – and Costa Rica on the other side – are three unusual banana plantations. Many would have ...", "Banana fiber-making industry augments income of farmers in Davao del Norte": "SANTO TOMAS, Davao del Norte—What is commonly regarded as farm waste is raising the incomes of banana farmers here. The banana stalk—in particular, the pseudostem—is a good source of silk-grade fiber, a commodity that is in demand in Japan, which ...", "Chilli, banana value-chain platforms launched": "KARACHI: The United States Agency for International Development (USAID) held the first of its kind, consultative orientation meeting in Hyderabad recently to launch chilli and banana value-chain platforms (VCPs) in Sindh. The event was organised as part of ...", "Banana cultivation pays Parbat youth well": "Chhetri earns over Rs. 200‚000 from banana cultivation in a year.. PHALEBAS: A youth who has received a Masters' degree has been involved in banana cultivation here when the number of Nepali youths going for abroad jobs is increasing day by day.", "Latrobe to get state marker for banana split invention": "The state has recognized Latrobe as the birthplace of the banana split. This week, the Pennsylvania Historical Museum Commission approved Latrobe's application for a historical marker designating the city as the place where in 1904, David E.", "Presidential banana initiative: An example of why govt programmes fail": "Questions. Some people wonder why the government picked on banana for processing and not, for example, coffee. Coffee, the leading foreign exchange earning crop, continues to be exported as coffee beans when further processing would earn the country more ...", "Tamil Nadu banana output doubles but prices continue to rise": "CHENNAI: The economics of food pricing in the state is enough to make you go bananas. Tamil Nadu grows more bananas than any other state and has had a bumper crop this year, but retail prices of the fruit are steadily on the increase. The ...", "Banana fiber augments Davao del Norte farmers’ income": "STO. TOMAS, Davao del Norte -- What is commonly regarded as farm waste is yielding huge income for banana farmers in this town. Banana stalk, or in particular the psuedostem is a good source of silk grade fiber, which currently has a huge demand in Japan ..."}}, "Entertainment": {"gonzaga": {"Gonzaga students are 'Alive with Art'": "Despite Gonzaga’s heart-wrenching loss on Saturday, the GU community still had a lot to celebrate, namely its art. From dance to music, painting and more, GU student’s shared and celebrated the artistic talent the campus has to offer during “Alive ...", "'Sugar Man' Rodriguez plays to adoring NY crowd": "Sixto Diaz Rodriguez can't hit the high notes like he used to, but that didn't matter to his fans. The 70-year-old singer made famous by the Oscar-winning documentary \"Searching for Sugar Man\" performed Sunday night to a worshipful crowd at ...", "Bryan named top country entertainer": "Vocal event of the year: “The Only Way I Know,” Eric Church, Luke Bryan and Jason Aldean LAS VEGAS – Everything went to script Sunday night at the Academy of Country Music Awards until the end, when Luke Bryan pulled off an amazing upset ...", "Bravo cancels Kathy Griffin's 'Kathy'": "Like a seasoned comic, Kathy Griffin took a bit of bad news and turned it into stand-up material. The comedian was gearing up for a Friday performance in Cincinnati, Ohio, on Thursday when she learned that Bravo wasn't bringing back her talk ...", "John Lloyd Cruz resists categorization": "After many years in the biz, John Lloyd Cruz finds himself in the enviable position of being the most preferred screen “consort” of many female stars, like Bea Alonzo, Sarah Geronimo, Angelica Panganiban and Toni Gonzaga. What makes him so ...", "Scarborough sharpens plea to his party": "Joe Scarborough must be doing something right to be attacked by both Paul Krugman and Mark Levin in the same month. His MSNBC program, \"Morning Joe,\" has passed its fifth anniversary with a wider influence in politics than its relatively small audience ...", "Whirligig, whiskey, introverts and 13 other things to do this week": "Derek Cianfrance (“Blue Valentine”) is back with this sprawling tale of two fathers and two sons. Ryan Gosling, as a motorcycle-stunt rider who embarks on a series of bank robberies to provide for his son, and Bradley Cooper, as a straight ...", "Catholic Gonzaga University Bans Knights of Columbus Because They’re Catholic": "I’ve written posts recently that I said were “man bites dog” stories. I suppose that makes this one a “dog bites self” story. According to the Cardinal Newman Society, Gonzaga University which bills itself as a Catholic university and whose ...", "No one more surprised than Luke Bryan by ACMs win": "LAS VEGAS (AP) — Luke Bryan heard his name called at the end of the Academy of Country Music Awards, accepted the entertainer of the year trophy and then things became a blur. “It was like I was on the tilt-a-whirl,” he said. Bryan pulled ...", "20th Annual World Rhythm Festival!": "Seattle Center 305 Harrison St Seattle, WA 98109 Saturday, April 13, 2013, 11am – 10pm Drum, Dance, Listen and Learn at over 100 Performances and Workshops featuring world music traditions of Africa, Asia, Cuba, Brazil, India, America, the Middle East ...", "Reminder: Fred Phelps is a Democrat": "Just a little something to remember as his pack of loonies get ready to protest yet another funeral. The anti-gay group says it will protest outside the movie critic’s memorial service Monday in Chicago. Leaders of Kansas’ Westboro Baptist ...", "Wandering around a reader’s paradise": "If you love to read, you have to love the Internet. Read on. • Oh sure, there are always the videos of cats playing the piano and Russian car crashes cluttering the way, but the Net is a reader's paradise. Pick a subject, any subject and there ...", "Tony Floor’s Tackle Box digs deep into salmon fishing outlook": "Ahhhhhh, April, we made it! Daffodils, tulips and time to go fishing! April is a very important time of the year here in the Pacific Northwest, when the sun begins to heat up the spring days and the moss begins to evaporate off our backs. It’s ..."}, "westeros": {"Game of Thrones: Recapping the Return to Westeros": "The third season of Game of Thrones has finally debuted, and we’re back to chronicle the TV adaptation of George R. R. Martin’s world of Westeros — and how it differs from the books — in a series of letters between Wired writers (and Game of ...", "Back in the battle zone": "In the kingdom of Westeros created by George R R Martin, the acclaimed — nay, worshipped — author of the books on which the TV series is based, the clash of kings continues. Up north, Robb and Catelyn Stark fight on but betrayal may be on the cards ...", "'Game of Thrones': How to plan a premiere feast worthy of Westeros": "The Season 3 premiere of \"Game of Thrones\" is only days away, but it's not too late to plan a delicious feast for the event. Food is a big part of the world of \"A Song of Ice and Fire,\" and it's always nice to tie that part of the series into ...", "Game of Thrones recap: The women of Westeros": "\"Are you frightened, child? No need for that. We’re only women here.\" — Olenna Tyrell The \"Queen of Thorns, \" as Olenna is aptly nicknamed, is new to us, though it’s immediately clear that she’s a seasoned and formidable player in ...", "East meets Westeros in Chinese 'Game of Thrones' commercial": "With the much-anticipated third season of HBO's Game of Thrones just getting underway, lots of people are rushing to capitalize on the show's roaring success. One of the more bizarre attempts recently surfaced on China's CCTV, which aired a ...", "‘Game of Thrones’: Winter Is Coming While Westeros Smoulders": "If we have learned anything from Westeros over its first two seasons, it is that no action, however big or small, is independent of the others surrounding it. Actions have consequences, consequences begat actions, etc. ... And as we saw in ...", "The Women of Westeros": "Starting next week, this blog space on Mondays will be given over to The Orange Couch recaps of “Mad Men” (sadly, we had to cut “Doctor Who” because we don’t have time for both), so I won’t have a lot of time to talk about that other ...", "While many in Westeros are having a very bad day, Lady Catelyn is having a very bad life.": "Every week in the Game of Thrones TV Club, Rachael Larimore will IM with a different fan of the show about the goings-on in Westeros and across the Narrow Sea. This week she discusses \"Dark Wings, Dark Words\" with Slate's Chris Kirk. Rachael ...", "'Game of Thrones' Q&A: Natalie Dormer on Playing 'the Kate Middleton of Westeros'": "Step aside, Lannisters: There's a new player in town. Last night's season premiere made it clear that Lady Margaery Tyrell, the gorgeous new fiancée of King Joffrey (and the widow of his closeted rebel uncle, Renly), is going to be ... What is power for a ...", "‘Game of Thrones’ Recap: Welcome Back to Westeros (Video)": "Poor Samwell Tarly: He begins Season Three of HBO’s “Game of Thrones” lost in the frozen zombie wasteland beyond the Wall, the fate of Westeros having slipped through his frigid fingers. Poor Tyrion Lannister: The diminutive – and now ...", "'Game of Thrones' Season 3 RECAP: Tension abound in engaging 'Dark Wings, Dark Words'": "the drummer child from “Love Actually\"? Because that’s hilarious. LB: Yep, that little kid is all grown up and in Westeros now. Jojen and Meera, I think, are perfect foils to Bran and Rickon at this point in the story, because they just seem so self ...", "Game of Thrones season 3: Westeros woes for Tyrion": "Joining the cast for season three is British acting legend Dame Diana Rigg. She will play Lady Olenna Tyrell (aka The Queen Of Thorns). Dame Diana Rigg is best known for playing Emma Peel in 1960s drama The Avengers. She also starred in Bond movie, On Her ...", "From Downton Abbey to Westeros": "TORONTO — She had no previous experience wielding weapons or marching through knee-deep snow across frigid glaciers, but 26-year-old Scottish actress Rose Leslie said it felt pretty natural stepping into the role of Ygritte on Game of Thrones. The ..."}, "facebook": {"MSC Cruises Announces \"A Diva Like No Other\" Weekly Facebook Sweepstakes": "FORT LAUDERDALE, Fla., April 8, 2013 -- /PRNewswire/ -- In anticipation of the arrival of one of the fleet's newest and most exclusive ships, MSC Cruises is inviting Facebook users to participate in their \"Diva Like No Other\" sweepstakes.", "Newest Facebook Games launched at GDC Play": "Independent game developer Hey Snails Inc. formally launched two new Facebook games at the recent Game Developers Conference – GDC Play Event in San Francisco. Game creators and company founders Redentor Quiambao and Harold Khan unveiled to a group of ...", "Real Nebraska Girls Facebook page: Empowerment or stereotype?": "On Facebook, Nebraska women stand in cornfields wearing sundresses, cowboy boots and great big smiles. They hunt and fish, sporting both camo and makeup. They sunbathe on top of livestock trailers. A bubbly, ambitious 20-year-old named Andrea ...", "‘Seeing the Bully Finally Meet His Demise is Just Sad’—Michael Arrington’s Former Partner Denounces Him on Facebook": "Facebook hasn't been kind to Facebook investor and TechCrunch founder Michael Arrington lately. The notorious tech thug was accused by his ex-girlfriend Jenn Allen of physical abuse and death threats in a Facebook post last week, as we were the first to ...", "Readers mourn beloved Mouseketeer on Facebook": "Monday's passing of actress Annette Funicello generated an enormous amount of feedback on social media, especially here in Kern County, where she resided for the past several years. Not only did readers fon ... Heartbreaking news comes from Disney family.", "Facebook charging users $1 to message 'strangers,' more for celebrities": "If I'd read this on April Fool's Day, I would have thought it was a joke, but as the photo below shows, it isn't. I was trying to respond to a person who had sent me a friend request without accepting his request. When I hit \"message\" on his ...", "Nine-year-old Zac's letter of apology to little brother for 'pinching his nuts' hits Facebook": "REMEMBER when you hurt your brother or sister? And then mum made you apologise? This might be the greatest, funniest apology ever committed to paper. An Adelaide mum was so impressed with it she took a photo and put it up on Facebook - and then gave ...", "Facebook posts lead to arrest of sexual harasser": "Women in a several Beersheba neighborhoods are breathing easier today. A man who was accosting women and exposing himself to them has been arrested. A post on Facebook broke the silence and led to the suspect’s arrest. On Monday the man was remanded.", "If Game of Thrones Characters Were on Facebook": "I need to see more of this comedic gold! Facebook is the online distillation of real life. Pretty soon, all TV shows and movies and books will devolve into a series of Facebook posts so that tweens will understand pop culture. No, seriously. Happy Place ...", "It now costs a tenner to abuse a celebrity on Facebook": "Ever felt like sending obscene Facebook abuse to Miranda Hart? Haven’t we all! But it seems that Facebook has very quietly begun charging us plebs to contact celebrities – with a going rate of up to £10.68 to send a harmless message about wanting to ...", "Culver's launches Facebook contest with return of pub burger": "Culver’s Colby Jack Pub Burger, the restaurant’s most successful limited-time-only burger ever, returns to the menu until June 9. Like all ButterBurgers at Culver’s, the handcrafted Colby Jack Pub Burger starts with fresh, never frozen, Midwest ...", "Facebook Co-Founder's 'Game of Thrones'-Themed Wedding Sounds Crazy Cool": "Billionaire tech entrepreneur Sean Parker's been on a pretty wild ride since he created Napster in the late '90s, co-founded Facebook with Mark Zuckerberg, and was even portrayed by Justin Timberlake in The Social Network. But it sounds like his upcoming ...", "With New Facebook Phone, Mark Zuckerberg Is One Step Closer to World Domination": "If the Internet rumor mill is right, the Facebook phone will launch on Thursday. Here are seven reasons this is ridiculous. By Winston Ross. SHOCKINGLY BOLD PREDICTION: Once the crazily anticipated “Facebook Phone” does or does not get ..."}, "apple": {"Apple Co-Founder Visits UA Campus": "Co-founder of Apple computer, Steve Wozniak, was invited to the University of Arkansas as part of the Distinguished Lecture Series. The audience at Barnhill Arena was eager to listen to Wozniak on Sunday (April 7) and received him with a warm ...", "Big week in Big Apple for mat fans": "The annual phenomenon that is WrestleMania, which has seemingly taken over the New Jersey/New York metropolitan area this week with World Wrestling Entertainment superstars and personalities turning up just about everywhere, will finally take ...", "Amanda Bynes Blusters Through The Big Apple With A Joint In Her Hand?!": "We know many big cities have roach problems, but we weren't expecting this, LOLz!! Between her courtroom dramz, her lewd tweets at Drake, and her threats to sue anyone who says or writes her name, today's Amanda Bynes ... Don't worry, Amanda Bynes is still ...", "Apple Polisher Awards Honor Staff and Faculty": "Bison Ambassadors chose 29 staff and faculty to receive this year’s annual Apple Polisher Awards. Each Bison Ambassador nominates someone and is responsible for delivering one gift to him or her every day during Apple Polisher Week. Most gifts ...", "Apple Shooting 2 - AppStore Popular Shooting Game - i-Life Mobitech": "[prMac.com] Bangalore, India - After a great success of Apple Shooting2 HD for iPad Version, with 50 new exciting levels, i-Life Mobitech has released the iPhone Version of Apple Shooting2 for iPhone! Download a copy to get addicted. Apple Shooting is an ...", "Wrestlemania rockets into Big Apple bigger (and badder) than ever": "As the arena filled with spectators for a pro wrestling show last month, many screaming Ric Flair’s battle cry of “Whoo!” it seemed apparent that most in attendance didn’t care if the rivalries were staged (they were) and punches fake (more like ...", "Olivia Wilde: Big Apple Dog Walker": "Kicking off her week with a spot of exercise, Olivia Wilde took her pet pooch for a jaunt around Manhattan this afternoon (April 8). Joined by a guy pal, the soon-to-be Mrs. Jason Sudeikis donned sunglasses along with a pink sweater and green trousers as ...", "CMA Songwriters Series returns to the Big Apple with Phil Vassar on the bill (Photos)": "The CMA Songwriters Series will return to a city and locale that's become its home away from home, the acclaimed Joe's Pub in New York City, for a special two-night event on May 7 and 8. Now in its ninth year, the CMA Songwriters Series will feature ...", "Amanda Bynes Smokes Up in the Big Apple; Threatens to Sue for \"Fake Stories\"": "While stories of her strange behavior continue to make headlines, Amanda Bynes stepped out in New York City smoking a hand-rolled cigarette on Monday (April 8). The \"All That\" star wore a black jacket, gray top, black leggings and tan fuzzy-lin ..", "Curried Carrot and Apple Soup": "Looking for a way to spice up your dinner? Try this curried carrot soup. Heat the oil in a large, heavy bottomed pot over medium heat. Add curry powder and cook, stirring, for 2 to 3 minutes. Add diced carrots, onions and apple, and stir until coated with ...", "This Deliciously Modern Home, Designed By Apple Co-Founder Steve Wozniak, Can Be Yours For A Mere $4.4 Million": "Apple Inc. (Nasdaq:AAPL) and the late Steve Jobs are as inextricably linked as many people are to their iPhones, but Jobs would never have made it as far as he did had he not met Stephen Gary Wozniak, aka \"the Woz.\" After all, the college dropout invented ...", "Anne Hathaway and Adam Shulman Brave the Big Apple": "Facing the City with a united front, Anne Hathaway and Adam Shulman left their apartment in Brooklyn on Monday (April 8). The \"Les Misérables\" star looked cute in a long-sleeved navy top, floral patterned scarf, and blue jeans, while her hubby wore a ...", "Rising Apple Report, Ep. 16 – Phillies Series Preview and Swinging ’73′s Matt Silverman": "With the baseball season just getting into the swing of things, The Rising Apple Report changes with the tides, altering its schedule for We will also check back in after the series this Thursday. On today’s episode, Sam and Kevin will break ..."}, "banana": {"Banana cake recipe is family heirloom": "If you love banana desserts, you'll fall head over heals for this banana cake with fluffy homemade buttercream frosting from home cook Sandy Jones. Her great-grandmother's recipe, it's been handed down generation to generation. Try it once and ...", "Falling in Love With Banana Republic's 'Mad Men' Collection": "Half the fun of watching Mad Men is drooling over Jon Hamm and the 1960s designs that the cast wears so well. Joan's body-hugging office wear and Betty's picture-perfect riding suits speak wonders of their complex and captivating personalities. Seriously ...", "Chocolate and Banana Crepes": "Mix eggs, milk and butter together. Add the flour little by little depending on the consistency of the batter. Add a little water to make it runny. Always remember the batter for crepes has to be absolutely free flowing, it should not be thick because you ...", "ODC and Banana Republic Dance Downtown Opening Night Gala": "Dinner, dancing and one fabulous party. What better way for ODC Dance Company and Banana Republic to celebrate their newly formed collaboration than with a trio of events in one perfectly choreographed evening. Jack Calhoun, Global President of Banana ...", "Laotian New Year celebrated in Newmarket": "It included such traditional Lao foods as sticky rice, beef jerky, fried noodles, egg rolls, fried rice, Ban Kno (filled with meat and mushrooms), and purple rice with coconut and sugar wrapped in banana leaves for dessert. Gardner said it's a ...", "Lee Seung Gi To Appear As Hero In Upcoming Banana Yoshimoto Romance Novel 'Shall We Love' For Women's Magazine Anan": "Lee Seung Gi will soon be able to add romance novel hero to his resume. The K-pop star will be immortalized as the central character of Banana Yoshimoto's upcoming serialized romance novel 'Shall We Love,' to be published in the women's magazine ...", "Banana Slug Sting Band: Local group continues educating after 28 years": "For 28 years, the Santa Cruz-based Banana Slug String Band has sought to simultaneously educate and entertain local students by delivering didactic bluegrass music. \"It really plants the seed for further investigation; there's a huge amount of ...", "Doing It Downton Style: Eating at the Abbey with Banana Cream Cake": "It is a long off-season for Downton Abbey fans the world over. As the cast and crew are currently filming season four of the acclaimed series, fans of the most popular show in PBS history are going through Downton withdrawals. What is an Abbey addict to do?", "Dear Abby: Young actress cast in old role tires of playing second banana": "Dear Abby: I’m a member of a theater company for teens and I auditioned for the musical “Fame.” The director wants to give me a role as one of the teachers. Show after show, I get matronly roles with no memorable lines or funny scenes.", "Dear Abby: Young actress tires of playing second banana": ":Dear Abby: I’m a member of a close-knit theater company for teens, and I auditioned for the musical “Fame.” The director wants to give me a role as one of the teachers. Show after show, I get matronly roles with no memorable lines or funny scenes.", "Gordon Ramsay's Caramelized Banana Split": "Chef Gordon Ramsay is known for his fiery temper as much as his passionate cooking. Now the British cook has come up with a book geared toward people who want good food fast. His best-selling, family-friendly book, \"Gordon Ramsay's Fast Food,\" has a ...", "Dishes in the desert: Banana cake a delightful spring dessert": "I had four bananas sitting in my fruit bowl, ripe and ready to be used in something delicious. A few days ago, I was wandering through Pinterest and found this banana cake recipe (afarmgirlsdabbles.com/2013/02/15/banana-cake-with-cinnamon-cream-cheese ...", "Go Bananas For Vanilla Wafer Cookies & Banana Pudding!": "Popular desserts are always hard to top. Banana pudding is one of those things that can’t be improved just made right. This recipe for banana pudding ensures that this popular, delicious dessert is made properly. The best part about banana ..."}}}
