{"duke blue devils": {"Skylar Diggins leads Notre Dame past Duke, to Final Four": "Notre Dame Fighting Irish guard Skylar Diggins shoots the ball as Duke Blue Devils guard Alexis Jones defends during the first half at Ted Constant Convocation Center. (Photo: Geoff Burke, USA TODAY Sports) NORFOLK, Va. (AP) — Skylar Diggins ...", "NCAA Tournament Picks: Duke Blue Devils vs. Louisville Cardinals": "Duke defeated No. 3 seed Michigan State 71-61 as two-point neutral-site favorites in the Sweet 16 of the 2013 NCAA Tournament, while going UNDER the total for the third consecutive contest. The Blue Devils have won all 16 of their games against non ...", "Duke Sweeps 800, Shot Put and Pole Vault Saturday": "DURHAM, N.C. – On the final day of the Duke Invitational, the Blue Devils sweep the 800 meters, the shot put and the pole vault April 6 in Durham, N.C. Senior Cydney Ross and freshman Michal Filipczak were both able to outkick the field in the ...", "Krzyzewski got all he could out of Duke team": "In the end, Mike Krzyzewski got just about everything he could out of his Duke Blue Devils. It didn’t seem the season would end quite so early when Ryan Kelly went off for 36 points in his comeback game against Miami in late February. That night ...", "Michigan State Spartans vs Duke Blue Devils: Game Time, TV Channel Schedule, March Madness 2013 Sweet 16": "Michigan State is the most popular of the college basketball. For the 4th time in their history of NCAA tournament, Spartans would take on Blue Devils. And this seems like the most consistently matched of those matches on the paper. Midwest Regional the ...", "Irish women a big challenge for Duke": "This is the third straight year a second-seeded Duke team has met a top seed in the regional finals of the NCAA women's basketball tournament. No one expects the Blue Devils to have more luck against Notre Dame on Tuesday night in Norfolk ...", "A Look At The Duke Blue Devils": "The Huskies and Duke announced in May the extension of their home-and-home series through 2014-15. The teams will play at Connecticut this season, then in Durham in 2011-12 before alternating sites through 2014-15. \"We are excited to continue and grow our ...", "Louisville vs. Duke Elite Eight Preview Capsule: Predict The Winner": "Top-seeded Louisville will take on the No. 2 Duke Blue Devils in the Midwest Regional finals with a spot in the Final Four on the line. After eliminating Tom Izzo and the Michigan State Spartans in the Sweet 16, Coach K and the Blue Devils have ...", "McCallie prepares Duke to continue along road to Final Four": "The second-seeded Duke Blue Devils have taken the trip to the NCAA Women’s Basketball Tournament Regional many times – 15 times in the last 16 years to be exact. As they held one more practice on Friday morning at the Michael W. Krzyzewski Center ...", "Louisville tops Duke, earns trip to Final Four after Ware inspires": "Louisville Cardinals guard Peyton Siva (3) shoots against Duke Blue Devils forward Ryan Kelly (34) in the first half during the finals of the Midwest regional of the 2013 NCAA tournament at Lucas Oil Stadium. (Photo: Jamie Rhodes, USA TODAY ...", "2013 NCAA Tournament: No. 2 Duke Blue Devils Offense A No Show In Elite Eight": "Following the recent release of outside linebacker Andy Studebaker, the Kansas City Chiefs are looking to add some depth at the position behind starters Tamba Hali and Justin Houston. What better way to do so than via the 2013 NFL Draft?", "Nebraska-Duke Preview": "The Blue Devils have lost three straight regional finals and are determined to not make it four in a row. Second-seeded Duke (32-2) plays sixth-seeded Nebraska (25-8) on Sunday in the Norfolk Regional semifinals. And if the Blue Devils beat the Cornhuskers ...", "Blue Devils blitzed: Louisville’s burst buries Duke in Elite Eight": "INDIANAPOLIS — With Louisville on the free-throw line and exactly two minutes remaining in Sunday’s Midwest Region final, Mason Plumlee took a few moments to calculate the likelihood of improbability. The power forward quickly came to a ...", "3/31/13 Mark’s Free College Basketball Pick Against the Spread": "The Duke Blue Devils and the Louisville Cardinals collide in an Elite Eight match up Sunday. I guess we can say it was another typical year for Duke basketball as they challenged in the ACC as usual and are now in the Elite Eight looking for a ...", "Duke tangles with Louisville in Midwest Regional final": "Indianapolis, IN (Sports Network) - Two iconic coaches meet in the Elite Eight, as Mike Krzyzewski's Duke Blue Devils take on Rick Pitino's Louisville Cardinals in the Midwest Regional final at Lucas Oil Stadium on Sunday. The winner advances to the Final ...", "Duke Blue Devils": "As you probably know, we have a long-standing tradition here of an April Fool’s joke (our most recent one appears destined to live for a while). Still, we know greatness when we see it, and these guys were absolute masters of pranking. How masterful?", "Louisville Cardinals vs Duke Blue Devils Live Stream Free: Watch Online NCAA 2013 March Madness Elite 8 College Basketball (TV Schedule)": "Louisville Cardinals vs Duke Blue Devils takes place in the NCAA 2013 tournament on Sunday in the final if the Elite 8 March Madness games taking place over this Easter weekend. The game is scheduled to tip off at 5.05 p.m. ET and can be watched ...", "College Football Nation: Duke Blue Devils": "Last Wednesday's announcements that Connecticut had agreed to a home-and-home series with Boise State and that Cincinnati would be heading to the Big House in 2017 were the latest in a trend that has seen BCS-conference schools boost their nonconference ...", "Final Four, as told by Duke Blue Devils’ women’s coach": "Duke coach Joanne P. McCallie takes a look at the games in the women’s Final Four. Her Blue Devils played Connecticut, Notre Dame and California this year. Connecticut vs. Notre Dame, 8:30 p.m., ESPN: This has been the matchup in women’s ...", "Duke Basketball: Projecting Blue Devils' 2013-14 Rotation": "Despite coming up just short in its quest to reach this year's Final Four, the Duke Blue Devils produced another successful 30-win season while appearing in its 19th Elite Eight in school history. More than that, though, with the 2012-13 season in the ...", "Div. II champion Drury gets invitation from Duke": "After holding off Metro State for their first Division II national championship, the Drury Panthers will get a chance to topple Division I powerhouse Duke. The Blue Devils issued an invitation Monday to the southwest Missouri school to play an October ...", "Baseball Ready for Pair of Midweek Games": "DURHAM, N.C. – Fresh off a series win over No. 15 Georgia Tech , the Duke baseball team wraps up its nine-game home stand with a pair of non-conference games this week at Jack Coombs Field. The Blue Devils welcome UNC Greensboro Tuesday at 6 p ...", "Duke’s Gray Named to Coaches All-America Team": "Duke Blue Devils guard Chelsea Gray was honored at the 2013 NCAA Women’s Final Four by being named to the prestigious 10-member 2013 NCAA Division I Coaches' All-America Basketball Team at New Orleans Arena in New Orleans, La. on Saturday. Gray was ...", "Duke Blue Devils Vs. Michigan State Spartans: Watch Live Stream Of NCAA Basketball Tournament Sweet 16 Online For Free; Preview": "Before you watch the live stream of Duke versus Michigan State, here is a preview of Friday's matchup. Per STATS LLC, the win makes the Spartans just the second team to make the Sweet 16 in five out of the last six years, joining this season's ...", "Duke Tops Michigan State 71-61: Seth Curry Leads Blue Devils Past Spartans": "INDIANAPOLIS -- Mike Krzyzewski already holds the NCAA record for most wins by a coach. Thanks to Seth Curry's big scoring night, Krzyzewski could finish the weekend by tying one of John Wooden's records. Curry scored 29 points, tied the school ...", "Duke Blue Devils vs Michigan State Spartans Live Stream Free: Watch Online NCAA 2013 March Madness Sweet 16 Basketball (TV Schedule)": "Duke Blue Devils vs Michigan State Spartans takes place in the NCAA 2013 Sweet 16 round on Friday night in what should be an explosive encounter between two of the best college basketball teams in the nation. The game is scheduled to tip off at ...", "In 2013-14, Duke Blue Devils will be smaller, more athletic": "INDIANAPOLIS The Blue Devils had already had their NCAA-mandated, 10-minute cooling-off period, giving them time to absorb the reality of their season-ending loss, but Rasheed Sulaimon was still visibility upset when the doors opened for the media.", "Duke women run out of steam against Irish onslaught in Elite Eight": "When Skylar Diggins and the Notre Dame Fighing Irish got hot offensively in the second half, the Duke Blue Devils were in trouble. Diggins finished with a game-high 24 points and nine assists to lead the top-seeded Irish to an 87-76 victory over the No. 2 ...", "Duke, Michigan State in clash of coaching titans": "INDIANAPOLIS — The Duke Blue Devils believe they will beat Michigan State tonight and advance to the Elite Eight because Mike Krzyzewski is their coach. The Michigan State Spartans believe they will beat Duke tonight and advance to the Elite Eight ...", "Mitch Albom flashback: Michigan's victimized by Devil's Night in 1992 NCAA title game": "End of chapter. The story continues. This was no funeral, this 71-51 title-game loss to the defending champions of college basketball, the Duke Blue Devils, who showed the world in the second half how to get the most from an exhausted yet ..."}, "texas aggies": {"Crimson Tide men’s golfers win Aggie Invitational": "BRYAN, Texas | The second-ranked University of Alabama men’s golf team won the Aggie Invitational by 18 shots Sunday, and Cory Whitsett captured medalist honors at The Traditions Club, a par-72, 7,146-yard layout. It was the Crimson Tide’s ...", "Aggie women beat Alabama to take control of SEC West": "The Texas A&M women's tennis team didn't win the Southeastern Conference championship Sunday, but it sure felt like it. The fourth-ranked Aggies rallied for a 4-3 victory over seventh-ranked Alabama, getting singles victories by Cristina Stancu ...", "Texas A&M’s Shelbi Vaughan wears expectations well entering Pepsi Invitational at Hayward Field": "Vaughan, a reserve on the Texas A&M volleyball squad, is scheduled to compete in both the shot put and discus at the four-way meet that pits second-ranked Oregon against the No. 3 Aggies, No. 15 Washington and Washington State. She embraces her status as ...", "Aggies Salvage Sunday Game": "The Texas A&M Aggies capitalized on a strong pitching performance by junior Rafael Pineda to stave off a series sweep by the Auburn Tigers, winning Sunday’s finale 4-1 on Olsen Field at Blue Bell Park. The Texas A&M Aggies capitalized on a strong ...", "Aggies to muster in Willow Park": "... Former students of Texas A&M University will assemble in Willow Park on April 21st for the annual Parker County Texas Aggie Muster in honor of all Texas Aggies who have passed away within the last year, announced Muster Chair Graham Quisenberry ‘77.", "Aggies aiming to get it together in rugged SEC": "COLLEGE STATION — Football earned most of the attention when Texas A&M announced its intent to enter the Southeastern Conference, but baseball is every bit as rugged in the Aggies' new league. A&M coach Rob Childress is finding that out first-hand this ...", "Manziel thought about playing baseball with Aggies": "Manziel said he talked to Texas A&M baseball coaches last summer about joining the team. That was before the longtime Rangers fan beat out Jameill Showers for the starting quarterback job as a redshirt freshman with the Aggies along to way to a record ...", "Damontre Moore Says He’s trying to Prove That His Stats Weren’t a Fluke": "Since the time he arrived on campus at Texas A&M, Damontre Moore had some big shoes to fill. He spent his freshman year playing behind college football’s sack leader, Von Miller, and was looked at as Miller’s heir-apparent. When Miller ...", "Texas A&M Men’s Golf Finishes Fifth at Aggie Invitational": "BRYAN, Texas — The No. 23 Texas A&M men’s golf team wrapped up play at the 2013 Aggie Invitational on Sunday afternoon, finishing in a tie for fifth place. The Aggies (291-288-291=870) shared the fifth spot in the standings with No. 5 UCLA ...", "Aggies Drop 10-5 Decision to Auburn": "COLLEGE STATION, Texas – The Texas A&M Aggies fell behind early and were unable to erase a 9-0 deficit in Saturday afternoon’s 10-5 loss to the Auburn Tigers on Olsen Field at Blue Bell Park. The Tigers drew first blood in the top of the ...", "Golf: UNT men finish 11th at Aggie Invite": "COLLEGE STATION — The North Texas men shot their best round of the tournament with a third-round 2-over-par 290 on the final day of the Aggie Invitational on Sunday. The 33rd-ranked Mean Green began the day in a tie for 11th with No. 45 Texas ...", "Texas Incubates New Ciena Hotel Brand With Eye on Global Expansion": "Texas has given a lot of things to the world: Longhorns, Aggies, Cowboys, Hilton Hotels, and La Quinta Inns. It’s about to give another gift – a new focused service hotel brand conceived by a Texan with deep roots in the hotel industry. A kind of hotel ...", "Aggies Fall 4-0 to Idaho and UTSA": "SAN ANTONIO, TEXAS – The New Mexico State women’s tennis team fell in two straight Western Athletic Conference duals to wrap the weekend in San Antonio. The Aggies fell 4-0 to Idaho on Saturday, April 6, and then suffered a 4-0 loss to UTSA on Sunday ...", "Aggies pitcher Newman earns WAC honor": "This is the second of her career. Newman went 3-0 with a 0.40 ERA last week as the Aggies moved into first place in the WAC standings with a series sweep of Texas-Arlington. She opened the week with a complete-game victory, allowing one unearned ...", "UPDATE: Aggies, Zedler cite religious freedom in charge against LGBT centers": "The GLBT center at Texas A&M receives about $100,000 per year (or $2 per student), Sosa said. “Students should be able to decide where their money goes,” Sosa said. “Its not my intention to hurt the resources provided to GLBT Aggies.” Zedler ...", "No. 9 Aggies Complete Sweep of CSU With 10-2 Run-Rule": "... The No. 9 Texas A&M softball team (31-7) completed its series sweep of Colorado State (17-17) with a 10-2, five-inning run-rule victory, Sunday in the non-conference series finale. A six-run bottom of the second gave the Aggies an early lead ...", "Oregon men upset No. 1 Texas A&M to win the Pepsi Team Invitational; Aggies ambush the UO women": "EUGENE – Jeramy Elkaim and Parker Stinson went 1-2 in the 5,000 meters as Oregon wrapped up the Pepsi Team Invitational men’s title with a flourish on a wet Saturday at Hayward Field. While Elkaim and Stinson pulled away, Greg Skipper and Miles Walk ...", "Otaro Alaka set to decide between Texas, Texas A&M": "The ongoing competition between the Texas Longhorns and Texas A&M Aggies will add another chapter on Monday when four-star Houston (Texas) Cy Falls linebacker Otaro Alaka makes his decision between those two schools: Top247 LB Otaro Alaka making ...", "Texas Football: 10 Greatest Wins of the Mack Brown Era": "Chris Simms, meanwhile, overcame two interceptions and threw for three touchdowns in what was, at the time, the first landslide victory over the Aggies during the Brown Era. Thanksgiving night in college football became synonymous with Texas ...", "An epic comeback, and eventual defeat for Aggie baseball": "The Aggies are now 18-15 on the season, 4-5 in the WAC, while Dallas Baptist is 17-15 overall, 5-4 in league. First-place teams California State Bakersfield and Texas-Arlington hold 6-3 WAC records. \"You're looking at a game that could have been ...", "OLB Otaro Alaka picks Horns over Aggies": "Alaka took two visits to Texas A&M -- including this weekend for the Aggies’ Friday Night Lights scrimmage -- and made a return trip for the Texas spring game. \"[Friday Night Lights] did kind of did make it tougher, but really, I just knew,\" Alaka said.", "Aggies Lose Opener to Auburn": "The Texas Aggie baseball team dropped Friday night’s series opener against the Auburn Tigers at Olsen Field, losing a 6-4 decision in 10 innings. A&M plated two first inning runs but were unable to hold onto the lead giving up the lead in the 7th inning ...", "Duke Finishes Seventh at Aggie Invitational": "BRYAN, TEXAS --Freshmen Mads Soegaard and Motin Yeung along with senior Brinson Paolini fired under-par rounds Sunday to lead Duke to a three-under 285 in the final round of the Aggie Invitational at the Traditions Golf Club. The Blue Devils ...", "CSU Softball Drop Final Game of Series With #9 Texas A&M": "Freshman pitcher Holly Reinke was able to keep the Aggies scoreless in the bottom of the first, keeping the score 0-0 until the bottom of the second inning when Texas A&M brought in six run, two coming off of a home run by the Aggies' senior catcher Meagan ...", "Texas A&M’s Johnny Manziel says shoving incident with grad assistant wasn't 'serious': 'I wasn't trying to be disrespectful'": "Texas A&M quarterback Johnny Manziel sat down with reporters from USA Today and the San Antonio Express-News for an extensive interview last week. Here are some highlights: On what happened during the incident when he shoved a grad assistant at ...", "Texas A&M's Johnny Manziel considering self-imposed media ban: 'There are some people that don’t have the best intentions'": "As soon as Texas A&M head football coach Kevin Sumlin took the media muzzle off his freshman quarterback, Johnny Manziel went from a mystery man to a front-page mainstay who even made an appearance on The Late Show with David Letterman.", "Always a steep climb in SEC West": "COLLEGE STATION, Texas -- By all accounts, Texas A&M's maiden voyage through the SEC West was better than almost anyone outside of College Station expected. The Aggies finished 11-2 overall and 6-2 in the SEC, including a 29-24 upset of No. 1 ...", "The Ag Delusion: What's Missing from Encana Aggie Days? Just the Truth..": "Aggie Days, an event that celebrates a sanitized and fictitious ... Photo: Pigs from Manitoba destined for Mexico died enroute in Texas after being left for days in a transport trailer without water in temperatures of over 90 degrees Farenheit.", "Texas scores win over A&M with Alaka": "There is no telling when, or if, the Longhorns and Aggies will ever resume their heated rivalry, which Texas, for now, claims bragging rights over with a win in the 118th meeting back in 2011. While they might not be presently trading blows on the field ...", "Williams places fourth, Huskies third at Aggie Invitational golf | Northwest": "Washington finished third as a team at the Aggie Invitational in Bryan, Texas, and senior Chris Williams placed fourth at The Honors Course on Sunday. Washington shot a final-round 3-over 291 for a total of 4-over 868. The Huskies finished four ..."}, "dallas mavericks": {"Notebook: Mavericks 117, Kings 108": "THE FACTS: The road weary Dallas Mavericks came into Sleep Train Arena Friday needing a win to stay in the playoff hunt after dropping a heartbreaker last night, and got just what the doctor ordered as the Sacramento Kings gave very little ...", "Mavericks-Trail Blazers, Box": "Totals 37-80 13-16 91. Dallas 29 27 25 15-96 Portland 18 14 29 30-91 3-Point Goals-Dallas 3-13 (Carter 2-5, Mayo 1-3, Crowder 0-1, Nowitzki 0-2, M.James 0-2), Portland 4-22 (Babbitt 2-7, Claver 1-3, Matthews 1-3, Maynor 0-2, Barton 0-2, Lillard 0-5).", "Sacramento Kings Vs. Dallas Mavericks": "The Dallas Mavs still have a very outside shot at the playoffs this season, but to do so the Mavs must get a win here on Friday against the Kings. The Sacramento Kings are just 27-48 this season, so it’s pretty safe to say that Sacramento won ...", "Mavericks fend of pesky Blazers to squeeze out win!": "“Whew!”; I’ll bet that’s what a lot of the Dallas Mavericks organization is saying today. A quote by Branden Wright in reference to the fact that Portland had lost 7 of it last games and would be throwing everything at Dallas including ...", "Denver Nuggets edge Dallas Mavericks in final seconds": "Denver Nuggets guard Andre Miller (24) drives to the basket against Dallas Mavericks guard Vince Carter (25) during the first half at the Pepsi Center. (Photo: Chris Humphreys, USA TODAY Sports) DENVER (AP) — Thanks to Corey Brewer, the Denver ...", "Mavericks hold on for 96-91 win over Portland (Yahoo! Sports)": "PORTLAND, Ore. (AP) — Chris Kaman scored a season-high 26 points and the Dallas Mavericks boosted their faint playoff hopes with a 96-91 victory over the slumping Portland Trail Blazers on Sunday night., http://juicedsportsblog.com/sports-news/news ...", "NBA PM: No Gallinari, No Problem For Nuggets?": "All of a sudden people have been talking about Gallo as if he were Kobe Bryant to the Los Angeles Lakers, Dirk Nowitzki to the Dallas Mavericks or LeBron James to the Miami HEAT. Gallo isn’t even the Nuggets’ leading scorer at 16.2 points ...", "Preview": "The Dallas Mavericks are well aware time is running out if they want to avoid missing the playoffs for the first time since 2000, but they seemingly have a favorable schedule down the stretch. They conclude a four-game road trip Sunday night ...", "At a glance: Mavericks 96, Blazers 91": "Cold from the start: The Mavericks were hot from the jump ball, scoring the first nine points of the game and building a 21-11 edge in the first quarter. By halftime, the Dallas lead had swelled to 56-32. It was the largest halftime deficit the Blazers ...", "Checking in with Dallas Mavericks guard Darren Collison": "It was quite an interesting off-season for the Dallas Mavericks as the franchise had salary cap space to sign a big name free agent for the first time in the Mark Cuban-era. The big ticket item on the market was Nets free agent point guard and ...", "Dallas Mavericks at Sacramento Kings": "(AP) -- With time running out on their season, the Dallas Mavericks can't afford to let any more potential victories slip away if they want to reach the playoffs for a 13th consecutive season. The visiting Mavericks look to avoid a third ...", "Dallas Mavericks: No Really, Tonight is a Must Win": "Tonight’s matchup against the Denver Nuggets is a must-win for the Dallas Mavericks. No, seriously. It is. Don’t tell me you’ve heard this before. Sitting two and a half games outside of the Western Conference’s eighth seed currently held by Kobe ...", "Can the Dallas Mavericks’ prayers be answered for the playoffs?": "With the Dallas Mavericks season hanging in the balance, they only have 6 games left to try and make it to the playoffs for a 13 consecutive year, but without winning the majority of their games left and getting some help from the Lakers and ...", "Preview: Mavericks at Kings": "The Dallas Mavericks' streak of 12 straight postseason appearances is nearing an end, barring a stunning turn of events over the final seven games. The Mavericks absorbed a last-second loss in Denver on Thursday night to fall three games behind ...", "TrueHoop: Dallas Mavericks": "Dallas Mavericks owner Mark Cuban recently said that he would consider drafting Brittney Griner in the second round of the NBA Draft. Could Griner play in the NBA? Would it be wise for the Mavericks to use a second-round pick on the Baylor superstar?", "Mavericks 96, Trail Blazers 91": "Chris Kaman scored a season-high 26 points and the Dallas Mavericks boosted their faint playoff hopes with a 96-91 victory over the slumping Portland Trail Blazers on Sunday night. Kaman added 11 rebounds for the Mavericks, who were 2 1/2 games back of ...", "Upbeat Clippers rest, look forward to building momentum for playoffs": "Then, the Thunder lost in the Western Conference finals in 2011 to the Dallas Mavericks, and then the Thunder won the West before losing in the 2012 NBA Finals to the Miami Heat. Seeing how the Clippers are headed toward back-to-back playoff ...", "Rapid Reaction: Mavericks 96, Trail Blazers 91": "The Dallas Mavericks built a massive lead after pouncing on Portland and survived a late run by the Trail Blazers. Dallas scored the first nine points of the game and led by 26 at one point -- 20 in the fourth quarter. But the Blazers, fueled by a 17-2 run ...", "Dirk Nowitzki ponders his future with Dallas Mavericks": "Dallas Mavericks power forward Dirk Nowitzki (41) is pondering his future. (Photo: Ed Szczepanski-USA TODAY Sports) There is no bitter expression hidden underneath Dirk Nowitzki's mangy beard. No covert biting of the tongue, either. The Dallas ...", "Dallas Mavericks owner would support first gay player on his team": "If fact, Dallas Mavericks owner Mark Cuban says he would be \"honored\" if the first gay active NBA player was on his team according to TMZ on Thursday. Cuban echoed Magic's assessment about an owners responsibility to support their players and educate the ...", "5 Free Agents for Dallas Mavericks to Target": "It appears that the final four doesn’t only apply to the current college basketball tournament happening right now in Atlanta. It also appears that the Seattle Seahawks have their list of final four candidates to replace the recently traded ...", "Can Brittney Griner play in the NBA? Dallas Mavericks owner Mark Cuban sparks a debate": "Mark Cuban wants to give Brittney Griner a chance to play in the NBA, Geno Auriemma publicly panned that idea and Shane Battier says, just based on the law of averages, it's going to happen someday. But the WNBA? They're not saying anything. The league ...", "Dallas completes season sweep of Kings with 117-108 win": "SACRAMENTO, Calif. — Shawn Marion had 25 points and 12 rebounds, and the Dallas Mavericks snapped a two-game losing streak with a 117-108 victory over the Sacramento Kings on Friday night. The Mavericks (37-39) used a 41-point second quarter ...", "4/7/13 Dan’s Free NBA Basketball Pick Against the Spread": "The Portland Trail Blazers collide with the Dallas Mavericks on Sunday night from the Rose Garden. Head to head, the Mavericks are 8-3-1 ATS in the last 12 meetings and 3-1-1 ATS in the last 5 meetings in Portland while the underdog is 5-2 ATS ...", "Recap: Denver vs. Dallas": "Andre Iguodala made the game-winning layup with 2.8 seconds remaining and Corey Brewer blocked Anthony Morrow's potential game-winning trey to lift the Denver Nuggets to their 19th straight home win in a 95-94 win over the Dallas Mavericks on ...", "NBA Game Summary - Dallas at Sacramento": "Sacramento, CA (Sports Network) - Shawn Marion scored a team-high 25 points and pulled down 12 rebounds to lead the Dallas Mavericks to a 117-108 win over the Sacramento Kings on Friday. Brandan Wright and Darren Collison added 20 and 18 points off the ...", "Dallas Mavericks Escape Portland Trail Blazers with a Win": "I have no doubt in my mind that the Cleveland Browns will be selecting a corner back in this year’s NFL Draft. The Draft is full of defensive back talent through all rounds. Who that corner is— remains up for debate. There is the possibility of Alabama ...", "Hidden Secrets to the Recent Dallas Mavericks Playoff Surge": "Somehow, someway the Dallas Mavericks are still in contention for a Western Conference playoff spot this season. Despite injuries, inconsistent play and having to deal with almost an entirely new roster, Rick Carlisle has held this team together just ...", "Mavericks hold on for 96-91 win over Portland": "PORTLAND, Ore. (AP) -- Chris Kaman scored a season-high 26 points and the Dallas Mavericks boosted their faint playoff hopes with a 96-91 victory over the slumping Portland Trail Blazers on Sunday night. Kaman added 11 rebounds for the Mavericks ...", "Nowitzki lifts Mavericks past Bulls 100-98": "Dirk Nowitzki said the ball felt flat coming out of his hand. It turned out to be the perfect trajectory for the Dallas Mavericks. Nowitzki hit a 3-pointer with 2.9 seconds left and the Mavericks rallied to beat the Chicago Bulls 100-98 on Saturday."}, "texas longhorns": {"Texas Longhorns Football Recruiting": "There wasn’t a whole lot that 2014 defensive tackle Courtney Garnett (New Orleans/Saint Augustine) didn’t absolutely love about his visit to Texas on April 30. He spoke as highly about the Longhorns as one could without showing his hand that he was ...", "Longhorns get 2014 pledge from linebacker Alaka": "The Longhorns football program picked up a commitment Monday night from one of the state’s top defenders in the 2014 recruiting class — Otero Alaka, a rangy linebacker from Houston Cypress Falls. In picking Texas over Texas A&M, Alaka becomes the ...", "Iowa State vs Texas: Football TV Channel Schedule, Game Time, Longhorns offensive attacks": "Iowa State vs Texas: Football TV Channel Schedule, Game Time, Longhorns offensive attacks. Iowa State vs Texas will have a monumental collision in Saturday’s football game. Texas Longhorns are back in chase for another win.They have triumphs only three ...", "Texas Volleyball celebrates 2012 National Championship with festivities in Gregory Gym": "It was also a chance for Texas Volleyball supporters to reminisce about UT's title run as Longhorn Network's documentary Point Texas: 2012 National Champions was screened on the Gregory Gym video board before the first serve. Following the match ...", "How Does Latest Player Arrest Affect Texas Longhorns?": "In what's becoming an all-too-familiar rite of spring passage for college football players, another arrest has occurred over the weekend. Texas Longhorn receiver Kendall Sanders was arrested early Saturday morning in Brazos County, Texas on a ...", "Texas drop series to Oklahoma 2-1": "... s two-run double capped a three-run eighth inning Sunday for the No. 13 Oklahoma Sooners in a 4-2 win over the Texas Longhorns to clinch the Big 12 series. Oklahoma (27-6, 7-2) earned its first series win over Texas (17-13, 3-6) since 1998.", "Texas Receiver Arrested On Drunk Driving Charge As Longhorns WR Kendall Sanders Stopped For Traffic Violation By A&M University Police": "University of Texas receiver Kendall Sanders got himself into some trouble over the weekend as he was arrested on a drunk driving charge. According to CBS Sports, the receiver was arrested after being stopped by Texas A&M University police early ...", "Recruiting: St Aug's Garnett pledges to Texas while U-High's Brossette keeps drawing interest": "Courtney Garnett (6'2-280), a 3-star DT out of St. Augustine,decided that he will be a Texas Longhorn for the 2014 season. Former LSU defensive tackle and assistant coach Bo Davis handled Garnett's recruitment for the 'Horns. Davis is currently the Texas ...", "Longhorns take series with Hilltoppers with ease": "In the first ever meeting with the Hilltoppers, No. 8 Texas flexed its muscles with a 4-0 win. Ace Blaire Luna (19-1) carried the Longhorns taking a perfect game into the seventh inning. But after a walk to begin the inning, Luna struck out the ...", "Fort Worth All Saints RB Daniel Gresham's commitment to Texas remains solid": "Gresham committed to Texas last August and has been solid ever since. A thee-star Scout.com prospect, Gresham also held offers from schools such as Alabama, Florida State and Ohio State. \"Coach (Major) Applewhite was probably the biggest reason ...", "The Finals: Texas Sweet 16": "The Wolfpack won 54-52 on a late dunk. 2. 1983 Houston: Benny Anders goes up for t ... Source: Burnt Orange Nation :: A Texas Longhorns Blog With the the 2012-13 basketball season in the books, it's time to perform the autopsy on the nightmare of a season.", "Texas Longhorns WR Kendall Sanders arrested for DUI": "The Texas Longhorns have already suspended one young wide receiver with legal problems this spring and may have to do so with another one after sophomore Kendall Sanders was arrested on Saturday: OB has confirmed that Texas WR Kendall Sanders was arrested ...", "Texas Longhorns pitcher Dillon Peters named conference pitcher of the week": "The Big 12 conference tabbed Dillon Peters as the pitcher of the week Monday after the sophomore threw seven innings of no-hit ball in a win over Oklahoma on Saturday. Peters began the game with three perfect innings before hitting a batter to begin the ...", "Pac-12: Texas Longhorns": "While some might be fixated on how Oregon State's season ended -- another loss to Oregon and a blown fourth-quarter lead in the Alamo Bowl against Texas -- the big picture for 2012 was undeniably attractive. The Beavers reversed course as a program.", "OU Baseball: Sooners end 15-year drought against Texas Longhorns": "Junior first baseman Matt Oberste receives the throw from junior second baseman Hector Lorenzana on a Kansas grounder up the middle for an out in the top of the sixth. The Sooners won the 10th-inning walk-off win 2-1 on Friday in Norman.", "Lady Toppers no-hit by Texas": "The No. 8-ranked Texas Longhorns softball team (34-4) got a grand slam from Karina Scott in the sixth inning and a no-hitter from pitcher Blaire Luna (19-1) in a 4-0 win Saturday over Western Kentucky at Red and Charline McCombs Field.", "WKU Softball Falls 3-1 at No. 8 Texas": "AUSTIN, Texas—The Western Kentucky University softball team (20-13) posted three hits in a 3-1 loss at No. 8 Texas Longhorns (35-4) on Sunday at Red and Charline McCombs Field. Senior Kellie Quarles went 2-for-2 at the plate for the Lady Toppers while ...", "Texas Incubates New Ciena Hotel Brand With Eye on Global Expansion": "Texas has given a lot of things to the world: Longhorns, Aggies, Cowboys, Hilton Hotels, and La Quinta Inns. It’s about to give another gift – a new focused service hotel brand conceived by a Texan with deep roots in the hotel industry. A kind of hotel ...", "OLB Otaro Alaka picks Horns over Aggies": "The Houston Cypress Falls outside linebacker committed to Texas on Monday night, choosing the Longhorns over Texas A&M. He became commit No. 13 in Texas’ 2014 recruiting class and the Longhorns' fifth new pledge in the past 10 days. [+] Enlarge Max Olson ...", "Texas repeats as ASU Invite champs": "AUGUSTA, Ga. – Texas captured its second consecutive Insperity Augusta State Invitational title in dramatic fashion Sunday afternoon at Forest Hills Golf Club. The fourth-ranked Longhorns edged the host Jaguars by two shots down the stretch ...", "New ‘LongHorn Steakhouse’ location opens in Webster": "WEBSTER, Texas -- LongHorn Steakhouse has opened a new restaurant location in Webster along the Gulf Freeway. The restaurant says it prides itself on providing guests with a cut-above steakhouse experience through its food – most notably ...", "Longhorns receiver Sanders arrested for DWI": "Texas Longhorns wide receiver Kendall Sanders was arrested for driving while intoxicated early Saturday morning, according to Brazos County Sheriff's records AUSTIN, Texas -- Texas Longhorns wide receiver Kendall Sanders was arrested for driving while ...", "Texas drops series opener against OU": "AUSTIN (KXAN) - Jonathan Gray allowed just one unearned run in 6 2/3 innings with eight strikeouts Friday as the No. 13 Oklahoma Sooners opened a Big 12 series with the 2-1 win over the Texas Longhorns. Oklahoma (26-5, 6-1) won for just the ...", "Texas Longhorns recruiting: Spring game helps net five commitments": "Not so long ago, the Texas Longhorns would routinely receive commitments from a handful of prospects on Junior Days in February, a process that has now slowed down to vault a weekend like that just experienced by the 'Horns into the rarefied air ...", "Courtney Garnett Commits to Texas: Longhorns Land 12th Commit for Class of 2014": "The Texas Longhorns keep rolling through the 2014 recruiting cycle. Mack Brown's program is arguably one of the hottest on the recruiting trail right now, and that momentum is certainly paying off in the form of commitments. Well, visits to Ole ...", "No. 8 Texas Uses Grand Slam to Edge WKU Softball 4-0": "AUSTIN, Texas--The No. 8 Texas Longhorns (34-4) posted a grand slam in the bottom sixth to edge out a win over the Western Kentucky University softball team (20-12) Saturday afternoon at Red and Charline McCombs Field. Junior Emily Rousseau (11-5 ...", "Texas Longhorns change in recruiting philosophy helps them take back momentum": "Three quarterbacks have found a new team where they will more than likely end up with the starting gig in an attempt to turn the fates of their respective franchises around. Carson Palmer was traded from the Oakland Raiders to the Arizona ...", "Texas scores win over A&M with Alaka": "There is no telling when, or if, the Longhorns and Aggies will ever resume their heated rivalry, which Texas, for now, claims bragging rights over with a win in the 118th meeting back in 2011. While they might not be presently trading blows on the field ...", "Longhorns raise national championship banner inside Gregory Gym": "Neal and rising junior Khat Bell each registered three kills in the first set for Texas, who posted a .500 hitting percentage as a team for the set. Leading 15-8 in the second set, the Longhorns went on a 6-1 run to push their advantage to 21-9.", "The Shutdown 50: Texas DE Alex Okafor": "(USAT Sports Images) We continue this year's series with Texas defensive end Alex Okafor, who saw playing time pretty much right away with the Longhorns in 2009 as a backup defensive end, and then, switched inside to defensive tackle in 2010. That move ..."}, "dallas cowboys": {"Gosselin: Here is my ideal scenario for the Dallas Cowboys in the first two rounds of the NFL draft": "Columnist Rick Gosselin answered questions in a chat Monday. Here are some highlights. With the draft quickly approaching, what are you ideal 1st and 2nd round scenarios for the Cowboys? Ideally, OT and C. But the tackles go fast and they ...", "Report: Bengals work out Cowboys free agent RB Felix Jones": "Hoping a change of scenery can help resurrect his career following a down season in 2012, Dallas Cowboys free agent running back Felix Jones has reportedly worked out for the Bengals, Bryan Broaddus of DallasCowboys.com reported on Monday. Jones ...", "Get a sneak peak at Dallas Cowboys cheerleaders 2014 swimsuit calendar": "The Dallas Cowboys cheerleaders have released some behind the scenes shot of their 2014 calendar shoot. You can check out the shots here. We got a full photo look at the 2013 calendar if you're interested. And, just for fun, check out one of our ...", "Do The Cowboys Have Room For Another Receiver?": "Ever since the idea started to float around that the Cowboys could pick up a 1st-round receiver, I've been stuck on it. Cordarrelle Patterson, in particular, has me hoping that Jason Garrett, Derek Dooley and Tony Romo are all lobbying for ...", "TCU DE Stansly Maponga among locals to visit Valley Ranch on Dallas Day": "Defensive end Stansly Maponga will be among several TCU players at Dallas Day this week. That’s when the Cowboys work out local prospects who played high school or college football in the DFW area. Baylor receiver Lanear Sampson, TCU receiver ...", "Dallas Nike Football Training Camp recap": "ALLEN, Texas-- One day after the Dallas Elite 11 camp at the Cowboys Facility in Irving, many of the top prospects in the state of Texas and neighboring states showed up at Allen Stadium to showcase their talents during the Nike Football ...", "Cowboys: Dallas Cowboys": "Dallas Cowboys wide receiver Dez Bryant has signed a three-year endorsement deal with Jordan Brand. \"I didn't want to break the ice now, but I'm going to go ahead and put it out there I'm officially with the Jordan brand,\" Bryant said via his Twitter account.", "Report: NFL's \"In-Locker Room Camera\" Idea Likely Came From the Cowboys": "But where did the idea start? Well, according to one report, it started with the Dallas Cowboys. According to Charean Williams of the Fort Worth Star-Telegram, Dallas has been broadcasting images from within the locker room since Cowboys Stadium opened.", "Top Guard Could be Available When the Dallas Cowboys are on the Clock": "Saying that the Dallas Cowboys would be thrilled to draft Alabama guard Chance Warmack with the No.18 pick in the 2013 NFL Draft, would be an understatement. According to a mailbag post by ESPN’s Adam Schefter, there’s a darned good chance that ...", "Panthers-Cowboys Long Stats": "Drive: 8 plays, 61 yards, 3:38. Key plays: Collins 8 pass to Carruth on 3rd-and-1; Dallas' K.Smith holding penalty on 3rd-and-5 to Cowboys' 19. Carolina 10, Dallas 0. Dal_FG Cunningham 43, 2:27. Drive: 5 plays, 20 yards, 2:01. Key plays: Walker 45 kickoff ...", "Cowboys: Nate Livings": "PHOENIX -- Dallas Cowboys executive vice president Stephen Jones said the team is continuing its discussions with quarterback Tony Romo on a contract extension and that he believes they will eventually reach an agreement. Jones acknowledged it would be ...", "Tony Romo Contract: Inside Cowboys QB's New Deal": "Tony Romo #9 of the Dallas Cowboys looks for an open receiver against the Tampa Bay Buccaneers at Cowboys Stadium on September 23, 2012 in Arlington, Texas. (Photo by Tom Pennington/Getty Images) By Joel Corry, National Football Post Tony Romo ...", "Lessons learned: Dallas Elite 11": "the home of the Dallas Cowboys. The event features some of the nation’s top quarterbacks competing for a spot in the Elite 11 national competition this summer.", "The Big Mac Blog is now the Dallas Cowboys of sports blogs": "What was supposed to be a weekend complete with a planned ticker-tape parade, dancing monkeys and free balloons ended in utter disappointment - The Big Mac Blog is officially a Big Fat Loser. One year after stunning critics and Vegas oddsmakers by winning ...", "Cowboys Award 6-Year, $108 Million Extension To Super Bowl–Watching Quarterback Tony Romo": "IRVING, TX—In an effort to prevent the multiple championship–viewing player from reaching free agency, the Dallas Cowboys announced this week that the team had signed Super Bowl–watching quarterback Tony Romo to a six-year, $108 million contract ...", "Dallas Cowboys Rumors: Geno Smith Or Matt Barkley On Jerry Jones’ Rader?": "You are probably wondering how the heck rumors that the Dallas Cowboys may be interested in drafted Geno Smith or Matt Barkley ever started. Especially when you consider the fact that the Cowboys just threw a ton of money in Tony Romo's direction.", "Assigning Odds to Every Potential Dallas Cowboys 1st-Round Pick": "The Dallas Cowboys missed the playoffs for the third straight season in 2012 and must draft an instant contributor for next season. There are several names that fit this criteria for Dallas in the first round, but the team will need to choose which need ...", "Dallas Cowboys Likely Gave NFL Locker Room Camera Idea": "The NFL is making teams across the league install cameras in their locker rooms in a move that has been met with some skepticism. The cameras will broadcast footage from inside of the locker room on to the scoreboards so that fans will receive ...", "Raiders to host Dallas Cowboys in exhibition opener": "The Raiders' 2013 preseason schedule begins with a home game against the Dallas Cowboys. The game, to be played between Aug. 8-11, marks the second straight year the Raiders open at home against Dallas. Schedules of preseason opponents were ...", "Dolphins To Battle Cowboys To Kick Off Preseason In 2013 NFL Hall Of Fame Game": "CANTON, OHIO – The Miami Dolphins and Dallas Cowboys will kick off the 2013 preseason in the NFL/Hall of Fame Game. Tickets to the 2013 edition of the annual Pro Football Hall of Fame Game in Canton, Ohio will go on sale at 11:00 a.m. EDT today.", "Cowboys vs Eagles: Dallas can score over Philadelphia’s D": "It is not too late for the Philadelphia Eagles to make the move up into the standings after an awful start. Considered as the most talented team in the NFL even giving a name “Dream Team”, the Eagles so far played mediocre winning only two of their six ...", "Dallas Cowboys Rumors: Is Drafting a Wide Receiver a Priority for Dallas Cowboys?": "The Green Bay Packers find themselves still searching for help at running back. After yet again remaining quiet in free agency, Green Bay’s backfield is still right where it was three months ago – not that great. The latest buzz has the Pack ...", "Eric Winston a possibility for Cowboys": "Ian Rapoport of NFL.com reports that there is mutual interest between Winston and the Dallas Cowboys. How Dallas would create the room to add Winston remains to be seen but it is fair to speculate the team could consider cutting ties with Doug Free.", "2013 NFL mock draft: Cowboys select Barkevious Mingo": "With the 18th pick in Pride Of Detroit's 2013 NFL mock draft, the Dallas Cowboys select LSU defensive end/outside linebacker Barkevious Mingo. Jerry Mallory is serving as the Cowboys' general manager, and his reasoning for the pick is below.", "Dallas Cowboys: High Expectations in 2013 for Brandon Carr and Morris Claiborne": "COMMENTARY | How quickly we forget the days of Terence Newman, Pacman Jones and Anthony Henry. Thank goodness. I just had nightmares about thinking of those guys playing defensive back for the Dallas Cowboys. The grass is a little greener in terms of pass ...", "Report: Cowboys re-sign WR Anthony Armstrong": "One week after releasing Anthony Armstrong in a salary-cap related move, the Dallas Cowboys re-signed the veteran wide receiver on Wednesday according to multiple reports. Armstrong, 30, appeared in one game for the Cowboys in 2012 after he was signed by ...", "Dallas Cowboys Rumors: Are Cowboys Behind New League Policy?": "A few days ago, the NFL announced they would have cameras in the home team’s locker room and show the footage that would only be available for fans who attended the games. The goal is to give fans more of an incentive to attend games and get ...", "Mailbag: When Should The Cowboys Draft A Quarterback?": "Would you agree that the Cowboys should be active there in next year’s draft? Nick: I think next year probably makes more sense. But if you’ve got a guy in the middle rounds who has fallen, it wouldn’t be the worst idea to draft him. You know with ...", "Eric Winston, Dallas Cowboys have mutual interest": "The Dallas Cowboys may finally be prepared to admit their $32 million mistake in extending right tackle Doug Free two years ago. A source who has spoken with free agent Eric Winston and a Cowboys source have both confirmed to NFL.com's Ian Rapoport that ...", "Dallas Cowboys Leader Has Strong Words for Tony Romo": "Arguably the best player on the Dallas Cowboys roster has issued a challenge. On Thursday, defensive end DeMarcus Ware said that, “it’s put up or shut up” time for quarterback Tony Romo after he was asked if Romo was deserving of his contract ..."}}
