{"Politics": {"television": {"Television": "There have been complete mischaracterizations and false information reported this past week about Border Security: Canada’s Front Line. A memo and agreement between Canada Border Service Agency (CBSA) and Force Four Entertainment sheds significant light ...", "Fire burns two homes in Fillmore; crews fear winds could pick up": "Evacuees Sue and Rick Cuttriss and Susan and Ed Hopkins stayed with friends Joanne and Doug King as they watched the fire coverage on television. The two couples were told to evacuate their homes on Foothill Road by firefighters and police ...", "PM to address nation over live television at 11.30am": "KUALA LUMPUR: Prime Minister Datuk Seri Najib Tun Razak is scheduled to address the nation live over television at 11.30am today, the Prime Minister”s Department said in a Twitter message. Media reports had indicated that the prime minister would ...", "Chesterfield police nab fugitive": "He couldn’t move. From the day we started chasing him, he didn’t leave that wooded area.” Word of the manhunt was publicized in television, radio, newspaper, and online news reports as residents were warned that the suspect was on the ...", "Television advertising on Wisconsin Supreme Court race tops $1 million": "MADISON, Wisconsin — Spending on television advertising in the Wisconsin Supreme Court race won by Justice Pat Roggensack topped $1 million. The Brennan Center for Justice and Justice at Stake on Thursday released the tally compiled by a media research firm.", "Obama says he's 'determined as ever' for gun bill": "The White House lit up the steps of Air Force One with flood lights so photographers and television cameras could capture the image of Obama climbing the plane's steps with the families at dusk. Nelba Marquez-Greene, whose 6-year-old daughter Ana was among ...", "Ebert remembered as acclaimed film critic": "CHICAGO - Roger Ebert, one of the nation's most influential film critics who used newspapers, television and social media to take readers into theaters and even into his own life, was laid to rest Monday with praise from political leaders, family and ...", "No television debates before the next General Election? Conservatives reluctant to give Ed Miliband and Nick Clegg an equal platform in 2015": "Andrew Grice has been Political Editor of The Independent since 1998. He was previously Political Editor of The Sunday Times, where he worked for 10 years, and he has been a Westminster-based journalist since 1982. His column, Inside Politics, appears in ...", "With a week to go before writ is dropped, B.C. leaders say they're ready": "suggested she will lay out her platform in a television address next Sunday, telling voters what direction lies ahead with a Liberal government. \"People ask me, 'how do you feel,'\" said Clark Monday night. \"I'll tell you how I feel. I am ready. I have ...", "Tuesday, April 2 television sports listings for Cleveland and Northeast Ohio": "Registration on or use of this site constitutes acceptance of our User Agreement and Privacy Policy (Revised November 1, 2011) © 2013 Cleveland Live LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, tr ..", "W.Va. chief justice offers his view from the bench": "Benjamin compares the process to the television show \"Cold Case,\" which features investigators taking up unsolved crimes. \"Instead of criminal cases, these are cases of placement,\" he said. \"You've got to look beyond the numbers because each child has a life.", "Michael Bloomberg group’s gun-control scorecard will give lawmakers letter grades": "The group also this week will begin airing a new television ad statewide in Pennsylvania focused on Toomey, who quietly has been negotiating on a compromise on expanding background checks with Sen. Joe Manchin III (D-W.Va.). The ad highlights ...", "The Tory views you won’t hear on television": "Knocking Cameron and ranting about Europe is the safe-seat option. I spoke to MPs in marginals to get the true picture Have you ever heard an “outspoken” Conservative MP, usually on the right of the party, complaining that David Cameron needs to take ..."}, "google": {"Why the Google dust-up on Chavez? Column": "On Sunday, Google featured a \"Google Doodle\" of Cesar Chavez on their homepage, in honor of what would have been the leader of the United Farm Workers' 86th birthday. Because his birthday happened to coincide with Easter, the gesture set off a torrent of ...", "From strip clubs to theaters, Google Glass won't be welcome everywhere": "Google's futuristic Glass headgear will be available before year's end. The device may well be the final step before human-machine interaction moves under our skin — but its wearers may trigger some undesired social reactions from friends and family ...", "Judge Gives Green Light To Claims That Apple And Google Agreed To Suppress Salaries": "A judge on Friday cited strengths of a suit charging Silicon Valley giants with secretly agreeing not to \"poach\" each other's workers but shot down a request for broad class action status. US District Court Judge Lucy Koh reasoned that plaintiffs in a ...", "Google Chained CPI and tell me what happens": "After the New Organizations links, whats the first link? Now remember today was the first day of our Hell No! #NoChainedCPi blogathon, and every dairy in the \"Pushing back at the Grand Bargain\" group queue had Chained CPI as a tag. This is an ...", "Cesar Chavez Google doodle flap: Conservatives fight back": "I still don’t think Google insulted Christians around the world when it chose to honor Cesar Chavez rather than focus on Jesus Christ’s resurrection on Easter Sunday, which happened to be the 86th birthday of the late civil rights icon.", "Google's Super-Speed Internet Heads for Austin, Texas": "It looks like Google’s super-high-speed internet service is headed for Austin. A post entitled “Google Fiber’s next stop: Austin, Texas” appeared momentarily on the official Google Fiber blog this past Saturday — before vanishing, bolstering ...", "Google's Latest Slap at Christians": "Conservative commentators lashed out at Google (GOOG) over the company's decision to feature labor and civil rights legend Cesar Chavez, instead of an Easter-related theme, as its \"Google Doodle\" Sunday. Chavez was born March 31, 1927, and would ...", "google": "Whether you are a Christian or not, just shameful to not at least acknowledge today as Easter. Celebrating Cesar Chavez? Really. we are in the midst of passover and there's no acknowledgement of that, either..i suspect there will be no mention ...", "Fox & Friends Advances Christian \"Outrage\" Over Cesar Chavez Google Doodle": "Fox & Friends is the go-to Fox show for the church of the perpetually outraged Christians. Thus, it wasn't a surprise to see them jump on the latest faux Christian outrage, also pimped by alleged Fox newsman, Bill Hemmer, about this Sunday's ...", "Opinion: Could Google pick the next president?": "“Elections are won among low-information voters,” said Eli Pariser, former president of MoveOn.org and the author of “The Filter Bubble: What the Internet Is Hiding From You.” “The ability to raise a negative story about a candidate to a voter ..", "Cesar Chavez on Easter on Google vs Christian Bigots": "This past Easter ( a week ago) there was a small kerfuffle about Google making note on the birthday of United Farm Worker's Union Leader Cesar Chavez instead of Jesus' Resurrection Day... So out come the Christian Bigots with their voices and ...", "House Speaker to Sue Google for Defamation of Character According to Leeked Documents Obtained by New York Writer": "House Speaker John Boehner (R-Ohio) is considering a lawsuit against search engine giant Google because its Translate service mispronounces his name. John Boehner - They're saying my name worng. by DonkeyHotey Boehner insists the pronunciation is Bain-er.", "Google, Lego flaps over faith provide lessons for other companies": "Two worldwide brands, Lego and Google, have run into religious controversies. Their respective episodes could provide valuable lessons in marketing and identity consumerism for Arizona companies and brands. They also show how sensitive a subject ..."}, "congress": {"Congress tackles gun violence, immigration": "Spurred by the elementary school shooting last December in Newtown, Conn., tightening the nation’s gun laws was expected to be the top order of business when the Senate reconvenes. But the gun violence bill could be delayed as negotiators ...", "Congress should vote on gun control issues": "Is this the same place they say is government by the people, for the people? Even if that number were grossly exaggerated, and say the real number is only 55 percent in favor of background checks, why can't this come to a vote in both the Senate and the ...", "Congress returns from two week vacation to tackle domestic policy": ">>> we're going to be following all the remembrances out of london later in the show. but there's also some domestic politics on the agenda today. so, i want to do my first reads a little bit later than norming, but get to them right now. tomorrow congress ...", "Parents of Sandy Hook victims urge Congress to act": ">>> high noon. let's play \"hardball.\" >>> good evening. i'm chris matthews in washington. let me start with this. remember what you, i mean you, personally, thought when you heard all those first graders had been shot up there in connecticut?", "Obama in emotional plea for gun bill vote in Congress": "US President Barack Obama appeared to fight back tears as he urged lawmakers to vote on gun control legislation that appears to be stalling in Congress. Speaking in Connecticut where 26 people died in a December school massacre, Obama said citizens must ...", "Obama warns Congress not to use delay tactics against tighter gun regulations": "HARTFORD, Conn. (AP) -- With time running out on the chance to pass gun control legislation, President Barack Obama on Monday warned Congress not to use delaying tactics against tighter regulations and told families of the Sandy Hook Elementary School ...", "Report: Athens Sen. Cowsert not running for Congress": "A politics blog by Martha Zoller, a Republican and past Congressional candidate herself, is reporting that state Sen. Bill Cowsert, R-Athens, will not be running for the congressional seat being vacated by Rep. Paul Broun. He will instead run ...", "Fanning The Flames Since 1978 endorses LeAlan Jones for U.S. Congress": "More of the same or something different is what the voters in the 2nd Congressional District will have to choose from when they step into the voting booth tomorrow. For historical purposes, let's talk about what more of the same has done. The past three ...", "LET CONGRESS PAY YOUR BILLS": "BRADENTON, Fla., Oct. 2, 2008 -- With $700 billion dollars - about $2,400 for every man woman and child in America - Congress has just about paid back all those American and foreign banks for every bad loan they've ever made. All those credit card debts ...", "Obama in Connecticut pushes for gun control as critical week begins in Congress": "WEST HARTFORD, Conn. — With his proposed gun regulations in serious jeopardy, President Obama delivered an impassioned and urgent plea here Monday evening for swift action, telling a state still shaken by the Newtown school massacre, “We’ve got to ...", "Obama Overrides Congress to Buy $690 Million Worth of Russian Choppers for Afghan Air Force": "Apparently America has too many jobs so Obama will be spending taxpayer money to support Russia’s defense industry on behalf of Afghanistan. And he’s doing so over the bipartisan objections of Congress from both the right and left and a ban on buying ...", "Gun Control Takes Center Stage as Sandy Hook Parents Prepare to Lobby Congress": "WASHINGTON (WUSA9) -- It is a huge week for gun control, and it kicked off today with one of the most emotional speeches of President Obama's career. He walked in to the University of Hartford to a rock star's applause, and several times, he had the crowd ...", "Obama’s plea: Tell Congress to put children’s safety ahead of the NRA": "This video is unavailable in the format required for your device/os. In an emotional speech in Connecticut on Monday, President Obama smacked the Republican senators who are threatening to block a vote on new gun control measures, saying they ..."}, "senate": {"Montana Ballot Access Bill Passes Senate": "On April 8, the Montana Senate passed HB 120, the Secretary of State’s omnibus election law bill which contains two ballot access improvements. But because other parts of the bill had been amended in the Senate, the bill must now return to the ...", "Senate will vote on same-sex marriage in April": "The Rhode Island Senate will vote on same-sex marriage legislation before the end of April, Senate President Teresa Paiva Weed, D-Newport and Jamestown, told the Providence Journal Monday. “I feel very confident that the issue will be fully ...", "Arkansas Unemployment Drug Testing Bill Passes State Senate": "LITTLE ROCK, Ark, April 8 (Reuters) - The Republican-led Arkansas state Senate approved a measure on Monday that would require random drug testing of Arkansas residents who receive state unemployment benefits - a plan that the state's Democratic ...", "Mitch McConnell joins Senate gun filibuster": "Senate Minority Leader Mitch McConnell said he would join a group of Senate Republicans threatening a filibuster to oppose a cloture vote if Senate Majority Leader Harry Reid moves a gun bill to the floor this week. Reid has promised to move a ...", "Voter registration deadline approaches for US Senate primary": "The deadline is Wednesday to register to vote in the April 30 special state primary for U.S. Senate. This is for state residents who meet voting requirements and who aren’t already registered to vote. For towns with more than 1,500 registered ...", "Senate poised for debate on guns": "Democrats in the Senate took the first parliamentary steps on Monday to start debate on gun legislation, even as a group of Republicans threatened to filibuster the measure, as President Obama again said it's time for votes on a variety of gun ...", "Senate votes to delay Texas school ratings until 2014": "AUSTIN — Texas schools would get another break on their annual performance ratings this year under a bill that the Senate approved Monday with no debate. The measure by Sen. Bob Deuell, R-Greenville, would extend the current delay on ...", "Democrats bring gun control bill to Senate floor": "Democrats have brought gun control legislation to the Senate floor amid a threat from conservative Republican senators to use delaying tactics to prevent formal debate from even beginning. Senate Majority Leader Harry Reid took the first procedural step to ...", "Why the U.S. Senate race matters to Democrats, win or lose": "It’s a fact not much remarked on that the closest thing to a frontrunner we have so far in the squishy-soft field for next year’s U.S. Senate race in Georgia is a Democrat. In a survey conducted in February, Public Policy Polling, a Democratic firm ...", "Senate eyes deal to boost high-tech immigrants": "WASHINGTON — The number of foreign high-tech workers who will be admitted to the United States each year will more than double under the terms of an immigration deal Senate lawmakers were hammering out yesterday, business sources told The Post.", "Gang of 8 Republicans Reject Senate Conservatives' Request for Immigration Proposal Briefing": "The Republican members of the bipartisan Senate “Gang of Eight” have passed the deadline for Senate Judiciary Committee ranking GOP member Sen. Chuck Grassley’s request for a briefing on their coming immigration reform bill. Last week ...", "Rivals for Kerry Senate Seat Debate": "LOWELL, Mass. — The Democratic primary for the nomination to fill the United States Senate seat recently vacated by the wealthy John Kerry is becoming a low-key tussle over which candidate’s roots are more humble. As they met here Monday ...", "Univ. student conduct code expansion to go before University Senate": "University officials are one step closer to expanding the Code of Student Conduct’s jurisdiction after the Senate Executive Committee approved the measure for a full senate vote yesterday, set for the body’s April 17 meeting. If it passes the full ..."}, "bing": {"Charlie LeDuff's Deadbeat of the Week: Mayor Dave Bing": "A building is partially covered in graffiti. There are shattered windows and paint is peeling. It is a veritable crack house just stinking up the riverfront. Who's responsible for this outrage? Mayor Dave Bing, that's who. Bing seems to be an expert on ...", "Rutgers reviewing all practice videos": "Rutgers officials are reviewing practice videos of all sports to see if any coach engaged in behavior like the type that cost men's basketball coach Mike Rice his job, and the university is planning to hire a consultant to do an independent ...", "Bill Clinton: 'America will have some very good choices for president'": "(CNN) – Former President Bill Clinton may have stoked more speculation about his wife, former Secretary of State Hillary Clinton, and her potential run for president. Asked during a Q-and-A session on Saturday if he'd rather take eight more ...", "Brownback Names New Kansas District Judge": "Kansas Gov. Sam Brownback has named Faith Maughan to fill a vacancy in the 18th Judicial District in Sedgwick County. Maughan is currently a judge for the city of Colwich in south-central Kansas. Brownback announced Monday that she would fill ...", "Shop Talk: Troubled Minnesota GOP Names New Chairman": "Minnesota Republicans “overwhelmingly” elected former state Rep. Keith Downey, a strategy and technology consultant, to lead one of the most troubled state parties in the country, according to the Minneapolis Star Tribune. The GOP has a number of state ...", "Detroit public safety unions, Bing's office clash over bargaining": "Several Detroit public safety unions were steaming mad after Mayor Dave Bing’s top labor negotiator sent letters to union leaders and state officials this week saying the city no longer has to bargain now that an emergency manager is in charge ...", "PROMISES, PROMISES: Obama's IOUs start coming due": "WASHINGTON (AP) - Presidential campaigns are long in the making, quick to be forgotten. But one part of them lives on for years: the victor's promises. President Barack Obama paved his path to re-election with fewer promises than in 2008. The ...", "Google Doodle Celebrates Christian Civil Rights Activist, Americans Threaten to Move to Bing": "Over the weekend, Google decided to run a doodle celebrating labor leader and civil rights activist Cesar Chavez. March 31 is Cesar Chavez Day in the US, a new holiday introduced by President Barack Obama. He was also devoutly Christian, so the fact that ...", "Fellow Republican Announces Run Against Schultz": "MADISON, Wis. (AP) -- A Republican state senator who has drawn the ire of others within his party for siding with Democrats on major issues will face a primary challenger should he seek re-election next year. State Rep. Howard Marklein says he ...", "Detroit EM Orr to give Financial Advisory Board new role": "Mayor Dave Bing is slated to present his proposed budget to the City Council on Friday. In February, the board signed off on the city's revenue consensus report, which showed that the 2012-13 fiscal year general fund budget of $1.024 billion was ...", "Let The (34th District) Debates Begin": "In our mailbox today — a message from Mark Alexander, asking Senator Gill to join him in a series of debates across Clifton, East Orange, Montclair, and Orange. From the email: Every day, I am talking to normal folks at the train stations, supermarkets ...", "Schwartz Kicks Off Campaign for Governor": "U.S. Rep. Allyson Schwartz is kicking off her 2014 campaign for the Democratic nomination for Pennsylvania governor. The 64-year-old Schwartz has said for weeks that she intends to run. Now a spokesman said she plans to file papers to set up a state fund ...", "Illinois House Leader Voices Support for Marriage Equality Bill, Governor Says It's Close to Passage": "It sounds like we're getting close to passage of the marriage equality bill in the Illinois House. LGBTQ Nation reports: Gov. Pat Quinn (D) said Monday that supporters are “very close” to the votes needed in the state House to pass legislation that ..."}, "beyonce": {"GOP lawmakers continue to call out Beyonce and Jay-Z for 'shameful' vacation": "Beyonce and Jay-Z are continuing to face heat from Republicans in Washington for their jaunt last week to Cuba, which remains off-limits for Americans looking only for a tropical vacation. \"How nice it would have been if they had said something ...", "Beyonce and Jay-Z's anniversary trip to Cuba under investigation": "(Yahoo!) - Beyoncé and Jay-Z looked crazy in love celebrating their fifth anniversary in Cuba last week, but not everyone is smitten over their decision to travel to the embargoed country. Two Republican members of Congress have asked the U.S. Treasury ...", "Lawmakers question Beyonce and Jay-Z's Cuba trip": "Beyonce and Jay-Z tour Old Havana, Cuba on Thursday. (Photo: Ramon Espinosa, AP) Superstars Beyoncé and Jay-Z were mobbed by fans last week when they visited Havana and celebrated their fifth wedding anniversary. But two Republican members of ...", "White House: No comment on Jay-Z and Beyonce’s trip to Cuba": "White House Press Secretary Jay Carney refused to comment on why Jay-Z and Beyonce were allowed to travel to Cuba for what appeared to be the kind of tourist trip banned under current U.S. travel restrictions. “Decisions made about cultural ...", "Beyonce and Jay Z Cuba Trip Raises Questions and Possible Investigation": "What began as a simple romantic getaway could result in a state investigation. Beyoncé and Jay-Z visited Cuba to celebrate their fifth wedding anniversary, and while the international stars were mobbed by fans upon their arrival, others were ...", "Two Members of Congress Want Details on Jay-Z and Beyoncé’s Cuba Trip": "Jay-Z and Beyoncé wanted to celebrate their 5th wedding anniversary by taking a trip to Cuba. Throughout last week, the musical power couple were seen in various photographs as they toured the capital city of Havana. Now two Republican members of Congress ...", "Jay-Z and Beyonce trip to Cuba sparks investigations": "Two Republicans from South Florida are calling for an investigation into Jay-Z and Beyoncé’s recent trip to Cuba. Jay-Z and Beyoncé were photographed in Cuba during a trip to the island nation last week, to celebrate their fifth wedding anniversary in ...", "White House: Treasury Dept. Responsible for Approving Beyonce & Jay-Z’s Trip to Cuba": "Last week, megastars Beyonce and Jay-Z sparked controversy over a recent trip to Havana, Cuba, prompting many to question how, exactly, the famed duo received permission to travel there given the U.S.’s tight restrictions on tourism.", "Congress Investigating Beyonce + Jay-Z’s Anniversary Trip to Cuba": "Add Congressional investigations to Jay-Z‘s list of ’99 Problems.’ Hov and Beyonce‘s recent controversial Cuba trip is now being scrutinized not only by lobbyists, by also Congress to make sure it wasn’t a tourist excursion — which aren’t ...", "Reuters: Jay-Z, Beyonce Cuba trip was \"fully licensed.\" But questions remain": "UPDATE: Click here for a fuller explanation of Jay-Z, Beyonce, Cuba and U.S. sanctions Pop star Jay-Z and Beyonce's fifth wedding anniversary trip to Cuba was \"fully licensed\" and therefore was legal, a source told Reuters. But beyond that, it's ...", "Beyonce, Jay-Z Cuba Trip Attracts Scrutiny": "Superstars Beyonce and Jay-Z generate buzz with virtually everything they do, and their fifth wedding anniversary celebration was no different. Marking their anniversary in Cuba last week, they caused a stir when they toured Old Havana, posing ...", "Jay-Z and Beyonce's Cuba Visit Deemed Legal by U.S. Government": "Last week, Jay-Z and Beyonce took a trip to Havana to celebrate their fifth wedding anniversary and try out some salsa moves. It seemed like a romantic getaway until Republican members of Congress started questioning the validity of their trip, deeming it ...", "Jay-Z and Beyoncé in Cuba: Florida Representatives Want Answers From Obama!": "In case you haven't heard, rapper/mogul/Brooklyn Nets owner Jay-Z and his wife, Beyoncé (the girl who sang at the Super Bowl, Grandma), decided that it was 1950 and went and took a vacation in Cuba last week. And now Florida Republican Reps. Mario Diaz ..."}, "yahoo": {"Arizona lawmaker cancels bulletproof vest demo": "PHOENIX (AP) — An Arizona lawmaker invited a bulletproof vest retailer to do a demonstration at the state Capitol but canceled the event on Monday after a legislative lawyer advised him that making a sales pitch to lawmakers on state property was ...", "Mark Kelly Says 'Failure Is Not An Option' on Universal Background Checks": "ABC News's Jonathan Karl and Shushannah Walshe Report: Mark Kelly isn't taking no for an answer. \"Failure is not an option,\" Kelly, former astronaut and husband of Gabby Giffords, told ABC News' Jonathan Karl in an interview, stressing that he's doing ...", "The Nobility of Our Betters": "and faithfully continues his third decade on the radio with It’s All About Money which can be heard Monday through Friday on Money Radio 1510 KFNN (Phoenix, AZ). Bill can be reached via email: gpsforlife@yahoo.com.", "SADLY, HATE ALWAYS HAS A HOME HERE": "Hate is easy; love is hard work. Holding up a sign won't help. AR CorrespondentJoyce Marcel (joycemarcel.com) is a journalist and columnist. You can reach her at joycemarcel@yahoo.com.", "Yahoo! Exclusive: B.C. NDP leader Adrian Dix finds common ground with Stephen Harper": "Meet Adrian Dix, who, barring some catastrophic collapse during the upcoming campaign, likely will be the NDP premier of British Columbia after the May 14 provincial election. The New Democrats, crushed by the Liberals in the 2001 election after years of ...", "TOO COOL TO RULE?": "You can only stand back and be admired. President Obama must turn up the juice. Failure means a one-term presidency, and that isn't cool, man. Joyce Marcel (joycemarcel.com) is a columnist and journalist. Reach her at joycemarcel@yahoo.com.", "Goodlatte attends Internet crawl to promote local businesses": "The association represents 15 Internet companies including Amazon.com, eBay, Facebook, Google, and Yahoo. Michael Beckerman, association president, said its members opposed the Stop Online Piracy Act last year. But the association is not taking a position ...", "Obama Warns GOP Lawmakers Not to Block Gun Control Legislation: ‘We Are Determined as Ever’": "HARTFORD, Conn. (TheBlaze/AP) -- With time running out on the chance to pass gun control legislation, President Barack Obama on Monday warned Congress not to use delaying tactics against tighter laws -- like filibustering new regulations as Sen. Rand Paul ...", "SD Sen. Johnson Says He Now Supports Gay Marriage": "South Dakota Sen. Tim Johnson, who announced his retirement last month, has reversed his position on gay marriage, saying Monday that he supports the legalization of same-sex unions. The 66-year-old Democrat has said for years that he doesn't support gay ...", "\"Biden: 'No Leadership' in GOP\" by Arlette Saenz at Yahoo": "\"There is no leadership,\" he told donors for the Democratic Congressional Campaign Committee at the St. Regis Hotel in New York City, according to the pool report. \"There is nobody you can sit across the table from and shake hands, make a deal with.", "'Here we go again': Eric Stevenson, Bronx Democratic Assemblyman, arrested for taking $20,000 in bribes in second corruption case in New York this week": "The defendants face up to 20 years in prison if convicted on the top conspiracy charge in the five-count complaint. The 28-page document detailed an outrageous alliance between Stevenson and the crew. Last September, Stevenson purportedly received an ...", "Connie Schultz / This column could save your life": "\"If I had been out there all alone, I don't know what I would have done.\" We all can be grateful she never had to find out. Connie Schultz is a columnist for Creators Syndicate (con.schultz@yahoo.com).", "Real reason parties don't tolerate dissent": "To no avail. Undecided voters - the kind who don't pay attention to politics until the last week before the election, maybe the same eight per cent who stood out in the sex selection poll - clearly got the idea that the candidate for Yahoo Centre was going ..."}, "movies": {"Poindexter: Politics aside, movies are entertainment": "My wife and I went to a movie recently that was a cross between the “Die Hard” movies, the 1990s sci-fi flick “Independence Day” and “Under Siege” with Steven Seagal. I was told the movie, “Olympus Has Fallen,” was not getting ...", "State budget add-ons for movies, energy regs rebuffed": "Colorado legislators have been hip to funding film incentives and ramping up oil and gas regulations in the past year. But on Wednesday, attempts to use the proposed 2013-14 budget to push both ideas further ran into a wall. The Colorado Senate ...", "Democrats seek to repeal pension tax, fund movies and education": "LANSING -- As the state Legislature returns from a two-week spring break and resumes action on the state's budget this week, House Democrats would like to repeal a tax on pensions, invest millions in education and make investments in a film ...", "Benji Tunnell: 'Olympus' a tribute to '80s action movies": "JOPLIN, Mo. — \"Die Hard,\" what hath thou wrought? The original film seemed so innovative. Confine a lone hero to a defined space, have him fight off the baddies, give him the love of a woman (possibly estranged) to fight for, throw in a climactic battle ...", "4 Movies That Are Just Far Too Long": "Now, let’s just ignore the fact that this is a Disney children’s film that opens with a scene of children being executed by hanging. But let’s address the fact that this is a children’s film with a total run time of two hours and 48 minutes.", "Night at the Movies": "THE HOST (PG-13): When an unseen enemy threatens mankind by taking over their bodies and erasing their memories, Melanie will risk everything to protect the people she cares most about. Exchange, Evans, Aiken TYLER PERRY’S TEMPTATION ...", "Roger Ebert: Praised as hero at funeral": "The service had funny and serious moments. Emanuel joked that Ebert saw bad movies so the rest of us wouldn’t have to. There will be another chance for the public to pay tribute to Ebert. Organizers are planning a memorial for Thursday evening at the ...", "Ch. 7 plans its own NYC mayoral debate after being left out of Campaign Finance Board schedule": "WABC/Ch. 7 is proposing its own privately held mayoral debate after getting shut out by the city agency responsible for running the debates this year. The official debates — coordinated by the NYC Campaign Finance Board — are scheduled for ...", "Free movies planned this summer": "LOCK HAVEN - Two outdoor movies were shown last summer on the city's giant inflatable screen, marking the beginning of a summer program that may grow to be as successful as the free summer concert series. This year, four free movies are scheduled on ...", "Obama: Movies Won't Be the Same Without Roger Ebert": "President Barack Obama issued a statement Thursday saying he was saddened to hear about the passing of fellow Chicagoan Roger Ebert. PHOTOS: Remembering Roger Ebert: The Iconic Film Critic's Life and Career in Pictures \"For a generation of Americans -- and ...", "Like Movies, How Do I Judge Thee; Let Me Count the Ways": "History and movies prove the absence of perfect solutions, lives, nations and humankind. 148 years ago assassination rewarded preserving the Union and emancipating slaves. Social Security, seventy-eight years ago, the resisted New Deal, and just ...", "The 10 best political movies ever": "Legendary movie critic Roger Ebert, who died earlier this week, loved politics as much as the movies and regularly offered up his opinions through Twitter or his blog. Politico highlights some examples of his take on the nation's politics. As a tribute ...", "Milestones in Ebert's storied career at the movies": "The Sandy relief fund chaired by New Jersey first lady Mary Pat Christie has approved $3.- 12:44 am Rutgers Athletics Director Tim Pernetti, who seemingly had as much job security as any of his peers...- 12:47 am A brus ... Michael J.W. Stickings Roger ..."}, "amazon": {"Goodlatte attends Internet crawl to promote local businesses": "The association represents 15 Internet companies including Amazon.com, eBay, Facebook, Google, and Yahoo. Michael Beckerman, association president, said its members opposed the Stop Online Piracy Act last year. But the association is not taking a position ...", "Amazon tax an Illinois disaster": "To tax-hungry politicians, the Internet is like California in 1849 — a vast expanse of untapped wealth. At the federal level, Illinois' own Dick Durbin is leading a national effort to change the way sales and local taxes are collected from ...", "Amazon Defends 'C*nt' Christmas Card Advertisement: Report": "If Amazon had a swearing jar, it'd probably contain enough cash to make someone rich. The giant online retailer is defending the use of a swear word in a Christmas card ad that appeared on Amazon.co.uk and was subsequently banned by the British ...", "Tim Johnson: Latest Democratic Senator To Endorse Gay Marriage": "South Dakota Senator Tim Johnson on Monday endorsed gay marriage, leaving only 3 Democratic senators opposed. “After lengthy consideration, my views have evolved sufficiently to support marriage equality legislation,” Johnson said in a ...", "SPD’s embattled/quiet/Latino Diaz out as Seattle’s police chief": "With news coverage across the city dotted with descriptions including “embattled,” “quiet,” and “Latino,” John Diaz, Seattle’s first minority police chief, stepped down Monday ending a four-year run in a job where his leadership and style ...", "Montclair Public Library aims to be 'center of the community'": "\"We want to get the word out to those people who think the library is obsolete because they buy books on Amazon or use e-readers that the library is so much more than just books,\" Strickland said. \"It is the one open space to all in the community.\"", "TV ADS DITCH DEMOCRACY 30 SECONDS AT A TIME": "Dr. Brasch's latest book is Sex and the Single Beer Can, a witty look at the mass media and American culture. It's available at amazon.com and other online stores.", "We Beat Chevron, but the Fight for Real Justice Continues": "This week, my faith in justice was given a boost when Amazon Watch won a major victory in the face of Chevron's massive legal efforts against us. In U.S. Federal Court on Wednesday, Chevron's efforts to significantly disrupt our work and ...", "Republican super PAC leader backs immigration reform": "Legislation that would speed up the date for when Amazon and other online retailers would have to start collecting the state sales tax may be dead. Indiana Gov. Mike Pence isn’t saying the word “veto,” but he’s making clear he opposes key ...", "House considers bill to shorten school day": "Legislation that would speed up the date for when Amazon and other online retailers would have to start collecting the state sales tax may be dead. Gov. Mike Pence has made no secret that his Christian faith is critical to his identity, but he may be ...", "SCRATCHES ON THE BLACKBOARD OF ANIMAL CRUELTY": "His next book is Before the First Snow, a look at America's counter-culture and the nation's conflicts between oil-based and \"clean\" nuclear energy. The book is available at amazon.com", "The bookshop that is taking on Amazon...and winning": "Booksellers taking on Amazon in a David and Goliath fight for fairer taxes will march on Downing Street after drumming up 100,000 supporters. Frances and Keith Smith, who run Kenilworth and Warwick Books, set up their online petition in November in hope of ...", "Daniels' sales tax deal with Amazon likely safe; state could miss out on millions in potential revenue": "Despite strong support from Indiana House lawmakers, online retailer Amazon likely won’t be forced to collect sales taxes from Indiana purchases six months earlier than planned. House and Senate lawmakers are at an impasse over a bill that ..."}, "music": {"Guy James – Body | New Music": "How about some R & B for your morning? The up and coming talents of Guy James returns to the scene with a dope new track called “Body”. The cut is a smooth, seductive number that finds Mr. James showing off his vocal prowess and his sexy ...", "Beware of election expense or face music": "All the political parties and candidates contesting the upcoming assembly election will have to be extra cautious while making the election expenditure, failing which a full-fledged new expenditure monitoring machinery set up in the district level, will ...", "The Daily Music Break: Sergei Prokofiev": "Cross-Posted at THE DAILY MUSIC BREAK, the site that features good music regardless of era or genre. If you enjoy The Daily Music Break, please consider writing a short post about any artist you'd like, whether he/she/they have been covered or not.", "Cuts in art, music classes proposed for Bennington school budget": "BENNINGTON — The Bennington School Board moved closer to a new budget to put before voters after their previous budget failed in March, and all but one member rejected the idea of saving money by making cuts to art, music or physical education ...", "Music for Everyone sees need growing alongside its success": "How many instruments has Music For Everyone distributed to Lancaster County schools since 2005? \"Oh, my God,\" gasps MFE founder John Gerdy. \"I don't know.\" The nonprofit organization — which launched in 2005 with the primary goal of getting ...", "Stop the music, says Senate panel": "TALLAHASSEE -- Sometimes the sound can be felt as much as heard — car-vibrating, teeth-rattling sound. But with the Florida Supreme Court last year finding that a state noise law was unconstitutional, a Senate committee Monday approved a plan ...", "Guildhall hotel plan strikes sour note with late-night music lovers": "A GROUP of music lovers are objecting to a plan for the city's first five-star hotel due to a perceived threat to Bristol's late night music scene. As previously reported, the Trevor Osborne Property Group has bought the historic Guildhall in Broad Street ...", "Music promoter to seek Democratic nomination to challenge Mitch McConnell": "Musician and music promoter Bennie J. Smith is the second Democrat to announce that he will seek the nomination to challenge U.S. Sen. Mitch McConnell, R-Ky., in the 2014 election. Smith, of Louisville, said he is running to support President ...", "HartFest serving up music, drinks this weekend": "June 11, 2012 | HartFest, the festival that celebrates Hart Park and raises money for various charities, will be held this weekend. The party starts at 5 p.m. with music by Andrew Gelles, followed by King Solomon at 8 p.m. on the Rotary ...", "Here’s the new music video North Korea made for Kim Jong Un": "The new official North Korean tune, posted online this week, is titled some variation of “Let’s Defend General Kim Jong Un at the Cost of Our Lives” or “We Will Safeguard General Kim Jong Un With Our Very Lives,” depending on the ...", "Spring Grove music recognized": "For the second year in a row, Spring Grove Area School District has been recognized for its commitment to music by the National Association of Music Merchants. Spring Grove was one of 307 school districts across the country to receive the Best ...", "Rapper Hoodie Allen to headline Revelry, UW-Madison's new outdoor music festival": "Revelry, a new music festival that UW students are organizing for May 4, announced its lineup yesterday. The student-oriented event will begin at 11 a.m. at Engineering Mall and Union South Plaza, far from the Mifflin Street Block Party, which has drawn ...", "Who owns the music?": "THE STRIKE of musicians at the San Francisco Symphony has already had an immediate impact on the institution. Only a few days after walking out, management called off a large East Coast tour. For the symphony, which has posted a deficit for each ..."}, "bieber": {"Tonight: Remembering Margaret Thatcher, North Korea update": "On the heels of Monday's passing of Margaret Thatcher, this evening \"Piers Morgan Live\" will remember the former British Prime Minister, reviewing the life and legacy of the woman nicknamed \"Iron Lady\" for her tough-minded approach to politics ...", "The Justin Bieber Fragrance Sweepstakes Official Rules": "NO PURCHASE NECESSARY TO ENTER OR WIN. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF WINNING. Promotion Description: The Justin Bieber Fragrance Sweepstakes (“Sweepstakes”) begins on March 28, 2013 at 5:00 p.m. Eastern Time (“ET”) and ends ...", "Republican Pat Toomey: Obama's best hope for gun control?": "fter weeks of stalled negotiations and setbacks, it looks like President Obama could finally score a victory in his push for increased gun control. His hopes now center on a Republican with an \"A\" rating from the National Rifle Association: Sen. Pat Toomey ...", "Justin Bieber slammed for taking monkey on tour": "Justin Bieber has been slammed as \"monstrous\" for flying his pet monkey around the world. The 19-year-old pop star refused to fly without 14-week-old capuchin monkey Mally last week. However, he did not secure the proper paperwork for the primate so he was ...", "NEW: DeFuria to retire; circuit judge candidates sought": "SARASOTA - As Judge Rick DeFuria nears retirement, the Twelfth Judicial Nominating Commission is seeking applications to fill a vacancy in Sarasota Circuit Court. Eligible candidates must be a registered voter, a member of good standing with the ...", "Justin Bieber Bad Boy Routine a Case of Heartbreak Blues?": "Justin Bieber has found a new excuse for his loutish behavior and took it out for a test run on a gossip site this morning. It’s not him, it’s her! Selena Gomez is the reason for his bad boy act. Believe it? Apparently Bieber isn’t good at handling ...", "A View From the Swamp - RaggedyMan Crafts": "As I mentioned yesterday in my diary A View From the Swamp - I Need Help I have opened up an Etsy shop for my Doctor Who themed beads - RaggedyMan Crafts. While there are only some examples available at the moment, more are being made and I am ...", "Roger Ebert remembered for big heart, acclaimed film criticism at Chicago funeral": "CHICAGO - Acclaimed film critic Roger Ebert has been praised at his funeral as a hero to his profession, a champion for the little guy and a visionary. Ebert was remembered Monday at a downtown Chicago church. He died Thursday after a long ...", "Justin Bieber: ‘I Mess Up Sometimes’": "Justin Bieber has acknowledged his recent run of bad behavior, the latest of which is his terrible driving, chalking it up to his youth, saying, “I mess up sometimes.” Um, Biebs, that’s the understatement of the century, kiddo. The singer spoke ...", "Karnataka parties for advancing polling hour in peak summer": "Political parties in Karnataka Monday petitioned the Election Commission to advance the timing of polling hour for the legislative assembly poll May 5 to 7 a.m. from 8 a.m. to enable the electorate to vote early in peak summer. \"All the three main parties ...", "Justin Bieber lands 7th place on '50 most popular women on web' list": "Washington, Apr 6: Lady Gaga has been named as the most popular women on web. COED Magazine has compiled a list based on Google search results, sporting some surprises-Justin Bieber comes in at No. 7, ABC News reported. The list also includes Washington's ...", "Justin Bieber Allegedly Spit On His Neighbor, Do You Buy It?": "The Justin Bieber fiasco keeps getting weirder and weirder. Just one day after he was involved in a confrontation with his neighbor, more details are starting to emerge from the skirmish, and if true, each one makes the situation a whole lot uglier.", "Grassley Gun Bill Priorities Emerge": "The details of a gun control bill being written by Senator Chuck Grassley (R-Iowa) are now coming to light. As first reported by Politico, Grassley is crafting a Republican alternative to Democrats’ proposals, which are centered on expandin ..."}, "lawmakers": {"AG Beau Biden & State Lawmakers Propose Bills to Toughen Penalties for Criminals Carrying Guns": "Several pieces of legislation have been proposed by Attorney General Beau Biden and a bipartisan group of state lawmakers that will toughen penalties for criminals who carry guns. The bills are now being circulated for sponsors and are expected to be ...", "O'Malley Gets Everything He Wants From Lawmakers": "Governor Martin O’Malley says the 2013 Session of the Maryland General Assembly has been one of the most productive of his term with lawmakers approving nearly all of his agenda, including a gas tax increase, gun control and a repeal of the death penalty.", "Lawmakers, other leaders vow to fight for gun rights at state capitol": "BATON ROUGE, La. -- A group of state lawmakers, congressional delegates and others, called Defend Louisiana, are speaking out against gun control efforts here and across the country. \"We're not gonna allow anymore incremental attacks on the ...", "Lawmakers disagree over Miss. Medicaid expansion": "JACKSON — Two lawmakers who spoke at a press luncheon Monday disagreed about whether Mississippi should expand Medicaid, reflecting the partisan split that left the health program in limbo when the House and Senate ended their three-month ...", "Lawmakers support gun rights": "BATON ROUGE — The federal government is trying to take away gun owners' rights, so people need to stand against those efforts, says Rep. Jeff Thompson, R-Bossier City, and a group of about 30 government officials who gathered on the Capitol ...", "Lawmakers Reactions Mixed to Governor's $750M Bonding Proposal": "St. Paul, MN (NNCNOW.com) - Northland lawmakers are delivering mixed reaction on Minnesota Governor Mark Dayton's proposed bonding bill that promises to put 21 thousand Minnesotans to work. The proposal includes $750 million dollars in Capital ...", "Obama Warns GOP Lawmakers Not to Block Gun Control Legislation: ‘We Are Determined as Ever’": "HARTFORD, Conn. (TheBlaze/AP) -- With time running out on the chance to pass gun control legislation, President Barack Obama on Monday warned Congress not to use delaying tactics against tighter laws -- like filibustering new regulations as Sen. Rand Paul ...", "Jindal's change does not surprise lawmakers": "BATON ROUGE — House and Senate members said Monday they weren't surprised Gov. Bobby Jindal pulled his tax swap plan because it had little chance of passing, but some said they were surprised he did it publicly. The governor announced Monday ...", "Local view: Couple hopes Minnesota lawmakers recognize their right to marry": "We have loved each other for a long time. As two women, we keep trying to have a marriage that is recognized so we can get on with the banal but essential business of caring for our three children, our home and our community. We met at Carleton ...", "Obama scolds lawmakers for lack of gun control support": "President Barack Obama angrily chided lawmakers reluctant to back gun control legislation on Monday, saying the overwhelming support for measures like universal background checks among the American people should force action in Congress.", "Lawmakers ask DEQ director about tree spiking": "HELENA – Department of Environmental Quality director Tracy Stone-Manning says she did not play a role in a past tree-spiking incident. The Montana Senate held a confirmation hearing Monday on Bullock’s nominee to head the environmental agency.", "Michael Bloomberg group’s gun-control scorecard will give lawmakers letter grades": "New York Mayor Michael R. Bloomberg, one of the nation’s most committed and deep-pocketed gun-control proponents, is ratcheting up pressure on lawmakers by launching a new system to grade them based on their votes and statements on gun issues.", "Lawmakers end busy session _ but no dog-bite bill": "The Maryland General Assembly has adjourned after a highly productive legislative session, but without passing a measure to address liability for dog bites in the state that was prompted by a court ruling last year. However, a campaign finance reform bill ..."}, "america": {"Obama To America: Have I Mentioned Gun Control?": "Politics: In the wake of dismal news on jobs, the president is going all-out to fix the public's mind on something else — assault rifles, background checks and a sputtering Senate bill. Barack Obama knows the value of a sideshow, and right now he's ...", "Rush Limbaugh, Owner of StopRush.Com, is Losing His Grip on America": "Yes, that's right, Rush Limbaugh's syndicator Premiere Radio Networks owns the domain name stoprush.com--and has for the last 10 years. Rush Limbaugh's owners handlers apparently have known for a long time that they need to take steps to prop up ...", "All America: Thomasville a finalist": "Thomasville Mayor Joe Bennett was confident Monday that the Chair City will take All America City honors this year. Thomasville has been named a finalist for the “All-America City Award,” along with two other North Carolina cities – Dunn and Garner.", "The War On Drugs Is A War On America! Time To End It! by Russell Simmons": "For forty two years, we have waged war against our own people, that we have disguised as the \"War on Drugs.\" Forty two years of failure that has cost the American taxpayers $1 trillion dollars, resulted in 45 million drug arrests, and overfilled America's ...", "America is nearing the end of its Utopia": "What better way to disarm, take over, placate, pacify, control and manipulate a populace than through children who are too young to understand until the damage has been done? Or through the bellies of the starving, who will sell their children ...", "KRUGMAN HITS BULL'S EYE ON 'AMERICA GOES DARK'": "LOS ANGELES, Aug. 9, 2010 -- Paul Krugman's 'America Grows Dark' , an opinion piece in today's New York Times, is brutally on target. It is a telling column, I think, on how America is shutting down, needlessly, and at disastrous cost. Krugman cogently ...", "Margaret Thatcher and America": "Our cookies policy has changed. Review our cookies information for more details. By continuing to browse this site you are agreeing to our use of cookies. Our cookies policy has changed. Review our cookies information for more details. By continuing to ...", "IRAQ REPRISE: AMERICA GETS A PRESIDENT": "ANGEL FIRE, N.M., Aug. 31, 2010 -- It took 19 months, but as President Obama addressed the American people tonight on the end of the U.S. combat role in Iraq, it was clear to me that the young Illinois Senator had grown into the job a majority of Americans ...", "Obama: Thatcher was a 'a true friend' of America": "WASHINGTON -- President Obama paid tribute to Margaret Thatcher on Monday, calling the former British prime minister \"a true friend\" of America. Thatcher, 87, Britain's first female prime minister, died Monday from a stroke. Obama, who was not an ...", "What would Jefferson think of today's America?": "“My reading of history convinces me that most bad government results from too much government,” said Thomas Jefferson, who was born this week — April 13 — in 1743. What would our nation’s third president have to say today about a ...", "Margaret Thatcher remembered: Only statue in North America of former British PM at Hillsdale College": "As people across the world mourn the death of Margaret Thatcher, a small bouquet of flowers was placed today next to the statue of the former British Prime Minister at Hillsdale College. It's the only statue of Thatcher in North America, said College ...", "America -- Meet Francis Suarez": "For the last twenty years or so, first as a Republican, and of late as an independent conservative, I have been imploring the GOP to reach out in more meaningful ways to Hispanic and minority-America. Of course, unlike some connected with the ...", "Political correctness is destroying public debate in America": "The Associated Press - the world's largest news wire service - recently decided that it will no longer use the term \"illegal immigrant\". By forcing political correctness down Americans' throats, Democrats are destroying the Republican Party by ..."}, "twitter": {"U.S. Embassy in Egypt pulls, restores Twitter feed": "The Twitter feed of the U.S. Embassy in Cairo was taken down this week after the Egyptian government complained that U.S. diplomats were trafficking in political propaganda by retweeting a Jon Stewart \"Daily Show\" monologue mocking Egyptian President ...", "Area flack goes on Twitter spree": "Speaker John Boehner's top spokesman went on a Twitter spree today, poking fun at D.C. reporters. “Area reporter admits he should have reached out before writing that story,” read an early snark-tinged tweet from Boehner press secretary Brendan Buck.", "NC-Sen: Kay Hagan (D) To Hold Town Hall Meeting On Twitter About Veterans Affairs On 4/9/13": "U.S. Senator Kay Hagan will hold a Twitter town hall on April 9, at 10:15 a.m. to have a conversation with North Carolinians about key issues veterans face. Hagan, a member of the Senate Armed Services Committee and Chair of the Subcommittee on ...", "Check out our Senate race Twitter feed": "To get news about the U.S. Senate special election, including links to WickedLocal stories, news links and candidate statements, follow the Twitter page we have set up for the race at twitter.com/WLsenate. To get news about the U.S. Senate special election ...", "Daniel Temple, Ohio Man, In Court Over Obama Death Threats On Twitter": "Daniel Temple, a 36-year-old man from Ohio, was released from jail on Tuesday after attending a hearing in federal court regarding a series of threatening tweets he'd allegedly directed at President Barack Obama, the Associated Press reports.", "Texas Twitter Tussle: Joaquin Castro vs. Julian Castro": "Texas on the Potomac is pleased to introduce a new feature, the Texas Twitter Tussle. This feature will examine the use of social media by prominent Texas political figures by comparing the Twitter strategies of a pair of public officials. It will appear ...", "Mary Cheh criticizes colleague’s vote on Twitter": "In a rare public critique of a D.C. Council colleague, Mary M. Cheh (D-Ward 3) lashed out on Twitter at David Grosso (D-Ward 5) shortly after he helped defeat a Cheh-sponsored health-care bill in a Monday afternoon committee vote. “Frmr VP of ...", "Hagan to hold Twitter town hall to discuss veterans and military family issues": "U.S. Senator Kay Hagan will hold a Twitter town hall April 9 at 10:15 a.m. to have a conversation with North Carolinians about key issues veterans face. Hagan, a member of the Senate Armed Services Committee and Chair of the Subcommittee on ...", "U.S. Embassy in Cairo’s controversial Twitter account deleted after one too many public spats": "The official Twitter account for the U.S. Embassy in Cairo appears to have been deleted. Attempting to view the @USEmbassyCairo feed returns an error message, “Sorry that page doesn’t exist.” The new U.S. ambassador to Egypt had decided to ...", "‘I played the media’: Embattled Sen. Patrick Brazeau tweets resignation after April Fool’s day deadline passes, Twitter unimpressed": "If he ever does lose his $132,000 a year job as a senator, it seems unlikely that Sen. Patrick Brazeau will get work as a comedian after political pundits and the Twitterverse reacted angrily to his ill-timed April Fool’s resignation “joke.”", "Stearns County asks residents to report potholes via Twitter": "It all began with a birthday present.- 10:08 pm State Representative Jay McNamar, DFL-Elbow Lake, released details today on a $250 million property...- 3:09 pm In school lunchrooms across the state, more kids ... Assistant Morrison County Attorney Todd ...", "You're Not Following @BarackObama on Twitter": "The 29,503,030 people who follow Barack Obama's Twitter account might see his picture, see his name, see that little blue verified account badge and think they're following the President — but it's not him. All of the president's named social media ...", "Sen. Bill Nelson Flips Gay Marriage Stance After Twitter Campaign": "It was pressure from a Twitter campaign that led Florida Sen. Bill Nelson to flip his position and declare his support for gay marriage Thursday. Nelson had previously supported civil unions for gay people but said he believed marriage should be ..."}, "obama": {"Obama makes new call for gun control legislation": "PanARMENIAN.Net - U.S. President Barack Obama appeared to fight back tears as he urged lawmakers to vote on gun control legislation that appears to be stalling in Congress, BBC News reported. Speaking in Connecticut where 26 people died in a December ...", "Obama gives impassioned plea for new gun laws": "President Barack Obama, his voice rising with emotion, urged Americans to pile pressure on a reluctant Congress on Monday to approve new gun control legislation that is at risk of falling victim to Washington gridlock. “We need a vote,” he ...", "Obama fires back": "President Obama drew thunderous applause in Connecticut yesterday as he made an urgent plea to salvage gun-control legislation, calling on Americans to battle “misinformation” about an effort that has lost popularity after an initial wave of support in ...", "Obama: 'Let’s Make It A Little Harder For Our Kids To Get Gunned Down'": "PRESIDENT OBAMA: Now, I’ve also heard some in the Washington press suggest that what happens to gun violence legislation in Congress this week will either be a political victory or defeat for me. Connecticut, this is not about me. This is not ...", "Obama declares Thursday ‘National Equal Pay Day,’ despite paying female staffers less than male counterparts": "President Barack Obama officially declared Tuesday “National Equal Pay Day,” symbolically marking how much extra work women supposedly must perform to reach pay parity with men. “Women — who make up nearly half of our nation’s ...", "Obama's domestic agenda on the line": "WASHINGTON -- President Barack Obama's second-term agenda will be robustly tested this week, with gun control and immigration in the spotlight on Capitol Hill and the White House releasing his long-delayed budget blueprint. In a taste of what ...", "Invoking Newtown Dead, Obama Presses Gun Laws": "HARTFORD — President Obama came here on Monday before a roaring, enthusiastic crowd to remember the tragedy of 20 children and 6 educators slain at Sandy Hook Elementary School and put new pressure on a recalcitrant Congress to honor them with ...", "Obama popularity up, but dips on crucial issues: Poll": "Washington: President Barack Obama's approval rating has inched above the 50 percent mark, but it remains below that mark on three crucial issues - gun control, immigration reform and border security, and the budget, according to ... President Barack Obama ...", "Obama Warns GOP Lawmakers Not to Block Gun Control Legislation: ‘We Are Determined as Ever’": "HARTFORD, Conn. (TheBlaze/AP) -- With time running out on the chance to pass gun control legislation, President Barack Obama on Monday warned Congress not to use delaying tactics against tighter laws -- like filibustering new regulations as Sen. Rand Paul ...", "Obama makes push as gun debate looms": "WEST HARTFORD, Conn. - With his proposed gun regulations in serious jeopardy, President Barack Obama delivered an impassioned and urgent plea here Monday evening for swift action, telling a state still shaken by the Newtown school massacre, \"We ...", "Obama says he's 'determined as ever' for gun bill": "With time running out on the chance to pass gun control legislation, President Barack Obama on Monday warned Congress not to use delaying tactics against tighter regulations and told families of the Sandy Hook Elementary School shooting victims that he's ...", "Changes To Obama's Social Security Proposal In GOP's Court": "President Obama's budget proposal will include a change in the way the government measures inflation. That would bring in some additional tax revenue, but also reduce long-term benefits for Social Security recipients. The president says he'll ...", "Obama defends plan to cut Medicare and Social Security": "After media reports that the Obama administration plans to slash Medicare and Social Security in its latest budget proposal due to be released Wednesday, government officials have been seeking to diffuse popular opposition to the cuts."}}, "Business": {"television": {"Chico's Massa Organics gains international television coverage, chef endorsement": "SAN FRANCISCO -- Treasured Chico Farmers Market vendor Massa Organics entered international recognition Saturday, when famed chef Alice Waters interviewed the company's co-owner, Greg Massa, for a Japanese television program at the Ferry Plaza ...", "Burk makes first television ad buy of Dallas City Council race": "Television commercials are rare in City Council district races. The coming election will see its first from District 13 candidate Leland Burk. “We realize the importance of using this medium to reach our voters with Leland’s message of ‘Experience is ...", "The Television Event Of The Year Shatters Home Entertainment Records": "LOS ANGELES, April 8, 2013 /PRNewswire/ --The epic miniseries, THE BIBLE, continues its unprecedented success with its home entertainment launch and quickly became the biggest selling TV on DVD in the last 5 years and the biggest miniseries of all time on ...", "Fight over the future of television": "Billionaires Rupert Murdoch and Barry Diller are squaring off in what's fast becoming a struggle for the future of television. Murdoch's News Corp said yesterday it may end Fox's 26- year run as a free broadcast channel if US courts continue to allow the ...", "Ericsson to buy Microsoft's Internet television unit": "STOCKHOLM (AFP) - Swedish telecom equipment maker Ericsson said Monday it had agreed to buy Microsoft's Internet Protocol television (IPTV) business Media Room for an undisclosed sum. \"This will make Ericsson the leading provider of IPTV and multi-screen ...", "Gesture Control Coming to a Television Near You": "H in OH, you make my point that pushing a button is easier than waving your hand. Even so, this may catch on simply because of the training kids are getting from their video games. \"This is an area that has many possibilities for the future especially with ...", "Former Evansville television meteorologist Mark Walden dies in Memphis": "MEMPHIS, Tenn. — Mark Walden, chief meteorologist for ABC 24 News in Memphis and a former Evansville television meteorologist, died at his home over the weekend. Walden, 38, died of apparent natural causes, according to the station, which did ...", "The digital devices of television fans": "About The Author: Editor-in-Chief Dave Seyler has spent the past 20 years with RBR-TVBR. He joined the company in 1992 after breaking into the broadcast trades with Broadcasting and Cable. He provides coverage of Washington, station transactions, general ...", "WTOV9 continues to dominate Nielsen news ratings in the Wheeling-Steubenville television market": "The February 2013 Nielsen Media Research news ratings are in and WTOV9 swept the ratings period in grand fashion! WTOV9 won every news daypart by a large margin over all of the competition. NEWS9 Sunrise: In February, WTOV9 had a remarkable 51 ...", "International Commercial Television, Inc. - Recent Material Event": "The Securities and Exchange Commission on August 9, 2010, charged International Commercial Television, Inc. (“ICTV”) with filing inaccurate financial statements as a result of improper revenue recognition during the period from the second quarter of ...", "Memphis television meteorologist Mark Walden dies": "Mark Walden, chief meteorologist for ABC 24 News in Memphis, died at his home over the weekend. Mr. Walden, 38, died of apparent natural causes, according to the station, which did not provide further details. “Our ABC 24 family is deeply ...", "Edgar Thayer Blair, 84: Television news director, writer and editor": "An Atlanta television news pioneer, Ed Blair left his imprint on the coverage of current events here, whether they were of international or local origin. “Ed was more a work horse than a show horse at CNN,” said Dave Walker of Mountain Brook, Ala.", "Times Television ropes in Jagdish Mulchandani as CFO": "Times Television Network (TTN) has announced the appointment of Jagdish Mulchandani as Chief Financial Officer effective April 2, 2013. Based out of Mumbai, Mulchandani will lead and drive finance-related strategy and operations for Times Television Network."}, "google": {"Google Stock Falls Again, Nearing Important Price Support": "After a stealth drop in mid-January, Google (NASDAQ:GOOG) stock soared over 20% into early March. And with that run higher came talk of GOOG's stock price hitting $1000 per share. Whether GOOG stock would or wouldn’t hit $1000 per share was ...", "Photographer wants to ‘Google-ize’ Bennington": "Eric Wood, a local photographer, holds up the Google business listing for the Brown Cow Cafe outside the business on Friday in Bennington. Wood is trying to get all the town’s businesses to take part in the virtual tour which allows customers ...", "Karl Marx Explains The Problem With The Apple, Google No Poaching Conspiracy Allegations": "Just because Karl Marx was a scatterbrained fool whose theorising led to the deaths of hundreds of millions doesn’t mean that he was always incorrect. And we can use one of those rare occasions when he was correct to think about these ...", "Bill Macfadyen: Thanks to Google News, Alzheimer’s Disease Story Gets a Reader Workout": "Noozhawk executive editor Tom Bolton and I spend almost as much time discussing our site analytics as we do our news coverage. We also work closely with Jacques Habra and his crew at FirstClick on traffic strategies. But sometimes you just get ...", "Google Inc (GOOG) Fundamentals Remain Best In Class [REPORT]": "The fundamentals of Google Inc (NASDAQ:GOOG) remain best in class, according to Ross Sandler, analyst at Deutsche Bank Market Research. Sandler noted that the search engine giant demonstrates a strong performance since October. According to him, the ...", "Google Shuts Down Payday Loan Advertiser’s Campaigns Over The Weekend": "According to TheDrum.com Google pulled all paid search ads run by Moneysupermarket.com as part of a crackdown on payday loan vendors that disregard AdWords’ policies. The Drum reports Google pulled all Moneysupermarket’s domain level ads including all ...", "Arthur Frommer gets Frommer brand back from Google": "NEW YORK (AP) -- Travel guru Arthur Frommer said Wednesday that he has reacquired rights to his travel guidebook brand from Google, and that he intends to resume publishing Frommer guidebooks. Google acquired the Frommer brand last summer from the Wiley ...", "TECH STOCKS: H-P, Google Among Decliners In Weak Tech Session": "SAN FRANCISCO (MarketWatch) -- Tech stocks put in a mixed market performance in early trading Monday, with Hewlett- Packard Co. and Google Inc. dipping into the red ahead of events scheduled by both companies. H-P ( HPQ) shares edged down by 4 ...", "Apple, Google, Intel likely conspired to not poach workers, judge rules": "SAN JOSE -- Finding strong evidence that Silicon Valley powerhouses such as Apple (AAPL), Google (GOOG) and Intel (INTC) had an \"anti-poaching\" pact not to raid rival work forces, a federal judge on Friday sent the strongest signals yet of the ...", "Opinion: Could Google pick the next president?": "After 15 minutes of searching and reading linked articles, it was clear that the manipulation had worked, with about 65 percent of subjects favoring the candidate getting elevated rankings, compared with 50 percent among a control group that saw impartial ...", "Dear Google Guys: Beat This Tech Whimsy Factor!": "BA is a member of The Motley Fool Blog Network -- entries represent the personal opinion of the blogger and are not formally edited. I realize Larry is running your humble 50,000+ employee venture, Sergey's cruising the NYC transit system with ...", "Baidu Copies Google Glass and 2 Stocks at 52-Week Lows on Friday": "The networking equipment firm estimated that its second-quarter net income and revenue will come in lower than expectations. Shares closed down 19.03 percent on Friday at $73.21, and have been traded in a 52-week range of $71.95 to $139.20. NEW! Discover a ...", "San Jose City Council to consider airport development to house Google planes": "SAN JOSE -- The San Jose City Council on Tuesday is poised to bolster the city's cash-strapped airport by approving an $82 million facility for private and corporate jets, including the growing fleet owned by Google's co-founders Larry Page and ..."}, "congress": {"Failure of nuclear talks with Iran jumpstarts push in Congress for tougher sanctions": "WASHINGTON (AP) -- The failure of negotiations between six world powers and Iran over its disputed nuclear program has jumpstarted the congressional push for even tougher sanctions aimed at crippling the economy in Tehran. The latest talks this past ...", "Lighting Industry of Eurasia Meets at İstanbulLight 8th International Lighting Technologies Exhibition & Congress": "İstanbulLight \"The leader Lighting Fair of Eurasia\" will take place between 18-21st April at ExpoCenter İstanbul with the support of AGID (Lighting Luminaires Manufacturers Association) - one of the founders of Lighting Europe.", "MICHIGAN VOTES: Some recently introduced bills in Congress": "The House and Senate are on a two-week spring break, so rather than votes this report instead contains several recently introduced bills of interest. Senate Bill 210: Increase charity sales tax exemption Introduced by Sen. Michael Green (R ...", "Pentagon awards surge 71 percent in March as Congress eases budget blow": "The Defense Department announced contracts valued at as much as $39.4 billion in March, 71 percent more than the prior month, even as automatic federal budget cuts started taking effect. Awards included a $2.6 billion contract to Huntington ...", "Lumeris to Share Vision for Transforming Care at World Health Care Congress": "Lumeris, an accountable care delivery innovation company, today announced that Chairman and Chief Executive Officer W. Michael Long and Chief Medical Officer Dr. Debbie Zimmerman will participate in panels at the 10th Annual World Health Care ...", "Lighting Industry of Eurasia Meets at IstanbulLight 8th International Lighting Technologies Exhibition & Congress": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact ...", "Philadelphia Category II License Applicants Present Proposals at 2013 Pennsylvania Gaming Congress, April 15-16": "PHILADELPHIA, PA -- (Marketwired) -- 04/08/13 -- Each of the six license applicants vying for the second casino license in Philadelphia will provide an overview of their proposals to attendees at the 8th Pennsylvania Gaming Congress : ctt.marketwire.com/?", "Congress for probe into land deals": "BHUBANESWAR: Senior Congress leader Narasingh Mishra on Monday demanded a probe into land allotment in Bhubaneswar by the Naveen Patnaik government in view of CAG pointing out undue benefits to selected individuals and corporates. Mishra also ...", "Afton Presents At The Annual UNITI Mineral Oil Technology Congress": "Afton Chemical will be presenting at the annual UNITI Mineral Oil Technology Congress, which takes place in Stuttgart on April 9 – 10, 2013. The event has 470 representatives attending from 22 countries, and covers a wide range of fuel ...", "RILA Business Group Urges Congress To Cut Corporate Taxes": "Walmart, Apple, J.Crew and scores of other famous retailers are members of a group pushing for changes in the corporate tax code that would benefit companies that stash more cash abroad. The Retail Industry Leaders Association, or RILA, sent a ...", "Maharashtra Congress asks partymen to gear up for 'early' LS polls": "Mumbai: The Congress in Maharashtra on Monday asked its workers to gear up for Lok Sabha polls, amid speculations that the general elections will be held in November 2013. Addressing a meeting of the party's Mumbai unit where he handed over the ...", "Novus participates in Global Feed & Food Congress": "Novus International, Inc is excited to participate of the 4th Global Feed & Food Congress (GFFC) which will take place on April 10-12 in Sun City, South Africa. This important meeting was organized by the International Feed Industry Federation ...", "Duke Energy CEO Joins Push Urging Congress to Cut Debt": "Duke Energy CEO Jim Rogers (NYSE: DUK ) is calling on people to encourage federal lawmakers to \"take immediate action to develop a more sustainable financial strategy for the country.\" Rogers released a statement today announcing he has joined ..."}, "senate": {"ASUC amendment proposes shifting responsibility of setting yearly agenda from senate to Office of the President": "A referendum on this year’s ASUC ballot may change how the ASUC handles the Advocacy Agenda in an effort to ensure more effective implementation. If passed, the referendum would amend the ASUC Constitution to shift the responsibility of ...", "Anti-bullying measure passes Senate panel": "A measure to get tough on bullying gained steam this week as the Senate Education Committee voted 8-2 on Wednesday in favor of sending the measure onto the full Senate. For Fairland resident Angie Stagge, the fact that House Bill 1423 is ...", "Draft Senate Bill Would Target ‘Too Big To Fail’ Banks With Higher Capital Requirements": "Draft legislation authored by Ohio Sen. Sherrod Brown (D) and likely to be cosponsored by Louisiana Sen. David Vitter (R) would attempt to limit the size of “too big to fail” banks by imposing strict capital requirements and preventing them ...", "The Senate Takes a Swipe at Too Big to Fail Banks": "U.S. Senate Republicans and Democrats are drafting a proposal that is designed to curb the size of some of the largest banks in the United States. This proposal would require some of the banks, including JPMorgan Chase (NYSE:JPM) and Bank of America (NYSE ...", "Nebraskans are tough, Deb Fischer says in 'maiden' speech on Senate floor": "That was one of the points Sen. Deb Fischer made Monday during her first speech on the floor of the U.S. Senate. “We are tested by droughts, by fires and floods and a changing global economy,” the Nebraska Republican said of her home state.", "Senate committee to tackle controversial St. Croix quarry": "ST. CROIX - The quarry operating in Ham's Bay on the island's far northwest corner has become a hot-button topic for those who live in the area - and the issues surrounding the quarry will be discussed at a Senate committee hearing today.", "Proposal to boost speed limits clears Ohio Senate": "COLUMBUS, Ohio (AP) - A proposal to increase Ohio's speed limit to 70 mph on rural interstate highways has cleared the state Senate. Wednesday's 27-6 vote comes after a legislative panel worked out differences between House and Senate versions of the ...", "Mass. Democratic Senate candidates to debate": "LOWELL, Mass. (AP) — The two Democratic candidates for U.S. Senate are meeting for a debate at the University of Massachusetts Lowell. The debate is sponsored UMass Lowell's Center for Public Opinion and the Boston Herald. The public is invited on a ...", "Senate advances immigrant license bill": "MONTPELIER — The state Senate has advanced legislation to allow immigrant workers on Vermont farms to become legal drivers, even though they may be in the country illegally. The 27-2 vote came nearly 19 months after Vermont State Police ...", "Univ. Senate addresses non-tenure-track faculty issues": "Non-tenure-track faculty members who have expressed concerns about their treatment at the university could soon see changes, after the University Senate voted Thursday to accept a set of task force recommendations. The recommendations deal ...", "The “New Jobs For New Jersey Act” Passes In Both The Senate And The Assembly": "On February 7 and February 14, 2013, the “New Jobs for New Jersey Act” passed in the Senate (S2211) and the Assembly (A3312), respectively. As noted in the October 2012 issue of the New Jersey eAuthority, this bill seeks to make employers with 100 or ...", "Wall Street's new top cop: Senate confirms Mary Jo White to head SEC": "The U.S. Senate confirmed Mary Jo White to lead the Securities and Exchange Commission, putting the former U.S. attorney in charge of an agency that has failed to satisfy critics with its response to the financial crisis. The Senate approved White by ...", "Senate addresses graffiti, passes several resolutions": "The Tufts Community Union Senate ended its final meeting of the semester last night with votes on eight resolutions in asession that lasted into the early hours of the morning. Senators interrupted the session to draft a statement in reaction to ..."}, "bing": {"EFM Kevyn Orr says he wants Mayor Dave Bing, city council to help reshape Detroit": "Kevyn Orr arrived for his first day on the job at 7 a.m. Monday, an early start to a historic day as Detroit's first emergency financial manager tasked with fixing the city's budget crisis. As protesters waved signs and chanted outside, one of ...", "Yahoo Bing CPCs Up? Here’s How to Combat Them": "If you’ve noticed CPCs going up in Yahoo Bing, you’re not alone. Yahoo Bing made some subtle changes to its cascading bidding structure last year, putting it more in line with Google. The net result, from what we’ve seen across various clients in ...", "SWA Group with Bing Thom Architects and Ronald Lu & Partners Designing a new Gateway to West Kowloon Cultural District, Hong Kong": "Working in conjunction with leading Canadian Architect Bing Thom, SWA Group and the design team are working on the first building and gateway to one of the world’s largest cultural infrastructure projects, the West Kowloon Cultural District (WKCD) in ...", "Quinn touts agreements reached in Mexico": "Gov. Pat Quinn on Monday talked about his three-day trade trip to Mexico, where he signed agreements aimed at boosting exports of Illinois soybeans, promoting the state's water technology firms and increasing tourism. The governor said the trip ...", "How to Submit a Blog to Bing Blog Search": "Creating a blog on your business website is a good way the keep your Web content fresh, which will make your website rate higher in search engine results and bring in more readers. But your blog won't be included in the results of search engines such as ...", "PROMISES, PROMISES: Oil imports": "Every president since Richard Nixon has pushed to cut U.S. dependence on imported oil, and President Barack Obama is no exception. Now, though, for the first time in 30 years, oil imports are falling in a significant way. New drilling technologies ...", "Coryell County: Deal With Extraco Means Extra County Office Space": "GATESVILLE (April 8, 2013)—Extraco Banks has agreed to sell its Gatesville Financial Center to Coryell County in exchange for a long-term lease on the 4,000 square feet needed for the financial center, Extraco announced Monday. The deal gives ...", "Bing announces 'unprecedented' effort to improve safety in Detroit": "Detroit — Mayor Dave Bing unveiled an ambitious plan Monday by local business leaders to fund the purchase of public safety vehicles for the cash-strapped city. In what was described as an \"unprecedented collaboration,\" Bing held a press ...", "32 code violations found after Bellevue Macy's escalator accident": "The Washington state Department of Labor and Industries said Monday its investigation of an escalator malfunction that injured seven people at Bellevue Square Mall Macy's last December uncovered 32 code violations, 15 of which were directly related to the ...", "Rhino Resource Partners LP Announces Sale Of Utica Shale Royalty Interest": "LEXINGTON, Ky., April 8, 2013 /PRNewswire/ -- Rhino Resource Partners LP RNO (\"Rhino\" or the \"Partnership\") today announced that it has closed on an agreement with a third party to sell the 20% royalty interest on its owned Utica Shale property ...", "Leaders announce drastic action to fight Detroit takeover": "DETROIT (FinalCall.com) - Detroit leaders, with Rev. Jesse Jackson of Rainbow PUSH, announced they will conduct “major, mass non-violent direct action” protests in the city as a joint state/bank takeover begins. The protests will be ...", "Mayor Bing: $8 million donations will buy 23 EMS units, 100 police cruisers": "Detroit private business, including the Penske Corporation, will donate $8 million for 23 EMS units and 100 police cruisers to boost public safety and reduce response times, Mayor Dave Bing announced this morning. Roger Penske joined Bing this ...", "Bing Gordon’s Founder Checklist: Animal Energy, Blind Confidence, And A Toupee.": "Editor’s note: Derek Andersen is the founder of Startup Grind, a 40-city community bringing the global startup world together while educating, inspiring, and connecting entrepreneurs. As an Electronic Arts’ intern eight years ago, I ..."}, "beyonce": {"Stocks edge higher ahead of earnings season": "NEW YORK — Stocks edged higher Monday, erasing an early loss, as major U.S. companies prepared to start reporting first-quarter results. Alcoa will release its results after the markets close Monday. The aluminum company will be the first ...", "Corruption Currents: From The Appeal of Steakhouses to Lula Probed": "This feature replaces High Tide, which appeared daily in the Corruption Currents blog. Readers can subscribe to The Morning Risk Report here. Bribery: The link between political bribery and steakhouses is so obvious, but why does it continue to ...", "Miami lawmakers question Beyoncé, Jay-Z trip to Cuba": "U.S. Reps. Mario Diaz-Balart and Ileana Ros-Lehtinen, both Cuban-American Republicans from Miami, sent a letter late Friday to the Treasury Department asking for details about R&B stars Beyoncé and Jay-Z's trip this week to Cuba. In the letter ...", "Clarification: Power Scooters-Fraud story": "WASHINGTON (AP) - In a story March 28 about Medicare purchases of power wheelchairs and scooters, The Associated Press reported that government inspectors say up to 80 percent of the scooters and power wheelchairs Medicare buys go to people who don't meet ...", "Frog-phobic man awarded $1.6M over runoff flooding": "CLARENCE, N.Y. (AP) -- A western New York man will get $1.6 million to settle a dispute that left him hopping mad when flooding from a nearby development left him inundated with frogs. The award settles a seven-year legal fight involving Paul Marinaccio ...", "Do You Have Your CICI? Energy Traders Down to the Wire on Dodd Frank Compliance": "If you trade an energy product over the counter rather than on an exchange, you probably need to get yourself a CICI number by Wednesday (April 10). That's the deadline the Commodity Futures Trading Commission has set up for firms that haven't ...", "PROMISES, PROMISES: Oil imports": "Every president since Richard Nixon has pushed to cut U.S. dependence on imported oil, and President Barack Obama is no exception. Now, though, for the first time in 30 years, oil imports are falling in a significant way. New drilling technologies ...", "LOCAL ROUNDUP: Valentino steals home in Wolves win": "MIAMI (AP) — Beyonce and Jay-Z's trip to Cuba has angered two Cuban-American politicians who are demanding information on whether the couple's… NEW YORK (AP) — Who could ever forget the wisdom of the rock band Spinal Tap: \"It's such a fine line ...", "Arggggh! American Workers Are at a Breaking Point": "\"What can I tell you?\" she said. \"We dated for three years and I never got a ring!\" In the words of Beyonce: If you liked it then you shoulda put a ring on it … If you liked it then you shoulda put a ring on it … Uh oh, oh-oh-oh …. Uh-oh-oh ...", "NV Indoor Ag Conference Assembles Innovators to Confront Challenges to Local Food Production": "The Nevada Indoor Agriculture Conference, which will take place on Wednesday, April 24 at the Historic 5th Street School in Downtown Las Vegas, will explore solutions to increase local food production in Nevada. Las Vegas, Nev. (PRWEB) April 08, 2013 ...", "Trial over Martha Stewart brand resumes": "Attorneys for J.C Penney and Macy were back in court Monday to fight over the Martha Stewart brand after a monthlong mediation period went nowhere. The court-ordered mediation followed nearly three weeks of testimony from witnesses including the domestic ...", "HTC posts 98% dive in quarterly profit": "HTC Corp posted its lowest quarterly profit on record after the delay of its newest flagship phone caused revenue to miss the company's target. First-quarter net income plunged 98 percent to NT$85 million (US$2.8 million), ... HTC is on the brink of no ...", "We Need a Visionary Like Margaret Thatcher for our 21st Century Challenges": "This clip of Margaret Thatcher magnificently expresses the confident purpose of the conservatism of the 1980s. Throughout the capitalist world, economies had faltered and stagnated in the 1970s. In order to accelerate growth, reforms had to be ..."}, "yahoo": {"Yahoo fund disbursement rankles Niagara lawmaker": "Though they’re happy about an expansion of Yahoo in Lockport, Niagara County legislators still found something to complain about this week. Niagara County Legislature Majority Leader Rick Updegrove, R-Lockport, issued a media release Wednesday ...", "Flip-side of Yahoo debate: Is flextime required?": "Yahoo’s CEO got caught in a major media firestorm last month over her decision to eliminate employees’ work-from-home options. But employers should not get Yahoo’s business mandate confused with the legal obligations of every U.S. employer to ...", "Yahoo Mail, Dropbox partnership spells win-win for both parties": "Summary: The upgrades and additions to Yahoo's core products continues in a big way thanks to a new integration with Dropbox. Yahoo Mail and Dropbox have announced a new partnership , bringing direct access to the cloud storage service o ... My first ...", "Yahoo! Expansion Causing Controversy Over Local Non-Profits": "LOCKPORT, N.Y. (WKBW) - The building of a multi-million dollar facility in Niagara County is causing controversy. The facility for Yahoo! is causing controversy because of a mandate attached to the deal which requires Yahoo! to contribute millions of ...", "Hedge Fund Giant Daniel Loeb Beats the Market with Yahoo, and Cheniere Energy": "In a difficult quarter for hedge funds, and rather pleasant one for the S&P 500, Daniel Loeb bested the market with a 13.3% in his Ultra Fund in the first three months of the year, according to CNBC. By comparison, the S&P returned 10%, and the ...", "Yahoo! Inc. (YHOO) Option Traders Brace for a Fall": "Broad-market headwinds are keeping Yahoo! Inc. (NASDAQ:YHOO) just south of breakeven, with the stock testing familiar support atop its 20-day moving average. From a longer-term perspective, the Internet issue has been on a quest for multi-year highs ...", "Lawmaker questions Yahoo! fund": "Lockport Union-Sun & Journal — A Lockport-area county legislator called attention this week to a provision in Yahoo!’s agreement with the state requiring the company to funnel funds to an area charitable foundation in exchange for receiving state tax ...", "Major Stock Movers: Boston Scientific Corporation, Lowe's Companies, Yahoo! Inc, Magnum Hunter Resources Corp": "Lakeway, TX -- (SBWIRE) -- 04/04/2013 -- Bestdamnpennystocks, an investment community with a special focus on updating investors with recent news on the U.S. stock market, issues news alert on the following stocks:- Boston Scientific Corporation(NYSE:BSX ...", "Yahoo! Set to Possibly Pullback After Yesterday's Rally of 1.19%": "Yahoo! (NASDAQ:YHOO) traded in a range yesterday that spanned from a low of $23.60 to a high of $23.90. Yesterday, the shares gained 1.2%, which took the trading range above the 3-day high of $23.83 on volume of 14.6 million shares. Often times after large ...", "The 50 Most Ridiculous Questions Asked on Yahoo! Answers": "One of the great powers of the Internet has been its abiity to democratize information. Not only do we have sites like Wikipedia and WebMD as well as countless other free or cheap information sites, we have websites like Yahoo! Answers. Founded in 2005 as ...", "At Odds: Connecting Dots Between Rutgers, Yahoo Ban, Teacher Scandal and Politics": "Atlanta teachers accused of cheating. Yahoo bans telecommuting. A Rutgers’ basketball coach hurls balls and epithets at his players. Meanwhile, in Washington, the president and House Republicans can’t or won’t bridge their differences and regain the ...", "Distribution of Yahoo charitable donations questioned": "LOCKPORT – Yahoo must donate $3.5 million to the Community Foundation for Greater Buffalo as a condition of receiving tax breaks and other incentives for its expanded Lockport data center – an arrangement that doesn’t strike close enough ...", "Win 'The Bible' on Blu-Ray from Yahoo! TV": "Joe Alblas/History Channel - \"The Bible: The Epic Miniseries\" on Blu-Ray Last night, on Easter Sunday, more than 11 million viewers tuned in to watch the conclusion of History's epic miniseries \"The Bible,\" which dramatized the age-old tale of the death ..."}, "movies": {"Stream classic movies and TV shows from Warner Archives for $9.99 a month": "Warner Bros. has decided to join in on the saturated video-streaming marketing by offering its own subscription-based video streaming service. Warner Bros. service is extremely distinctive from the likes of Netflix and Hulu Plus however. Its ser ..", "Ireland’s attractive tax breaks for TV and movies could be on the way out": "The Irish tax breaks that have allowed shows like “Camelot” to be filmed in the Emerald Isle could be on the way out, warns Irish Finance Minister Michael Noonan. According to Variety, Section 481 “offers up to 28% benefit for projects, up ...", "Production Companies to Continue Shooting Movies, TV Shows, Commercials in PA with Film Tax Credit's Preservation": "HARRISBURG, Pa., Oct. 15 /PRNewswire-USNewswire/ -- Pennsylvania's film tax credit program, which has helped to generate hundreds of millions of dollars in revenue and create thousands of jobs, will continue through 2011 under the newly-enacted state budget.", "When buildings play movies: the Creative Corridor plan for Little Rock": "Last December, the city of Little Rock unveiled the Creative Corridor, a master plan to revitalize four blocks of Main Street. Designed by Fayetteville architects Marlon Blackwell, who heads the Fay Jones School of Architecture at the University of ...", "DreamWorks Animation had the Lowest Relative Performance in the Movies & Entertainment Industry (DWA, IMAX, LYV, LGF, NWSA)": "Analysis was conducted on the Movies & Entertainment industry to measure relative performance to find stocks that have underperformed. Relative underperformance is a possible bearish sign of underlying fundamental and technical weakness should it continue ...", "10 Classic Movies That Almost Had Completely Different Plots": "It’s hard to look at early conceptions of The Wizard of Oz from anything close to an objective perspective, such is its iconic cultural status. This task is made even more difficult by the amount of time elapsed since its production. We might ask ...", "Shoot movies in UP and get funds: Govt woos filmmakers with lucrative offers": "LUCKNOW: Opening its arms to filmmakers of the country, the state cabinet on Monday decided to provide 25% funding to all films that use local UP dialects on the condition that at least 75% of each film is shot in Uttar Pradesh. Capping the ...", "MOVIES: Regal Cinemas offers $3 off pizza coupon": "This weekend just feels like a pizza kind of time. Wow, what great timing! Regal Cinemas’ mobile coupon of the week just so happens to be a pizza one. $3 off the price of a personal sized pizza to be exact. To get the coupon just “like ...", "Here’s How Top Movies are Boosting Studio Revenues": "Studios are profiting from some of the most popular films being released. For instance, Paramount is seeing huge benefits from its decision to push “G.I. Joe Retaliation” back for an Easter release. United States ticket sales netted the studio about $ ...", "Sky Go service gets Sky Movies Disney content": "Sky Go users can now enjoy a wider variety of content on the mobile service with Sky now offering content from its new Sky Movies Disney channel. Customers can sit back and watch their favourite Disney movies, old or new, on their tablets, smartphones and ...", "Digital conversion: Independent theaters, drive-ins can thrive on nostalgia, indie movies and customer relationships": "KALAMAZOO, MI --Owners of independent theaters and drive-ins in Southwest Michigan are cautiously optimistic their investments in digital projectors will help them remain a fixture in their communities. In our MLive/Kalamazoo Gazette series examining how ...", "Parks, movies on Traverse City agenda": "TRAVERSE CITY — Proposals for movies in museums and tapping a trust fund for millions of dollars in parks improvements will headline the city commission's upcoming study session. The Traverse City Film Festival's proposal to convert the vacant Con Foster ...", "Fort Pierce Library announces April movies": "FORT PIERCE — The Fort Pierce Branch Library announces its Friday Matinee program for April. Held every Friday, the library presents a free film, starting at 2 p.m. • April 5 - \"The Money Pit\" (2001) featuring Tom Hanks and Shelly Long."}, "amazon": {"Amazon Gives Peek Inside New Facility": "MURFREESBORO, Tenn. - The world's largest online retailer gave the public a peek inside its brand new Murfreesboro facility on Friday. Amazon allowed NewsChannel 5's cameras into its one million square foot fulfillment center. It has enough space to ...", "Wishlist fulfilled with 1,100 new Amazon jobs": "MURFREESBORO — Amazon celebrated the grand opening of its fulfillment center here Friday beneath a banner showing downtown Nashville. But local officials didn’t seem to mind. “We’re the best part of Nashville,” Murfreesboro Assistant ...", "Amazon.cn Begins Convenient Pick-up Service In Shanghai": "Amazon.cn announced that it has cooperated with FamilyMart retail convenience stores in the launch of a pick-up service in Shanghai. Nearly 100 pick-up sites will be launched in the first wave, covering most areas in the city. Yao Zhongen, vice ...", "Amazon facility opens in Murfreesboro, employs 1,100": "Amazon officially opened its new distribution center in middle Tennessee on Friday. State and local lawmakers gathered at the Amazon Fulfillment Center in Murfreesboro for the grand opening ceremony. Construction on the site, located on Joe B. Jackson ...", "Amazon cuts ribbon on new warehouse": "Less than one year ago, construction crews broke ground on a site along Joe B. Jackson Parkway to make way for a million-square-foot facility that online retail giant Amazon.com would call home. Community leaders, elected officials and Amazon ...", "Amazon Adds Vinyl for its CD ‘AutoRip’ Purchases": "Do you prefer to have physical copies of your music? At groovyPost we have a few in-house vinyl record enthusiasts, and this week Amazon made an announcement that resulted in plenty of excitement. From now on, a good majority of Amazon’s music will ...", "Amazon X-Ray Aims To End Unidentified Actor Angst": "Best deal on print subscription plus Tablet Edition for iPad Save up to 65% when you subscribe today. The perfect gift for any holiday or occasion. Amazon's X-Ray allows viewers watching certain movies or TV s ... Best deal on print subscription plus ...", "Amazon fulfills at fast pace": "About the Murfreesboro Amazon Fulfillment Center: • The site is more than 1 million square feet, the equivalent of more than 25 football fields, and handles smaller items like DVDs, books or electronics, to name a few. • General Manager ...", "Amazon’s latest downtown Seattle office lease: 150,000 square feet": "Amazon.com will lease more space in downtown Seattle’s 1800 Ninth Avenue Building than previously thought. Commercial real estate company Kidder Matthews reported on Thursday that the online retailer signed a lease for 150,000 square feet.", "Amazon: What can we learn from them?": "Christoph Rieche, CEO of small business finance company iwoca, is naturally a bit of an expert in finance. Having previously been a Vice President at Goldman Sachs, he knows how to assess a businesses financial arrangements balancing risk with reward.", "CEO Of Amazon.com Inc. (NASDAQ:AMZN) Jeff Bezos Invests in Blodget’s Business Insider – AMZN, DANG, PCCC, DLIA, GAIA": "The news site Business Insider Inc., co-founded by former Internet analyst Henry Blodget, lifted $5M in venture capital from investors managed by Amazon.com Inc. (NASDAQ:AMZN) CEO Jeff Bezos. Business Insider declared that an avid reader of the site Bezos ...", "Amazon.com Rating Reiterated by Zacks (AMZN)": "Zacks reaffirmed their neutral rating on shares of Amazon.com (NASDAQ: AMZN) in a report issued on Thursday, Stock Ratings Network.com reports. They currently have a $272.00 target price on the stock. Zacks’ analyst wrote, “Amazon.com is one of the ...", "Amazon offers digital songs to vinyl record buyers": "SEATTLE -- In an odd combination of old and new, Amazon says that every time a person buys a vinyl record from its online store, it will give that customer a digital version of the songs for free. The feature, called AutoRip, was launched in ..."}, "music": {"Playing music, speaking loudly can get you thrown off BEST bus": "Ever wished that you could ask the passenger talking loudly or blaring music on his phone to leave the bus? Now, all you have to do is inform the bus conductor. The Brihanmumbai Electricity Supply and Transport (BEST) undertaking has issued a ...", "Caledonia mulling changes to recent outdoor music ordinance, fees": "CALEDONIA — With comfortable summer weather still likely weeks away, a change may be coming to the Village of Caledonia’s recently approved outdoor music ordinance. The ordinance, approved by the village board on Feb. 18, was designed to make it easier ...", "New Media Specialist Engel Thedford Launches Kickstarter Campaign for Electro/Techno Remix Music Video for \"Hire Me\"": "Torrance, CA -- (SBWIRE) -- 04/08/2013 -- In February, Engel was laid off from his position as a Post Production Supervisor and was forced into the online job search race. After spending hundreds of hours applying for countless positions he began to ...", "Developer to direct Music Hall rehab": "The group planning the revitalization of Music Hall will partner with the nonprofit developer Cincinnati Center City Development Corp. to see through the multimillion dollar project of the historic landmark to completion. The board of the Music ...", "HMV buyer announces music-focused revival plan": "The sale of T-shirts and other artist memorabilia are expected to be at the heart of an optimistic \"we are entertainment\" revival plan for HMV, which was rescued by a turnaround firm in a £50m deal that has secured about 2,500 jobs at 141 of ...", "Music retailer HMV handed lifeline": "LONDON (Reuters) - Britain's most high-profile entertainment retailer HMV was handed a lifeline on Friday when a turnaround group bought it, ensuring a future for a firm which gave the Beatles one of their first big breaks. Opened on London's Oxford Street ...", "Have Your Classical Music Questions Answered": "Do you have a question about classical music? You’ll get answers Monday, April 8, at 1 p.m. when Paul Mark Somers continues his Bay-Atlantic Symphony music lecture series at the Little Egg Harbor branch of the Ocean County Library. Somers, who is the ...", "Henley Business School's New MBA in the Music Industry Program Gets U.S. Launch at Musexpo, May 5-8, 2013": "Los Angeles, CA, April 08, 2013 --(PR.com)-- Spearheaded by Program Director, Helen Gammons, the Henley Business School will officially launch it's new MBA in the Music Industry program in Hollywood at the Musexpo global music event, May 5-8, 2013.", "Is Regina music box noted for its high value?": "Q. I was wondering if you had any info on this Regina music box. I inherited it when my grandmother passed away, but supposedly it was purchased for my great-grandmother, who was bedridden. I think the music box dates to the late 1800s.", "Jay-Z, Roc Nation sign with Universal Music Group": "Roc Nation, the entertainment company founded by Jay-Z, and Universal Music Group have entered a multiyear, worldwide partnership, the companies announced Monday. The venture will allow the Roc Nation music label to operate as a standalone ...", "City council approves Music Hall lease agreement": "Cincinnati City Council unanimously approved a 75-year lease of Music Hall to the Music Hall Revitalization Co. on Monday. The deal was approved by the city’s planning commission last week and went before the council’s finance committee in a ...", "OCU to Host Free El Sistema Music Ed Symposium": "Jamie Bernstein, a writer, arts advocate and daughter of composer Leonard Bernstein, will be the keynote speaker at Oklahoma City University’s “Music Transforms” symposium April 13 that will introduce the renowned Venezuelan music-education program ...", "Story Next Door: Where music and technology groove together": "Kevin Patton, an assistant professor of music and performance technologies at Oregon State University, poses with his sensor-augmented electric guitar that allows real-time control of effects based on motion. Patton has been working on the concept for a ..."}, "bieber": {"Report: Virgin America best US airline in 2012": "WASHINGTON - Virgin America did the best job for its customers among leading U.S. airlines last year, a report said Monday, as carriers overall had their second best performance in the more than the two decades since researchers began measuring ...", "Sebi should file reply in 4 weeks on RIL case: SAT": "The Securities Appelatte Tribunal (SAT) has asked the stock market regulator Securities and Exchange Board of India (Sebi) to file a reply opposing the admission of a petition by Reliance Industries (RIL) in four weeks. That apart, SAT on Monday also asked ...", "Justin Bieber And The Housing Market Are Going Through The Same, Insane Spiral": "Justin Bieber's popularity is hitting an all-time high around the world. Unfortunately, he/she is a sheltered adolescent surrounded by a fawning entourage and legions of highly-paid people whose job it is to tell him how great things are. And so, as you ...", "Justin Bieber couldn't give a monkey's about abandoned pet monkey": "If turning up late for his O2 gig was the start of Justin Bieber's downfall, then illegally taking a monkey on a plane then leaving it in a German gibbon jail shows us his journey to Britneytown is rapidly increasing speed. Justin Bieber has abandoned his ...", "Lillian Bieber": "Lillian Eileen Bieber, 77, of Waukon died Friday, March 29, 2013 at Veterans Memorial Hospital in Waukon. A celebration of life was held Tuesday, April 2 at the Waukon Banquet Center, with Chris Leppert officiating. Committal service was held at Oakland ...", "Justin Bieber Monkey Update: Mally Is Doing Just Fine in German Shelter": "Justin Bieber‘s monkey Mally — no, not that one, that’s Jerry — is doing just fine. So PETA and other animal rights organizations can call off the dogs (!!!) regarding the situation that saw Mally quarantined in Germany, since his owner didn’t ...", "What Stocks Would Justin Bieber Buy?": "If you were looking to build a portfolio based on the hits of pop stars, what stocks would interest such stars? In this article, we'll consider some hypothetical stock picks from Justin Bieber. Baby, Buy Johnson & Johnson One of his biggest hits, \"Baby ...", "Pattie Mallette Talks Justin Bieber's Tabloid Troubles, New Film Crescendo & Staying In Touch With Selena Gomez": "Justin Bieber's mom, Pattie Mallette, stopped by Access Hollywood Live on Wednesday, where she discussed her new film \"Crescendo\" and her son's seemingly ever-increasing tabloid headlines. Is she alarmed by any of his recent antics? \"Him being 19, you know ...", "Bieber gets deadline to claim pet monkey": "German authorities have given Justin Bieber four weeks to pick up his pet monkey or else it will be placed in permanent care. Customs officials seized the capuchin monkey Thursday when the 19-year-old failed to produce customs documents after landing in ...", "HTC posts 98% dive in quarterly profit": "HTC Corp posted its lowest quarterly profit on record after the delay of its newest flagship phone caused revenue to miss the company's target. First-quarter net income plunged 98 percent to NT$85 million (US$2.8 million), ... HTC is on the brink of no ...", "Justin Bieber given 4 weeks to reclaim pet monkey from Germany or it will be placed in care": "BERLIN - German authorities have given Justin Bieber four weeks to pick up his pet monkey or else it will be placed in permanent care. The capuchin monkey was seized by German customs Thursday when the 19-year-old singer failed to produce the ...", "‘Contrary to what some people think, there is no war on cars,’ Ontario premier says in transit speech": "Premier Kathleen Wynne is urging the business community to help unite Ontario residents behind a multibillion-dollar plan to fund public transit in the Greater Toronto and Hamilton area. Speaking to the Toronto Region Board of Trade on Monday ...", "‘Green’ sports car maker Fisker fires 75 percent of workforce": "The company’s flagship vehicle, the $100,000-plus Karma plug-in hybrid, quickly won accolades for its styling and cachet with celebrities, including pop star Justin Bieber and actor Leonardo DiCaprio, who is also an investor in the company."}, "lawmakers": {"Grand Rapids Area Chamber of Commerce to cajole local lawmakers at Politics & Pints event": "GRAND RAPIDS, MI — West Michigan policymakers from all levels will field questions and comments from the Grand Rapids Area Chamber of Commerce during Politics and Pints later this month. The event, being hosted by the Chamber at MLive's Grand Rapids hub ...", "Melissa Griffin: California Lawmakers Focus On Proposed Ammo Regulations": "SAN FRANCISCO (KPIX 5) – There’s an old saying that “guns don’t kill people, bullets kill people.” California Democrats are taking it to heart and taking aim at bullets. Among the nearly two-dozen gun control bills that have been ...", "Indiana Lawmakers To Discuss Financial Impact Of Arming School Employees": "INDIANAPOLIS, Ind. (www.incnow.tv) – Lawmakers in Indiana are considering a proposal that would require an employee armed with a loaded gun to be in all public and charter school during school hours. Last week a House panel endorsed the bill ...", "Legal Weed: Colorado Lawmakers Consider A Nearly 40 Percent Tax On Recreational Marijuana": "Pot smokers in Colorado were the biggest winners in the vote that legalized the drug. Now state regulators are working out the details of exactly how to tax it, so the benefits are shared statewide in the form of increased revenue. (AP Photo/Ed ...", "Maine lawmakers begin hearings on gun bills": "AUGUSTA, Maine (AP) — Gun control supporters believe the killings of 20 children and six educators at a school in Connecticut will provide political momentum as lawmakers take up a series of gun control bills. The Legislature is holding hearings this ...", "On the lawmakers’ agenda": "BORDER CROSSINGS Legislator José Pereira Coutinho urged the government to strive for a further extension of border-crossing points, from the current 17 hours each day to 22 hours and finally to 24 hours. The lawmaker issued a written enquiry last Friday ...", "Punjab lawmakers set eyes on casino industry": "PANAJI: Punjab may well become the third state to throw open its doors to casinos. In Goa to attend a strategy meet, leaders of the ShiromaniAkaliDal-BJP combine went about scouting for details about the flourishing casino business in this state ...", "Lawmakers treated to lavish parties in Frankfort": "FRANKFORT, Ky. (AP) — When Frankfort lawmakers discuss parties, they're not always referring to the Democratic and Republican varieties. Lobbyists spent more than $77,000 on get-togethers for lawmakers in January and February, including one at the ...", "US lawmakers push for new sanctions on Iran": "Will anyone stop watching his movies when he is in jail? Answer is 'no'. Then why should we stop ads, asks Mehul Choksi, Gitanjali Grp. The 434-km highway, the only road linking Ladakh with rest of the state, remains closed during winter due to ...", "Northwest lawmakers may be wasting time on distracted-driving laws, U.S. Transportation survey shows": "Of course, daydreaming or being \"lost in thought\" is responsible for more fatal U.S. car crashes than mobile-phone use, according to another study. As Oregon lawmakers debate jacking up the fines on texting drivers in an effort curb the dangerous habit, a ...", "Tonawanda lawmakers want Tonawanda Coke fines to remain here": "Town of Tonawanda lawmakers have joined an effort to direct potential fines to be paid by Tonawanda Coke Corp. to the community it polluted. In a 4-0 vote Monday, the Town Board adopted a resolution that supports setting aside fine money for the ...", "Maryland lawmakers pass medical marijuana bill": "ANNAPOLIS, Md. (AP) — The Maryland General Assembly has approved a measure to allow medical marijuana programs at academic medical research centers that decide to participate. The Senate passed a House of Delegates bill 42-4 on Monday with ...", "Lobbyists throw lawmakers lavish parties": "FRANKFORT, — When Frankfort lawmakers discuss parties, they’re not always referring to the Democratic and Republican varieties. Lobbyists spent more than $77,000 on get-togethers for lawmakers in January and February, including one at the Buffalo Trace ..."}, "america": {"Virgin America aces first Airline Quality test": "* The airline outperformed 13 others, including United, its chief rival on Newark flights to Los Angeles and San Francisco. Virgin America, which began flying to Los Angeles and San Francisco out of Newark one week ago today, has grabbed first place in ...", "Feeding America Southwest Virginia issues plea for donations to help the hungry": "Apr 07, 2013 (Smyth County News & Messenger - McClatchy-Tribune Information Services via COMTEX) -- The rising costs of food and fuel may leave more families hungry this year should local food banks see increasing demand and decreasing supplies.", "Bank Of America's Mean Reversion Illustrated": "Bank of America (BAC) has been a continual under-performer amongst large money center banks since the financial crisis. As a result, the bank trades at 0.6 times book value. Recently, the most popular investment thesis for the company is a 'mean reversion ...", "Virgin America best U.S. airline, United worst: study": "(Reuters) - Virgin America did the best job of flying customers last year while United Airlines was the worst, though passengers experienced overall better performance, a study showed. The performance of the 14 leading carriers in 2012 was about ...", "Bank of America’s Asia DCM Head Leaves After Three Weeks in Job": "Ashish Malhotra has left Bank of America Corp. (BAC) less than a month after the lender named him as head of its debt capital markets unit in Asia. Malhotra was responsible for investment-grade and high- yield debt origination in the region and ...", "Virgin America did best jobs for customers last year": "WASHINGTON — Virgin America did the best job for its customers among leading U.S. airlines last year, a report said Monday, as carriers overall had their second-best performance in the more than the two decades since researchers began ...", "AMERICA MUST LEAD IN GREEN ENERGY": "DUMMERSTON, Vt. -- As we watch hundreds of thousands of gallons of oil gush into the Gulf of Mexico after the the explosion and sinking of the BP Deepwater Horizon oil platform, perhaps this is another wake-up call to start moving our economy away from ...", "Samuelson: Myths of post-industrial America": "We live in a post-industrial age, defined more by Google than by General Motors. The term \"post-industrial society\" was first popularized by the sociologist Daniel Bell (1919-2011) in a 1973 book, and the change has generally been a boon. The transition ...", "THE AMERICA IDEA MAKES US EXCEPTIONAL": "DUMMERSTON, Vt. -- One of the bedrock tenets of conservatism is the idea of American Exceptionalism - that the United States is the greatest nation in the world. Yes, this nation has been successful at exporting the idea of represenative democracy around ...", "Virgin America best U.S. airline performer in 2012": "A report on airline quality says U.S. airlines scored their second best performance last year, with Virgin America the leader. WASHINGTON — A report on airline quality says U.S. airlines scored their second best performance last year, with ...", "Providing Capital and Technology, GE Is Farming the Wind in America's Heartland With Enel Green Power": "GARDEN CITY, Kan., April 8 -- General Electric issued the following news release: Providing capital and technology to farm the wind in America's heartland with global renewable energy company Enel Green Power, GE (NYSE: GE) is investing common ...", "Virgin America No. 1 in airline performance": "WASHINGTON – U.S. airlines scored their second-best performance last year in the more than two decades that researchers have been measuring airline quality, with Virgin America the leader, says an annual report released Monday. The report ...", "Report: Virgin America best U.S. airline in 2012": "WASHINGTON (AP) — Virgin America did the best job for its customers among leading U.S. airlines last year, a report said Monday, as carriers overall had their second best performance in the more than the two decades since researchers began ..."}, "twitter": {"Follow Saginaw County Sheriff William Federspiel on Twitter": "SAGINAW, MI — Saginaw County Sheriff William Federspiel often refers to the 200,000-plus county residents as his employers and today he announced a new way for them to look in on what their employee is doing every day. Sheriff William Federspiel launched ...", "Tesla CEO’s Twitter Post Adds to Social Media Comment Fray": "Tesla Motors Chief Executive Officer Elon Musk stoked the controversy over giving out corporate information on social media with a Twitter post that the electric-car company will make a “really exciting” announcement next week. The company’s shares ...", "Obama's Twitter page: It's not him, President handed it over to non-profit group": "President Obama hands over Twitter page to non-profit group April 8, 2013 By: Roz Zurko Subscribe President Obama's Twitter page is not really his page anymore, although it is made to look as if it is. His name is on it, the official badge is ...", "Twitter's Dorsey endorses parents' solar panel installation": "2 hours ago • By Lisa Brown lbrown@post-dispatch.com 314-340-8127 ST. LOUIS • A brightly burning sun Saturday morning provided ideal conditions for Twitter co-founder and St. Louis native Jack Dorsey to help celebrate the completion of a new ...", "Biz2Credit to Host Last Minute Tax Advice Twitter Party for Small Business Owners on Thursday, April 11, 2013": "Leading Small Business Finance Platform Offers Twitter Event to Help Identify Overlooked Deductions and Secure Financing in Case They Owe Back Taxes Biz2Credit will host a Twitter Party in which small business owners can ask tax advice of experts from the ...", "OWOW TWEET UP: Wrightstown ice cream shop making friends and influencing people through Twitter": "WRIGHTSTOWN - For a chilly March evening, the ice cream parlor sure was crowded. About 40 faithful followers of Wrightstown’s Owowcow’s Twitter page walked through the ice cream shop’s doors, but dessert wasn’t first on their agenda.", "Welcome to jobs day: How soft will it be? - Obama to propose entitlement cuts - Obama budget background - Bloomberg becomes a Twitter machine": "WELCOME TO JOBS DAY: HOW SOFT WILL IT BE? — Recent data from the ADP report to the ISM number suggest job creation probably slowed in March from the strong 236,000 in February. But just how much? If the number goes below 150,000, look for spring swoon ...", "‘BtownNow’ for iPhone corrals local Twitter conversations with one app": "We’ve built a new avenue to reach local information. The BtownNow app for iPhones has launched. It’s a free app that curates Twitter feeds in a number of Bloomington-centric subject areas or categories, and blends them with a schedule of ...", "IRS to collect personal info from Facebook, Twitter": "You have just about a week left to file your taxes -- the deadline is next Monday, April 15. But this year, the IRS will be collecting more than just your money. According to several reports, the agency will also be collecting personal information from ...", "Twitter is making you a poorer investor": "When asked what I read, I always plug Twitter. It is one of the most effective communication devices ever invented, I usually say, with no exaggeration. Twitter has become so important to finance that it is taking over the role of the professional analyst.", "Is It OK to B.S. Your Shareholders on Twitter?": "Tweeting CEOs are often entertaining, but you might want to take their stock tips with a healthy dose of skepticism. Just ask investors who jumped on Elon Musk’s post last week that promised “a really exciting @TeslaMotors announcement.”", "SEC: FB, Twitter as good as a news release": "WASHINGTON, April 3 (UPI) -- Companies may use Facebook and other social media websites to share news, provided they first tell investors which sites they'll use, a U.S. regulator said. \"We do not wish to inhibit the content, form, or forum of ...", "Twitter, Facebook Key To Lifelong, Engaged Customers": "Social media are fun for fans, serious for business. Just look at these numbers: According to a 2011 study by consultancy Bain & Co., customers who are part of a firm's Twitter, Facebook (FB) or other online social fan base spend 20% to 40% more than ..."}, "obama": {"Obama's Twitter page: It's not him, President handed it over to non-profit group": "President Obama hands over Twitter page to non-profit group April 8, 2013 By: Roz Zurko Subscribe President Obama's Twitter page is not really his page anymore, although it is made to look as if it is. His name is on it, the official badge is ...", "DEAR ANDREW: THERE'S THIS GUY NAMED OBAMA": "PANAMA CITY, Panama -- After hosting my own election night party I awoke with a slight hangover, vaguely recalling this dream that a black guy had been elected President of the United States of America. Then I switched on Voice of America news and realized ...", "Obama budget plan would cut deficits – but enough?": "A preliminary sketch of President Obama’s new budget proposal has emerged, and the president is proposing some deficit-reducing entitlement reforms and tax hikes, but not enough to bring the national debt sharply downward. The question is ...", "Fisker Struggles Mark Blow to Obama’s Electric-Car Goal": "The possible bankruptcy of Fisker Automotive Inc., which last week fired three-quarters of its workforce, is the latest blow to President Barack Obama’s goal of having 1 million electric vehicles on U.S. roads by 2015. Fisker’s downfall ...", "Obama budget plan revisits small-bore budget cuts": "WASHINGTON (AP) — Even as it adds fuel to battles over taxes and Social Security, President Barack Obama's budget will reprise lots of smaller bore proposals that have gone nowhere in a gridlocked Washington. Ideas like higher Transportation Security ...", "Obama's 2014 budget to help shape broad US tax debate": "Will anyone stop watching his movies when he is in jail? Answer is 'no'. Then why should we stop ads, asks Mehul Choksi, Gitanjali Grp. The 434-km highway, the only road linking Ladakh with rest of the state, remains closed during winter due to ...", "Hurwitz: Obama policies aren’t producing jobs": "The latest jobs report shows only 88,000 new jobs were created last month. We require over 150,000 new jobs per month just to keep up with population growth, never mind the additional numbers needed to put the jobless back to work. The talking points ...", "Obama to Renew Call to Limit Charitable Deduction": "WASHINGTON—President Obama is expected to renew his call to limit the charitable tax deduction when he releases his 2014 budget plan on Wednesday—a proposal that nonprofits have repeatedly helped defeat. “The President’s proposal, as you know ...", "Judge rules Obama administration overlooked fracking risks in California mineral leases": "The decision, made public on Monday, effectively bars for the time being any drilling on two tracts of land comprising 2,500 acres leased for oil and gas development in 2011 by the Interior Department's Bureau of Land Management in Monterey County.", "Obama's new world order": "It should come as no surprise. During the campaign, he told us he was a \"citizen of the world.\" Last week, he told the cadets at West Point, and the rest of the world, just what his vision of a new world order is. Obama wants a new international order that ...", "Obama revenue raiser targets big IRAs like Romney’s": "President Obama’s latest plan to raise tax revenue from wealthy individuals would pinch tax-favored retirement accounts of some private-equity executives and self-employed professionals by capping them at $3 million. The proposal, to be ...", "Romney’s IRA Obama Target for Revenue With $3 Million Cap": "President Barack Obama’s latest plan to raise tax revenue from wealthy individuals would pinch tax- favored retirement accounts of some private-equity executives and self-employed professionals by capping them at $3 million. The proposal, to ...", "Does Obama seek reform, or does he want an issue?": "Is a bipartisan immigration deal at hand? It's close. The AFL-CIO and the Chamber of Commerce recently worked out a guest-worker compromise that allows in foreign workers on a sliding scale of 20,000 to 200,000, depending on the strength of the ..."}}, "Entertainment": {"television": {"Brooke Wagner returns to Denver television": "It's not taking Brooke Wagner to return to Denver's television screens. Wagner, who left CBS affiliate KCNC in January, has been hired by Fox affiliate KDVR as its new morning co-anchor beginning April 22, mediabistro.com reported Monday.", "Subodh Bhave to return to television": "After a gap of two years, actor Subodh Bhave will be seen on television. The actor who was last seen in the Hindi film Aiyya, opposite Rani Mukerji, will be doing a guest appearance in the Marathi TV show Aaradhana. The last two shows that ...", "5 old but still good paranormal documentary television shows": "In this day and age there are so many true paranormal shows out there and some of them are better than others. There are plenty of TV shows for any paranormal fan to enjoy and that's a good thing either it being reality TV or a drama. Ghosts and other ...", "'The Carrie Diaries' needs a Season 2: Why the 'Sex and the City' prequel is important television and you should be watching": "Listen, America. I can't blame you for not tuning in to \"The Carrie Diaries\" when it first started. Even I, a tried-and-true teen drama lover who cried a bucket of tears when \"One Tree Hill\" ended and still harbors anger issues regarding Rory ...", "Margaret Thatcher: In Movies and Television": "According to Wikipedia, there have been portrayals of Margaret Thatcher in no less than five films and 14 TV shows. We’ve assembled some of the more memorable onscreen depictions. The Queen (2009) The five-episode drama-documentary aired on ...", "LGBT television characters lack quality representation": "At the launch of the 2012-13 television season, GLAAD estimated that lesbian, gay, bisexual and transgender scripted characters comprised 4.4 percent of all scripted series regular characters on the five major broadcast networks: ABC, CBS, the ...", "The Television Event Of The Year Shatters Home Entertainment Records": "LOS ANGELES, April 8, 2013 -- /PRNewswire/ -- The epic miniseries, THE BIBLE, continues its unprecedented success with its home entertainment launch and quickly became the biggest selling TV on DVD in the last 5 years and the biggest miniseries ...", "Why It Is Better to Wait for 4K Television": "The first 4K televisions are hitting the market, prompting the first saps early adopters to break out the plastic – but now is not the right time to buy, whether you can afford to or not. The electronics industry moves in cycles. The latest 4K resolution ...", "Reality-television show to feature Durango couple’s home April 18": "Durango soon will have some TV stars in its midst. Wells Group broker Chelsea Krueger and her buyers, Ryan and Krista Montgomery, will be featured on Home and Garden Television’s hit show “House Hunters” at 8 p.m. April 18. The reality-TV ...", "Michael J. Fox On Returning To Television: ‘I Love To Do This’": "Michael J.Fox is ready to make his big return to television, and says he isn’t going to let Parkinson’s slow him down. The 51-year-old actor is returning this fall to NBC, the network that made him a breakout star with Family Ties and led to ...", "What I Learned From Television: Intelligence lost in scary scenarios": "Imagine you are home alone and in the middle of the night you hear a loud noise in your basement that wakes you up. You hear another noise. Naturally, you’re going to check it out even if you’re scared. Imagine you get down there and you ...", "Trailer for EVOCATEUR: THE MORTON DOWNEY JR. MOVIE, Documentary on the Father of Trash Television": "Magnolia Pictures has released a trailer for the upcoming documentary Evocateur: The Morton Downey Jr. Movie, which focuses on the career and show of the late, controversial 1980’s talk show host Morton Downey Jr., considered by many to be the ...", "Roger Ebert: Television made him the world’s most famous film critic": "Roger Ebert was the world’s most famous film critic, thanks to television. The many incarnations of his movie-review TV show — a format he fathered nearly 40 years ago along with fellow critic Gene Siskel — made him a celebrity in his own right."}, "google": {"Google Doodle honours naturalist-artist Maria Sibylla Merian": "Today’s Google Doodle of leaves, lizard and bugs celebrates the 366th birthday of Maria Sibylla Merian, the German naturalist and artist who made significant contributions to the field of entomology. She was born in Frankfurt into a Swiss ...", "Arthur Frommer takes brand back from Google, will keep guidebooks going": "The tale of Google and Frommer's famed travel guides has taken another twist this evening. Associated Press writer Beth Harpaz reports Arthur Frommer confirmed over the phone that he has retaken control of the brand from Google, and plans to ...", "Canada Council Art Bank joins the Google Art Project": "OTTAWA — The Canada Council Art Bank has joined the Google Art Project, an online platform that gives free public access to the world’s top museums and art collections. “It’s all about accessibility,” said art bank director Victoria Henry.", "Google + Hangout welcomes Yo-Yo Ma, Guns N' Roses drummer, New York ballet dancer to talk about arts": "GRAND RAPIDS, MI – What could cellist Yo-Yo Ma, Guns N’ Roses drummer Matt Sorem and ballet dancer Damian Woetzel possibly have in common? A passion for the arts that they’ll share in a Google+ Hangout on Tuesday. Americans for the Arts declared ...", "Fox And Universal Ask Google To Remove Takedown Notices That Reveal Locations Of Pirate Sites": "RT @Phil_on_Film: Thinking of Werner Herzog this morning, who has lost two great friends, Roger Ebert and Les Blank, in a matter of days. RT @BretEastonEllis: As a gay writer who believes in free speech I find this ridiculous: Amy Pascal Says ...", "Beauty in the details: artist turns Google Maps into gorgeous Persian rugs": "The carefully overlaid images of our world on Google Maps is an impressive sight even on the dullest computer screen, but one artist has taken Google’s documentation of Earth one step further … and the results are breathtaking. Dublin-based ...", "Arthur Frommer gets Frommer brand back from Google": "NEW YORK (AP) — Travel guru Arthur Frommer said Wednesday that he has reacquired rights to his travel guidebook brand from Google, and that he intends to resume publishing Frommer guidebooks. Google acquired the Frommer brand last summer from ...", "Google Maps Reinterpreted as Intricate Persian Rugs are Beautifully Complex": "Sometimes, Google Maps throws up some striking imagery—and now David Thomas Smith has seized on some of the more striking elements to create a series of artworks that combine satellite images with inspiration from traditional Persian rug-making.", "Google doodles naturalist Maria Sibylla Merian's 366th birthday": "Celebrating the 366th birthday of naturalist and scientific illustrator Maria Sibylla Merian, Google has posted a doodle on its homepage. The doodle features caterpillars, chrysalises, moths, butterflies and a green iguana in conjunction with ...", "Maria Sibylla Merian turns 366 — Google celebrates by letting insects invade its logo": "Maria Sibylla Merian changed the insect world with her illustrations — and she started when she was just 13. Her youthful passion grew into a study of insects that would centuries later become the foundation for taxonomy. Instead of studying ...", "Meet Google Local’s Savviest Soho-ers": "Way back in March (remember March?!) we asked you if you considered yourself Soho Savvy and if so, to prove it to us by writing up reviews of the hippest, hoppest, most happening places in the West End area. And you did prove it to us. Through a sheer love ...", "Maria Sibylla Merian, Naturalist And Artist, Celebrated With A Google Doodle": "Today, Google celebrated artist and naturalist Maria Sibylla Merian's 366th birthday the only way it knows how: a Google Doodle. A trailblazer, Merian and her daughter Dorothea traveled together (without a male companion) to Suriname in South ...", "April Fools: YouTube shut down, Google adds smells": "NEW YORK (AP) -- Twitter did away with vowels, Google unveiled a button to add smells and the cast of the 1990s sitcom \"Wings\" launched a Kickstarter campaign. The digital world celebrated April Fools' Day with the rollout of mock innovations and parody ..."}, "congress": {"Beyoncé And Jay-Z Cuba Trip Prompts GOP Congress Questions Over Legality": "Beyoncé and husband Jay-Z are celebrating the fifth anniversary of their April 4, 2008 wedding in Havana, Cuba. Mr. and Mrs. Carter, reigning King and Queen of hip-hop and R&B and parents of Blue Ivy Carter, have caused quite a stir in the ...", "KC & The Sunshine Band's \"Boogie Shoes\" Added to Library of Congress": "KC & the Sunshine Band's popular disco classic \"Boogie Shoes,\" along with the entire Saturday Night Fever soundtrack, is among the 2012 inductees to the National Recording Registry of the Library of Congress. The Library's National Recording ...", "NCUI gets Prez nod for Cooperative Congress": "National Cooperative Union of India is finally ready to host International Cooperative Congress as a grand finale to the International Year of Cooperative declared by the United Nations earlier. The President of India Shri Pranab Mukerjee has consented to ...", "Jay-Z and Beyonce's Cuba Trip Has Congress Members Angry and the Government Investigating": "Jay-Z and Beyonce's island tour has them in hot water. The most famous celebrity couple in America visited the nation's longtime rival, the impoverished island state of Cuba, to celebrate their fifth anniversary last week. The trip included sightseeing ...", "Director explains Library of Congress’ importance": "WOODSTOCK – John Y. Cole, a historian at the Library of Congress and founding director of its Center for the Book, will visit the Woodstock Opera House on April 18 to talk about the key role the library plays in American government ...", "Robert Walter's 20th Congress Returns With Get They Bearings": "Robert Walter performs all his own stunts. For 20 years, the San Diego native has been pulling drawbars and pushing the limits of the Hammond B3 organ. As a founding member of the Greyboy Allstars, he helped usher in the funk-jazz renaissance of ...", "HISTORY LESSON: Woodrow Wilson asks Congress to declare war on Germany, Several thousand troops from Argentina seized Falkland Islands": "Today is Tuesday, April 2, the 92nd day of 2013. There are 273 days left in the year. On this date: In 1513, Spanish explorer Juan Ponce de Leon and his expedition landed in present-day Florida. (Some historians say the landing actually occurred ...", "Cloud Security Alliance Seeking Speakers for Us Congress 2013 in Orlando": "Mis Training Institute and Cloud Security Alliance Open Call for Papers for Fourth Annual Csa Congress Us, Held November 13-14th in Orlando, FL MIS Training Institute and the Cloud Security Alliance are looking for seasoned speakers to present at the 4th ...", "Guadeloupe to host third International Congress of Caribbean Writers": "AIE-MAHAULT, Guadeloupe - The third International Congress of Caribbean Writers will take place at the Langley Resort Fort Royal in Deshaies, Guadeloupe, French West Indies, from April 10 to 13, 2013. Held under the theme \"Our Fight for Freedom ...", "Congress denies WikiLeaks report on Rajiv Gandhi": "Will anyone stop watching his movies when he is in jail? Answer is 'no'. Then why should we stop ads, asks Mehul Choksi, Gitanjali Grp. NEW DELHI: Congress has trashed reports that alleged Rajiv Gandhi may have been the main negotiator for a Swedish ...", "Roger Ebert To Congress: Movies Are Not The Cause Of Violence In America": "Roger Ebert's big personality and impassioned stances on film never waned throughout his decades-long career, including the time he and fellow movie critic Gene Siskel took Congress to task The C-SPAN clip shows the famous duo discussing the ...", "The Congress has lost the capacity to reinvent itself": "Mamata Banerjee might be unfairly pilloried for the death of student activist, Sudipto Gupta, that could well be an accident. But Didi’s problem is of her own making. She is caught in her own trap. From anecdotes to scandals, from rare pictures to behind ...", "Heights Community Congress sponsors civil-rights documentary and other Cleveland Heights news: Weekly recap": "CLEVELAND HEIGHTS -- An announcement that the Heights Community Congress is sponsoring a Civil Rights-era documentary at the Cleveland International Film Festival was one story showing up last week on the Cleveland Heights blog of the cleveland.com web site."}, "senate": {"Ashley Judd won't run for Senate; The Duggars consider adoption: more entertainment news (links)": "Ashley Judd decides against a Senate run, rapper Gucci Mane gets arrested for assault and the Duggars consider adoption. We have these stories and more in today’s entertainment news from around the web. Well, it looks like Ashley Judd won’t ...", "I’m glad Ashley Judd is not running for Senate": "This video is playable across all supported devices. Let me finish tonight with this. Mitch McConnell deserves a lot of things for his performance these past years—for setting as his top priority the destruction of a presidency, for conniving ...", "Covered at Reason 24/7: Ashley Judd Not Running for Senate in Kentucky": "Ashley Judd, the Hollywood movie star and eighth-generation Kentuckian, has decided not to launch a star-studded campaign to unseat Senate Minority Leader Mitch McConnell. Judd made her announcement via Twitter Wednesday afternoon. No word yet ...", "Ramaswamy Arts Council Nomination Sent to U.S. Senate": "Indian American dancer and educator Ranee Ramaswamy, who was nominated by President Barack Obama last July to serve on America’s prestigious National Council of the Arts for a five-year term, had her nomination sent to the U.S. Senate for confirmation ...", "Notable people: Actress Judd will not run for US Senate": "FRANKFORT, Ky. — Actress Ashley Judd announced Wednesday she won’t run for U.S. Senate in Kentucky against Republican Leader Mitch McConnell, saying she had given serious thought to a campaign but decided her responsibilities and energy need to be ...", "Student Senate swears in new president": "I recall flipping through the channels when I was a kid and stumbling upon a movie that featured my favorite creatures: dinosaurs. I was in awe of the mesmerizing special effects and the fast-paced action had my adrenaline pumping for its two-hour duration.", "France's senate takes up gay marriage debate": "PARIS (AP) -- France's upper house of parliament has begun debating a bill to legalize gay marriage and allow same-sex couples to adopt children, weeks after the divisive reform was passed in the lower house. The senate debate is scheduled to last until ...", "U.S. Senate debate at UMass Lowell, April 8": "LOWELL — Candidates seeking to fill the U.S. Senate seat representing Massachusetts will debate at UMass Lowell on Monday, April 8. The candidates in the Democratic primary — U.S. Rep. Stephen Lynch and U.S. Rep. Edward Markey — will debate starting ...", "Ashley Judd Was ‘Pushed Out’ Of Senate Race By Democrats [Report]": "According to Ashley Judd, her potential Senate run was put on the back burner because she wants to concentrate on her family. According to an Ashley Judd adviser, a group of Kentucky Democrats are to blame for intentionally pushing Judd out of ...", "Ashley Judd Says She's 'Regretfully' Not Running for Senate": "Because of dicks, I bet. I BET IT'S BECAUSE OF YOU DICKS. I don't mean you, specifically, Jezebel readers. But can you imagine running for office? As a woman? Like, it's bad enough just being a lady-blogger or a cute hamster on YouTube or even some rando ...", "Ashley Judd says she's not running for Senate after all": "Ashley Judd announced Wednesday that she would not be running for Senate next year against Minority Leader Sen. Mitch McConnell (R-Ky). \"After serious and thorough contemplation, I realize that my responsibilities & energy at this time need to ...", "Ashley Judd To Focus On Family, Won't Run For Senate Seat": "After months of speculation about a potential move into politics, actress Ashley Judd has decided not to run for a seat in the U.S. Senate. In recent months Judd emerged as a favorite Democratic Party candidate to challenge Republican Mitch ...", "Entertainment: Ashley Judd not running for Senate": "(NECN) - Actress Ashley Judd says she will not run for senate. Judd says she gave serious thought to the run for the Kentucky senate seat but decided she needed to focus on her family. She made the announcement on Twitter. The LA County District Attorney ..."}, "bing": {"Bada bing sausage burger wins contest": "Chef Mike Jurusz, owner of Chef Mike’s ABG in South Seaside Park, recaptured the top honor at the “Great Jersey Shore Burger Contest” with his Bada Bing Sausage Burger. The contest, coordinated by the organizers of Jersey Shore Restaurant ...", "Annette Funicello Dead: Former 'Mickey Mouse Club' Star Dies At 70": "In the early 1960s Funicello starred in a series of \"Beach Party\" movies co-starring Frankie Avalon, that included \"Beach Party,\" \"Muscle Beach Party,\" \"Pajama Beach Party,\" \"Beach Blanket Bing\" and \"How to Stuff a Wild Bikini.\" Funicello was ...", "Bada Bing: Jersey Boys Restore Some Common Sense to Copyright Fair Use": "Forty years after Frankie Valli and the Four Seasons appeared on \"The Ed Sullivan Show,\" Sullivan first appeared, albeit involuntarily and briefly, in the Tony Award-winning musical about the Four Seasons, \"Jersey Boys.\" At the end of the first act, the ...", "Glenn Miller and Bing Crosby on this week's Star Spangled Radio Hour (Photos)": "Spring may be just around the corner, hopefully, and an early Easter is upon us. To welcome April and to clear out the winter cobwebs, the Star Spangled Radio Hour will celebrate Easter weekend with two April 1 broadcasts from 1943 and 1944, presented by ...", "Little Rock, the Heart of Arkansas": "There are numerous listening stations and videos that bing the events to life. Tours to walk the path the Little Rock 9 took and to view the interior of Central HS can be reserved here. www.nps.gov/chsc Two ex-slaves, John Bush and Chester Keats ...", "SWA Group with Bing Thom Architects and Ronald Lu & Partners Designing a new Gateway to West Kowloon Cultural District, Hong Kong": "SAUSALITO, Calif. & HONG KONG, Mar 27, 2013 (BUSINESS WIRE) -- Working in conjunction with leading Canadian Architect Bing Thom, SWA Group and the design team are working on the first building and gateway to one of the world's largest cultural ...", "Bing Harris on High": "Bing, Harris and Co, a heritage brand established in Dunedin in the mid-1850s and last year relaunched as a stylish and affordable men's fashion brand, has opened a new High St store and launched their Autumn/Winter 2013 collection simultaneously.", "TGIF Series to resume at the Westfield Library, April 26": "He will revisit some of the greatest singers from the 1920’s to the 1950’s, including Al Jolson, Bing Crosby, Frank Sinatra, Ella Fitzgerald, Rosemary Clooney, Billie Holiday, Dick Haymes and many more. These events are free and open to the public.", "Roger Ebert Gets ‘Thumbs Up’ at Funeral": "(CNN) — Roger Ebert got a final “thumbs up” as family, friends and filmmakers eulogized the movie critic at his funeral in Chicago on Monday. Hundreds gathered inside Chicago’s Holy Name Cathedral, but many more watched the live telecast of the ...", "Watch: Lianne La Havas Performs in the Bing Lounge at Portland's KINK FM": "Lianne La Havas kicked off her month-long North American tour last week with a St. Patrick's Day performance at the House of Blues in Dallas, followed by sold-out shows in Los Angeles, San Francisco, and Seattle and her final West Coast sets in ...", "Book review: Daphne du Maurier and Her Sisters: The Hidden Lives of Piffy, Bird and Bing": "Daphne du Maurier, the great mistress of narrative pace, becomes the subject of laboured passages that take undue interest in her two sisters Jane Dunn’s biography of Daphne du Maurier (aka “Bing”) and her sisters, Angela (“Piffy”) and Jeanne ...", "Emma Watson Tattoo Spotted For GQ Magazine Is Fake! Merely Disguise For ‘The Bing Ring’ Character [VIDEO]": "Emma Waston's tattoo that made headlines on the cover of British GQ is gaining attention again as it turns out, the apparent ink isn't permanent. The actress sported the temporary tat on her right hip is for her to begin transforming into the ...", "Ebert remembered at Chicago funeral as a visionary": "CHICAGO – Acclaimed film critic Roger Ebert was praised Monday as a consummate Chicago newsman, a champion of storytellers and a visionary who understood the power of social media to spread the word about everything from good movies to his ..."}, "beyonce": {"I'm Sick of Pretending: I Don't \"Get\" Beyoncé": "I don't think I can do it anymore, guys. I have been living a lie. As a gay man with a lot of gay friends, I'd estimate that roughly 30 percent of my conversations are related to Beyoncé in some way. I went to Christmas parties where the only album played ...", "Beyonce Named Met Gala Chair": "The ultra-fashionable \"Single Ladies\" singer will serve as the honorary chair to the event that is known as the Oscars of the fashion industry. Beyonce continues to run 2013. The R&B superstar will act as honorary chair at this year's Costume ...", "Kelly Rowland taps Beyoncé and Michelle Williams for ‘Talk A Good Game’": "There may be yet another round of the Destiny’s Child 2013 reunion, and Kelly Rowland will be taking center stage! The Kisses Down Low singer shared some exciting details about her upcoming album Talk A Good Game with Billboard. For starters, Kelly told ...", "Treasury OK'd Beyonce and Jay-Z's Cuba Trip, Source Says": "AP Photo/Ramon EspinosaU.S. singer Beyonce and her husband, rapper Jay-Z, are surrounded by body guards as they tour Old Havana where a street performer on stilts looks on, right, in Cuba, Thursday, April 4, 2013. R&B's power couple is in Havana ...", "Kelly Rowland confirms new album will feature track with Beyonce and Michelle Williams": "Kelly Rowland is teaming up with her former Destiny’s Child bandmates for a track on her upcoming album, Talk A Good Game, Universal’s Republic Records has confirmed. “It’s not a Destiny’s Child track, it’s me featuring Beyoncé and ...", "Beyonce & Jay-Z's Trip Okd by US; Roc Nation Partners with Universal Music": "All they wanted to do was go on a nice get away to celebrate their anniversary, but Beyonce and Jay-Z didn’t know how much controversy their trip would stir up. Married for five years, the musical couple spent last week relaxing and sight-seeing, in ...", "Beyoncé Reveals Her Style Icons, Met Gala Gig": "Beyoncé attends the 2012 Met Gala (Getty Images) There's busy, and then there's Beyoncé. The pop star is reaching the stratosphere of overachievement, as Monday brought news of an esteemed new job for the entertainer, wife, and mom. Bey will ...", "Beyonce got 'crazy fat'": "Beyonce felt ''crazy fat'' during her pregnancy. The 'Irreplaceable' singer - who has 15-month old daughter Blue Ivy with husband Jay-Z - gained a large amount of weight when she was carrying the little girl, but she insists she en ... All they wanted to ...", "Destiny's Child Reunite For One-Off Kelly Rowland Track: Beyonce, Michelle Williams Join Rowland On New Album \"Talk A Good Game\"": "Hold on to your butts, Destiny's Child fans. Kelly Rowland, Beyonce Knowles-Carter and Michelle Williams have re-united for a one-off track for Kelly Rowland's new album Talk A Good Game, according to an interview Rowland gave to Billboard.", "Exclusive : Beyonce, Jay-Z visited Cuba with Treasury Department OK - source": "MIAMI (Reuters) - A visit by American pop star Beyonce and rapper husband Jay-Z to Havana last week was a cultural trip that was fully licensed by the U.S. Treasury Department, a source familiar with the itinerary said on Monday. The longstanding U.S ...", "Jay-Z and Beyonce's Cuba trip may be legal, but they still might face sanction trouble": "From El Nuevo Herald's Juan Tamayo: Superstar couple Beyoncé and Jay Z will likely claim that they had a legal permit for their controversial trip to Cuba, but they and their retinue might still face trouble with the complex U.S. sanctions on ...", "Beyonce, Jay-Z visited Cuba with Treasury Department OK": "A visit by American pop star Beyonce and rapper husband Jay-Z to Havana last week was a cultural trip that was fully licensed by the U.S. Treasury Department, a source familiar with the itinerary said on ... All they wanted to do was go on a nice get away ...", "Beyonce pays tribute to mother": "The 31-year-old cited her mother as the most influential female in her life. (AP) R&B star Beyonce has paid tribute to her mother Tina Knowles in a new video for Chime for Change, fashion label Gucci's global campaign for women's empowerment. The 31-year ..."}, "yahoo": {"Fall Out Boy to visit Madison with Yahoo on the Road": "The dish blends one of the heartiest of winter pastas — potato gnocchi — with asparagus, a light vegetable that has come to represent one of t… This week’s recipe, submitted by Cecy Haines of Sauk City, won the State Journal’s first grand prize ...", "Jessie Ware, Katy B, Magnetic Man and MORE added to Yahoo! Wireless Festival Sunday line-up": "As if we weren't already excited enough about Yahoo! Wireless Festival *cough* JT *cough* Jay-Z, a whole load of new acts have been announced today. Jessie Ware has been added to the Yahoo! Wireless Sunday line-up. Copyight [Rex] We can reveal that Jessie ...", "Yahoo! Wireless 2013 Adds Jessie Ware, Katy B And Many More.": "Live Nation are excited to announce that more fantastic acts have been confirmed to join Justin Timberlake and Jay Z at the world premiere of their Legends Of The Summer tour at Yahoo! Wireless Festival on Sunday 14 July. Jessie Ware, Katy B, Magnetic Man ...", "Blog Posts by Lylah M. Alphonse, Senior Editor, Yahoo! Shine": "But instead of escaping from the Nazis, whom she despised, she had practically stumbled right into the heart of Hitler's Eastern Front headquarters, known as the Wolf's Lair. His soldiers found her immediately. Also on Shine: How to Survive a Traveling ...", "Yahoo Adds Summly News Aggregator To Its List Of Acquisitions": "Yahoo! has just announced that it is buying Summly, the mobile news aggregator created by a British teen last year. Summly has been withdrawn from the App Store. According to the Yahoo! presser: \"Nick and the Summly team are joining Yahoo!", "Jessica Sanchez: ‘Glee’ Star Performs “Tonight” At Yahoo Acoustic Session [WATCH]: ‘American Idol’ Alum Talks New Album [NEWS UPDATE]": "Soon-to-be Glee star and American Idol season 11 runner-up Jessica Sanchez dropped by the Yahoo! Music headquarters for a very special unplugged performance of her debut single “Tonight” off of her new album, “Me, You & The Music.” The acoustic set ...", "17-year-old Sells App to Yahoo! for $30 Million": "LONDON (WKBW) - 17-year-old Nick D'Aloisio has been developing apps since he was 12, and came up with an app at his home in London two years ago, which he just sold to Yahoo! for a huge price tag. D'Aloisio created Summly, a mobile app that searches for ...", "Yahoo! Music": "The teen movie queen grows up and puts her own spin on the 'Breakfast Club' theme. FILE - This May 8, 2009 file photo shows members of New Kids on the Block, from left, Joey McIntyre, Donnie Wahlberg, Jonathan Knight, Jordan Knight, and Danny Wood on the ...", "Yahoo! Movies Review: Chashme Baddoor": "Chashme BaddoorCast: Ali Zafar, Siddharth, Taapsee Pannu, Divyendu Sharma ‘Chashme Baddoor’ is exactly like any other film David Dhawan film, it is a good time pass. There is no clever humour but there is enough comedy to assure a few genuine laughs.", "Yahoo! TV Blogs": "It has been nearly two years since pint-size powerhouse Vicci Martinez made it to the Season 1 finale of \"The Voice,\" and almost a year since she released her post-\"Voice\" album, Vicci. But happily, that album's first single, \"Come Along\" featuring her old ...", "Katy B, Jessie Ware for Yahoo! Wireless festival": "Yahoo! Wireless, which takes place on July 12 - 14 at the Queen Elizabeth Olympic Park, is headlined by Justin Timberlake and Jay-Z, who will be giving a preview of their upcoming joint North American stadium tour. They will be joined by previously ...", "Yahoo! Movie Blogs": "Superman in NetherRealm Studios' 'Injustice: Gods Among Us' Universal Pictures' 'Jurassic Park' 1993 was a banner year in pop culture: \"The Mighty Morphin Power Rangers\" first powered up, Prince became the artist formerly known as Prince, and most ...", "Yahoo! Wireless Sunday adds Jessie Ware, Katy B and many more!": "Watch // Jessie Ware - \"Night Light\" British songstress Jessie Ware will be bringing her soulful voice to the Queen Elizabeth Olympic Park for her Yahoo! Wireless Festival debut. The singer songwriter released her stunning debut album – Devotion – to ..."}, "movies": {"[Movies] Summit Begins Shooting Divergent": "Sci-fi film is now in production... Summit Entertainment has announced that they have begun principal photography in Chicago for Divergent. The science fiction film stars Shailene Woodley, Theo James, Kate Winslet, Ray Stevenson, Mekhi Phifer, Maggie Q ...", "Beyond movies, Ebert’s passing was ... A Lesson in Dying": "Roger Ebert was a hot trend on Google’s top 10 trends earlier this week. As of Wednesday, more than 50,000 people had searched for his name, an impressive display of his influence. He wasn’t quite as hot as North Korea or Jay Leno, but he was running ...", "Wisconsin Film Festival is set to bring top movies to Madison again": "This year marks the Wisconsin Film Festival’s 15th stint in Madison, with more than 150 films being presented over the course of eight days. In an introduction on the website, festival programmers Mike King and Jim Healy state that there will be ...", "Kelly Clarkson Lands No. 9 Spot on IMDB's Worst Movies of All Time": "Kelly Clarkson may be one of the highest selling artists from \"American Idol,\" but she's also the star of one of the worst movies ever made, \"From Justin to Kelly.\" At least according to IMDb readers, anyway. The musical rom-com was ranked by ...", "5 worst movies ever made in Utah": "SALT LAKE CITY — Last week, we looked at five of the best movies ever made in Utah. Classics like “Footloose,” “The Searchers” and “The Outlaw Josey Wales” all made the list. Unfortunately, Utah is also connected to some of history’s ...", "Steinberg: Reviewing movies was the least of it": "In the end, the movies weren’t the most important part. Oh, being a film critic certainly made Roger Ebert a rich, famous, influential man. But — and as with all good surprise endings, I didn’t see this coming — when his loved ones, his ...", "[Movies] Jessica Lucas Signs On For Pompeii": "Evil Dead star joining the period disaster flick... Jessica Lucas (Evil Dead) has signed on to join the cast of Pompeii. Deadline reports that Lucas is joining Emily Browning, Kit Harington, Jared Harris, Adewale Akinnuoye-Agbaje and Kiefer Sutherland in ...", "10 Comic Book Villains That Deserve To Be In Movies": "In 2012, superheroes dominated the box office, claiming both the highest and third highest grossing films. More than ten Hollywood blockbusters based on superheroes are slated for release in 2013, with plenty more to come in 2014 and 2015. It has been said ...", "Roger Ebert made us love the movies (Video)": "I think we all knew that the end was near for Chicago Sun Times film critic Roger Ebert when he announced to the world that his cancer had returned. In his blog entitled “A Leave of Presence” which was published just a couple of days before ...", "Margaret Thatcher and the Movies": "Former British prime minister Margaret Thatcher, who died Monday at 87, had a much greater impact on the world of film than just inspiring an Oscar-winning role for Meryl Streep in 2011's \"The Iron Lady.\" The woman who led Great Britain from ...", "Superhero Movies Assemble!": "Superhero movies have quickly went from a niche market to the most successful films in the world. In 2012 there were five big superhero movies, excluding the comic book inspired Men in Black III and straight-to-dvd releases like Punisher: Dirty Laundry.", "Celtic Media Centre brings big budget movies to Baton Rouge": "Off an unimpressive stretch of Bluebonnet Boulevard, across the street from an old Coca-Cola factory steadily transforming into a Big Lots, Baton Rouge’s best kept secret is making magic. Though most Baton Rouge residents have never heard of ...", "From yoga, to computer skills, to movies, adult events fill library calendar": "Adults of all ages will find plenty to do at the library this month thanks to a bounty of springtime programs being offered by the Burlington County Library System. Check out all the programs for adults being offered in April: All programs are ..."}, "amazon": {"New Image from Amazon's Zombieland Needs Oral Adhesive": "The main thing that sucks about being an elderly zombie? Unless you have your teeth, you're gonna have to gum your human flesh food. If you're lucky enough to have croaked with your dentures in, as you'll see in this new still from \"Zombieland,\" the bond ...", "An Amazon for adventurers": "I awoke to see the Amazon Basin, the source of a fifth of the world's fresh water and oxygen, as a vast breadth of brown water lined with an unbroken canopy of leaves, veils of thick vines, patches of coconut palms and the wood huts of the Indians who live ...", "'Real Love' tops Amazon.com within days of release": "Within days of its release, \"The Real Love: The Complete Book, Lyrics and Sheet Music of the Musical\" reached #1 on Amazon.com's Best Sellers lists in both the Books and Poetry categories. The Real Love was inspired by the extraordinary, true love story ...", "How to Buy Netflix’s “House of Cards” on Amazon": "Perhaps you’ve heard that Netflix is showing “House of Cards,” a new TV series starring Kevin Spacey. But maybe you don’t have an $8-a-month Netflix subscription, or don’t want to try the service’s free one-month trial. Or maybe you ...", "Authors Guild head blasts Amazon buy of Goodreads": "March 29, 2013 | NEW YORK (AP) Authors Guild president and best-selling novelist Scott Turow is condemning Amazon.com's purchase of Goodreads, a leading book recommendation website. In a statement posted Friday on the Guild home page, Turow ...", "First Look: See the zombies invading Amazon's new 'Zombieland' pilot": "You already got a glimpse at the apocalyptic survivors in Amazon’s new Zombieland pilot, now we’ve got your first look at the zombies out to get them. In the still above, Columbus (Tyler Ross) and Wichita (Maiara Walsh) try to avoid getting ...", "Amazon Blu-ray Deal of the Week: Jurassic Park and G.I. Joe Renegades": "Amazon's Blu-ray Gold Box Deals of the Week affect the limited edition Jurassic Park Ultimate Trilogy gift set and the first season of G.I. Joe Renegades. Based on Michael Crichton's best-selling novel, director Steven Spielberg's 1993 blockbuster Jurassic ...", "The third book in series is now available exclusively on Amazon Kindle": "Those of us following neighbor, Elaine Macko 's books are excited to hear about the next release in the series, Flossed. Who would take their sister on their honeymoon? Alex Harris Van der Burg does! Instead of having a romantic get-away trip ...", "The Real Love: #1 Bestselling Book on Amazon.com": "LOS ANGELES, April 5, 2013 /PRNewswire-iReach/ -- Within days of its release, The Real Love: The Complete Book, Lyrics and Sheet Music of the Musical reached #1 on Amazon.com's Best Sellers lists in both the Books and Poetry categories.", "Free E-Book Download April 12, 13, 14, IT AIN’T FINE IF IT DON’T RHYME” Amazon.com": "A 190 page, eclectic collection of lyrics written over the past 50 years by Toronto & New York songwriter, Andy Halmay, will be available for free downloads on April 12, 13, and 14 on amazon.com in all countries. The lyrics and lead sheets in IT AIN’T ...", "Disney Infinity Character Pre-Orders Now Available at Amazon": "The sun is out, everyone’s back from their Disney-related spring break, and now is the time to leverage that excitement by pre-ordering your Disney Infinity characters from Amazon. I’ll be the first to admit my massive man-crush on all things Disney ...", "No availability date yet, but Amazon is taking advance orders for DVDs and Blu-ray Discs": "The most recent series (season) of the re-launched legendary show has just begun airing its second half, and the BBC has already released or scheduled upcoming half-season sets of it in DVD and Blu formats. Now Amazon.com has begun taking pre-orders for ...", "Fast and Furious: Showdown Box Art, Price, Release Date, and Game Details Listed by Amazon": "Still unannounced by Activision, but already having an ESRB rating that tells us a lot about the game, Fast and Furious: Showdown (dropping two ‘the’s’ from the title) has received a listing on Amazon.com. Given a price of $39.99 and a May ..."}, "music": {"The 2012 cheating award for music goes to rap": "Carrie Underwood’s 2005 country anthem “Before He Cheats” not only brought new life to karaoke bars nationwide, but also gave female victims of cheating justification for taking a baseball bat to their former partners’ vehicles.", "Sony acquires Mariyaan music rights": "Sony Music has acquired the music rights of Dhanush starrer Maryiaan, directed by Bharat Bala. The teasers of Mariyaan, featuring Dhanush and Parvathi Menon in the lead roles, has already created a lot of buzz in the industry. AR Rahman is ...", "SXSW Music Festival 2013—Part 1": "Now in its 27th year, South by Southwest (SXSW) in Austin, Texas has grown from a local independent music showcase attracting some 700 registered attendees in 1987 into one of the largest music festivals in the world, funded by a slew of ...", "R&B Singer Jessie Ware Releases New Music Video": "Rising R&B singer songwriter Jessie Ware is gearing up to release her debut album \"Devotion\" in North America. That version, which drops April 16, has two new tracks; a remix of hit single \"Wildest Moments,\" featuring pretty boy rapper A$AP Rocky, and the ...", "New music roundup: Sarah Borello, Amanda Palmer, Vampire Weekend, Queens of the Stone Age, Brad Paisley": "There's been rather a lot of ink spilled about indie music queen Amanda Palmer's show with her novelist husband, Neil Gaiman, Saturday at Bard College in New York. And deservedly so … I was there, and it was a terribly engaging three hours-odd ...", "Jay Z bringing music festival back to Philly Aug. 31-Sept. 1": "PHILADELPHIA (AP) — Jay-Z is bringing the \"Made in America\" music festival back to Philadelphia. The rapper posted a teaser video on his \"Life and Times\" website Monday that showed footage from last year. It says this year's festival will ...", "Russian Music from Hvorostovsky": "Aside from producing a glorious sound, Hvorostovsky becomes fully immersed in the mood of each song. NEW YORK—As he demonstrated recently in “Don Carlo” at the Metropolitan Opera, Dmitri Hvorostovsky is one of the world’s leading Verdi ...", "Radio Arts Foundation officially brings classical music back to FM": "CLAYTON • The crowd milling around the lobby of Centene Plaza ﻿Monday morning was in a cheerful mood. No wonder: They were there for an official ribbon-cutting for the Radio Arts Foundation’s new station. After years of planning and work, classical ...", "Gospel Music Tuesday: Brooklyn Tabernacle Choir, Pastor Charles Jenkins and more (Photos)": "The new releases for Tuesday, April 9 include a celebrated choir with their first album in five years, the remix of a Grammy-winning song and a compilation of gospel songs. Here are Tuesday's new releases. “Top 25 Gospel Songs 2013”- Various.", "Grateful for classical music stations": "It was recently reported that an additional classical music radio station will soon go on the air in our area. Having two stations once again is a bonus and one befitting a city with a great musical heritage, represented prominently, of course, by the ...", "AASHIQUI 2 team at film's music and first look launch": "Event: Bollywood celebs like Aditya Roy Kapur, Shraddha Kapoor, filmmaker Mahesh Bhatt, Mukesh Bhatt, Vishesh Bhatt, T-series head honcho Bhushan Kumar along with wife Divya Kumar Khosla and son Ruhaan Kumar, Kishan Kumar, Tulsi Kumar, director ...", "NETPod: Listen to Patra’s new single ‘Sweet Reggae music’": "Hey where has Patra been?! Before fading off the scene, the sexy dancehall cat was one of the biggest crossover acts in the US, dropping hits like ‘Romantic call’, ‘Pull up to my bumper’ and ‘Worker man’. She’s coming back now, with a new ...", "Local musician explores the art of music": "Ever since his grandfather gave him his first guitar in the sixth grade, Chance Bridges, junior in electrical engineering, hasn’t stopped playing and recording music. Three years ago, Bridges launched his own musical project called Balcony View, and ..."}, "bieber": {"Drake Bell Started the Most Hilarious War With Justin Bieber's Fans": "Drake Bell , who is famous for being on such wonderful Nickelodeon shows as \"Drake and Josh\" and \"The Amanda Show,\" has been on Twitter for the past few days, just tweeting things harmless little tweets about Justin ... — _fuckmebiebs_ 20 sec ago.", "Bieber's monkey business": "Justin Bieber is feeling the heat from animal activists as his pet monkey currently sits locked in a shelter in Germany. Bieber's capuchin monkey Mally was taken from the pop star weeks ago as he touched down in Germany. Apparently Bieber didn't ...", "Selena Gomez’s New Music Isn’t ALL About Justin Bieber! So Who Is It About?!": "That might actually be a bigger burn! Selena Gomez might be dropping new music just months after her split with Justin Bieber, but that doesn’t mean her lyrics are a message about her ex. In fact, some lyrics from her latest release, Come ...", "Drake Bell Slams Justin Bieber, Labels Fans \"Insane\"": "Drake Bell has gone ahead and done it this time. The former Nickelodeon star has apparently let his role on Splash go to his head, as he took to Twitter over the weekend and positively laid into Justin Bieber. \"Justin Bieber is 5'6\" now I understand why ...", "Justin Bieber Cuts His Hair! Check Out His New, Shaved Look!": "Breaking news: Justin Bieber got a haircut. The 19-year-old pop star—who has been under some scrutiny as of late—showed off a new style while posing for pics with fans. The new fresh look feels reminiscent of his shaggy 'do back in his \"Baby ...", "Justin Bieber “The Real Change Project: Artists For Education”": "Justin Bieber is one of the artists who will be a part of the upcoming TV special “The Real Change Project: Artists For Education.” The special will air on CBS on April 23, 2013. “The Real Change Project: Artists For Education” will ...", "Selena Gomez - Selena Gomez: 'New Song Is Not About Justin Bieber'": "The actress/singer, who recently met up with her ex at her home in California during a break on his European tour, has sparked rumours the love affair isn't over yet in the words to new tune Come & Get It, singing, \"I love you too much, much to hide you ...", "justin bieber haircut": "Justin Bieber showed off a new haircut while posing with fans for pictures over the weekend. According to E! Online on April 8, Bieber debuted his... We know that Justin Bieber cut his hair and he even talked about why he cut it.Click here to read about ...", "Justin Bieber Leaves Fans In Tears Over Late Concert Arrival — Report": "Justin Bieber’s “Believe” tour has been riddled with one problem after another, and now he showed up late to his Germany concert, making some fans cry and others left due to Justin’s tardiness. Adding fuel to the fire, Justin didn’t ...", "Justin Bieber Three Hours Late to Germany Concert — Fans Irate, Crying": "The Biebs was late for one of his own shows yet again, this time showing up almost three hours late to a concert in Germany, according to Perez Hilton. Many young fans had to leave the April 5th concert early because the singer was so tardy, causing many ...", "Justin Bieber debuts new haircut at a fan meet and greet on Saturday (Video)": "Justin Bieber showed off a new haircut while posing with fans for pictures over the weekend. According to E! Online on April 8, Bieber debuted his new hair style at a fan meet and greet on Saturday. Fans of Justin Bieber think his new haircut ...", "Selena Gomez, Justin Bieber break up, song tells it all.": "(ThyBlackMan.com) Actress Selena Gomez is in no way shape or form waiting for Justin Bieber to come around. Her new single, “Come & Get It” certainly sounds like she is sending her ex a message, but she adamantly denies it is anything of the ...", "Justin Bieber's Fresh 'Rihanna Cut' Is Absolutely Hairiffic! See it HERE!": "The Biebs got a new haircut and the Twitterverse is absolutely abuzz! From a drop in the voice to growing patches of hair in new places, the transition from youth to manhood is confusing and rarely easy!! St ... Rihanna was able to dodge a possibly awkward ..."}, "lawmakers": {"Ind. lawmakers honor man who wrote official state song, 'On the Banks of the Wabash, Far Away'": "INDIANAPOLIS — Indiana lawmakers have honored the man who wrote the song \"On the Banks of the Wabash, Far Away\" a century after it became the state's official song. The Indiana House and Senate passed resolutions Thursday honoring Terre Haute native Paul ...", "Beyonce Cuba trip scrutinised by US lawmakers": "Beyonce Knowles opens up about losing the baby weight. - Source: Breakfast Two Republican members of Congress have asked the US Treasury Department for information on what type of license American pop star Beyonce and rap ...", "Republican lawmakers seek details on Beyoncé, Jay-Z Cuba trip": "Two Republican members of Congress have asked the U.S. Treasury Department for information on what type of license American pop star Beyoncé and rapper husband Jay-Z obtained for a high-profile trip to Cuba to celebrate their wedding anniversary.", "Trevor NextGen's Spring Fling: Honoring a worthy cause (Photos)": "They include TrevorText, an outreach program via text messaging for teens, and advocacy initiatives with Washington DC lawmakers. It’s truly fantastic to see such a worthy organization continue to growth in strength and awareness!", "Longer Session Creates Logistical Headache for Some Lawmakers": "BOISE • When the Legislature takes an extra week to wrap up, it doesn’t just mean long work days. Lawmakers who live outside the Treasure Valley stay in apartments, rented rooms and hotels during the legislative session. But those arrangements often ...", "Lawmakers disagree over Israeli resolution": "A Senate committee spent more than 25 minutes Thursday on a resolution that would recognize and commend the nation of Israel’s relationship with the United States as well as the state of North Dakota. The Senate Government and Veterans Affairs Committee ...", "'Argo' Attacked By New Zealand Lawmakers": "Ben Affleck and Argo screenwriter Chris Terrio have become public enemies in New Zealand after suggesting Kiwi embassy officials refused to shelter U.S. diplomats during the Iranian Revolution in the film. Just weeks after Iranian officials ...", "Lawmakers Vote To Pardon The Scottsboro Boys": "MONTGOMERY, Ala. -- The legacy of the \"Scottsboro Boys\" is secure: The nine black teens were wrongly convicted more than 80 years ago in one of America's most infamous racial tragedies. Alabama is now moving to repair its own legacy, and correct ...", "Busy final day for Ga. lawmakers": "State lawmakers in Georgia face a busy final day. By law, the General Assembly meets for a 40-day annual session. The final day Thursday is called Sine Die, which means adjourning without setting a date to return. Lawmakers typically face a daylong series ...", "Ben Affleck - Argo Attacked By New Zealand Lawmakers": "Just weeks after Iranian officials launched an attack of the Oscar winning film for its portrayal of their countryfolk, New Zealand politicians have taken aim at the movie for a line Affleck's co-star Bryan Cranston utters. The actor's Cia ...", "U.S. Lawmakers react to Margaret Thatchers Death": "Margaret Thatcher's politics not only changed Great Britain forever but she had an impact here in the United States as well. The woman known as the Iron Lady, once said \"Europe was created by history. America was created by philosophy.\" Rep. Kevin Brady (R ...", "Sharon Stone, Tracy Morgan to lobby lawmakers for arts funding": "A swarm of actors and actresses — including Sharon Stone, Tracy Morgan, Tiffani Thiessen, and Alfre Woodard — is trading Hollywood for the Hill, as they head to Washington to lobby lawmakers for arts funding. The group of artists — which will also ...", "Maine tribe meets with lawmakers over eel fishery": "AUGUSTA, Maine (AP) -- Passamaquoddy tribal leaders and Maine officials are discussing their differences in a dispute over how many tribal members can fish for lucrative glass eels. State law allows the tribe to issue 200 licenses to catch the eels, known ..."}, "america": {"'Captain America: The Winter Soldier' starts filming": "After months of breathless anticipation—not to mention furious rumor-mongering on these here interwebs—\"Captain America: The Winter Soldier\" has finally entered production. The film will reportedly pick up where \"The Avengers\" left off, with Chris ...", "Jay-Z Partners With Universal, Will Bring 'Made in America' Fest Back to Philadelphia": "The rap superstar signs up his Roc Nation label with UMG as he gears up for the second annual staging of his music fest. Rap mogul Jay-Z has just partnered his independent Roc Nation music label with major record company Universal Music Group. The 43-year ...", "Arnold Oceng, Ger Duany, Emmanuel Jal Will Play 'Lost Boys' In America In 'The Good Lie'": "Refugees of the Second Sudanese Civil War will be front and center in a new feature film project that will star Reese Witherspoon. Inspired by true events, and titled The Good Lie, according to the press release, the story will follow... ... a young ...", "Today's News: Our Take - Louie Anderson Dives \"for America\" and Captions Splash GIFS": "Louie Anderson knows that Splash is completely outrageous - but that's why you should watch.\"ABC didn't put it on because they thought it was groundbreaking,\" he tells TVGuide.com. \"They put it on because hey, this is what traditionally TV has ...", "MISS AMERICA: AUDITIONING FOR CENTER STAGE": "BLOOMSBURG, Pa., Jan. 15, 2012 -- Tucked between the New Hampshire primary and Groundhog Day, and directly competing against an NFL playoff game, is Saturday night's annual Miss America pageant. Although the headquarters is still near Atlantic City, where ...", "Annette Funicello, America's favorite Mouseketeer, dies": "Annette Funicello, the wholesome beauty who inspired millions of crushes as a Disney Mouseketeer and a beach-movie teen idol, died Monday. She was 70. Funicello died of complications from multiple sclerosis, a neurological disease which she ...", "You asked for it America: 'A Haunted House 2' is happening": "Get ready for more laughs, America? After bringing in more than $55 million worldwide on a reported budget of only $2.5 million, the Marlon Wayans horror spoof \"A Haunted House\" has been greenlit for a sequel by Open Road Films, with the tentatively-titled ...", "Captain America: The Winter Soldier First Image Released As Filming Begins": "Filming for the Captain America sequel, The Winter Soldier began today with Marvel Studios marking the occasion by releasing the first official photo of the production. The studio has also revealed more details of the movie. Robert Redford’s character is ...", "'Monsters and Mysteries in America' so far is a good new paranormal series": "\"Monsters and Mysteries in America\" first aired on March 24, 2013, on the TV station called Destination America. The shows first two episodes were quite interesting and this looks like a really promising new TV series. The show talks to the ...", "Kingdom Hearts manga returns to North America in May, you can pre-order now": "When Tokyopop shut down its North American publishing division in 2011, it seemed we would never see stateside releases of the Kingdom Hearts manga books that remained Japan-exclusive. Salvation, thy name is Yen Press-the publisher will ...", "Chris Stevens memorial exhibition opens in America": "An exhibition held in memory of the late US Ambassador to Libya, Chris Stevens, has opened in America, at California’s John Natsoloulas Centre for the Arts. The exhibition reflects Stevens’ love of Libya and its people. It includes artworks ...", "'America's Sweetheart,' Paula Bel returns to Montreal": "This weekend, vivacious comedian Paula Bel, an audience favorite at last summer’s “Just for Laughs: The Nasty Show,” headlines at Montreal’s The Comedy Nest. Despite the recent cold weather, Bel is guaranteed to warm things up, with her ...", "Chris Evans begins second 'Captain America'": "Chris Evans is back in the Captain America suit. Captain America: The Winter Soldier has begun shooting in Los Angeles, according to a Monday news release from Disney studios. The Winter Soldier will be released April 4, 2014. The film will ..."}, "twitter": {"Twitter Hashtag Leads Some to Think Cher Died": "(CNN) — Twitter is notorious for killing off the living, sometimes thanks to a hoax and sometimes, as was the case on Monday, through an unfortunate hashtag. #Nowthatchersdead popped up on Twitter following the news that Britain’s first ...", "The Wanted And One Direction Get Into A Twitter Fight, Force Their Parents To Ground Them For A Week": "While you spent your Sunday night doing mature adult things, the boys of One Direction and The Wanted got into a Twitter fight that reminded me of a “your momma is so fat” diss-off I had with a friend in 3rd grade. (For the record: I won ...", "Brad Paisley-LL Cool J's 'Accidental Racist' Collaboration Gets Collective Thumbs-Down From Twitter": "\"Accidental Racist,\" the collaboration between country singer Brad Paisley and rapper LL Cool J, is being met with harsh criticism online -- but not for the song's subject matter. Twitter users rushed en masse to give the new song a thumbs-down in 140 ...", "'Real Housewives of Atlanta' star NeNe Leakes mentions Kim Zolciak on Twitter": "NeNe Leakes of Bravo's \"Real Housewives of Atlanta\" published a new Twitter update on April 7. The star mentioned that her co-star Kim Zolciak will be seen on the second part of the highly-anticipated reunion show which will air on Sunday, April 14.", "Top five Twitter accounts you should be following": "Teens are straying away from Facebook as their social media platform of choice and have taken to Twitter. In 140 characters or fewer, we tweet about anything that comes to mind. To break up the plethora of hashtags and trending topics, here is a ...", "Carey Giudici Twitter": "2012 celebrity predictions for beyonce, kourtney kardashian, and, In 2012, will mariah carey decide that her son should have been the one named monroe?. Spoiler: fil-am catherine giudici wins ‘the bachelor’ « my sexy pinay, Another filipina has m ..", "Taylor Swift didn't win and Twitter ain't mad": "Taylor Swift is one of music's biggest and best-selling artists, but she can't claim to be one of this year's Academy of Country Music Award winners. And some on Twitter couldn't be happier. As Miranda Lambert won four awards and Luke Bryan nabbed the fan ...", "Nina Dobrev Caught Ian Somerhalder Cheating!! – Demands Apology On Twitter (PHOTOS)": "It looks like Nina Dobrev has Caught Ian Somerhalder cheating! It’s always interesting to me how fans of a couple will choose to put on the biggest blinders imaginable in order to still give their magic duo a sort of fairytale life together.", "One Direction vs. The Wanted: Louis Tomlinson's Twitter feud with Tom Parker gets ugly": "Ever wonder what the world might've been like if Twitter had existed during the *NSYNC vs. Backstreet Boys days? British boy bands One Direction and The Wanted have been giving us a taste of just how ugly a feud can turn when it goes public. Members ..", "Cher death fears sparked by Twitter hashtag #nowthatchersdead": "A number of Cher fans feared their idol had died today after misreading a Twitter hashtag about the passing of Margaret Thatcher. The death of the former Prime Minister prompted the hashtag #nowthatchersdead, meant as ‘Now Thatcher’s dead’, but some ...", "Cher Died And So Did Teri Hatcher, According To Twitter Users Who Can't Decipher Hashtags": "Very much alive. Cher on Feb. 27, 2013 in Paris. (AP Photo/Zacharie Scheurer) This would have been funny if it weren't so sad (though it is also pretty funny). The baffling, infinite abyss that is the Internet pulled a fast one on many people ...", "LISTEN: Here Is a Song About the Twitter Feud Between Paul Krugman and the President of Estonia": "Naturally, someone would have to see this and think of it as musical-theater gold: \"I couldn't avoid the tweets,\" Scott Diel, an Estonia-based American writer and lyricist for the show, tells me. \"They just sort of recommended themselves.", "That one time Twitter thought Cher was dead": "Twitter is notorious for killing off the living, sometimes thanks to a hoax and sometimes, as was the case on Monday, through an unfortunate hashtag. #Nowthatchersdead popped up on Twitter following the news that Britain's first female prime ..."}, "obama": {"President Obama and Hollywood Celebrities Pay Tribute to Roger Ebert": "The president, film directors and celebrities like Justin Long and Jimmy Kimmel mourn the death of the famous film critic who died at the age of 70 after losing his battle with cancer. Roger Ebert, the Pulitzer Prize-winning film critic, died from cancer ...", "Barack Obama - World Leaders Pay Tribute To Margaret Thatcher": "The veteran Conservative leader passed away at the age of 87 after suffering a stroke, and her death prompted an outpouring of messages from the world of politics, including tributes from current U.K. leader David Cameron, former Pms Tony Blair and John ...", "Obama’s record is shameful": "My recent letter about Barack Obama amused Ross Stevenson and appeared to make William Henry angry. Stevenson says my criticisms of Obama are made “time and time again.” Henry sounds as if he’s pleading when he asks, “Does it ever end?”", "President Obama Meets U.S. Laureates of 2012 Kavli Prizes": "Joined by the President's science and technology advisor, John P. Holdren, President Obama greeted Kavli Prize Laureates Cornelia Isabella Bargmann (The Rockefeller University), Michael E. Brown (California Institute of Technology), Mildred S. Dresselhaus ...", "Barack Obama and Martin Scorsese on Roger Ebert’s death": "Film legend Martin Scorsese and President Barack Obama led tributes to US movie critic Roger Ebert, the first cinema pundit to win a Pulitzer Prize who died Thursday from cancer aged 70. Scorsese, who has been working on a film about the reviewer famed for ...", "Obama Treasury Dept. OK'd Jay-Z, Beyonce Cuba Trip": "Well, she lip-synced her heart out on his behalf. Now, the duo is sparking political news by celebrating their wedding anniversary in Cuba, a no-no given tourist embargo restrictions on the books for the past 50-plus yea ... United States (US) singer ...", "Wingnuts Furious: Obama Tweeted About Roger Ebert’s Death More Quickly Than About Margaret Thatcher’s": "Hey, guys, did you hear about how the Kenyan Usurper is pissing on the not-yet-dug grave of Margaret Thatcher? Thanks to the completely sane coverage at the “Christian” “News” “Service,” we know that the Chicago thug tweeted a brief message in ...", "Roger Ebert Remembered As 'A Gentleman' By President Obama, Directors": "When news broke Thursday that legendary film critic Roger Ebert died at the age of 70 after a lengthy battle with cancer, the Hollywood community reacted with great sadness at the loss, regardless of whether he had given them a good review. \"Black Swan ...", "'Fox And Friends' Defends Obama's Kamala Harris Comment (VIDEO)": "While some people criticized President Obama's recent comments about California attorney general Kamala Harris as sexist, the hosts of \"Fox and Friends\" were totally fine with it. Obama provoked backlash when he called Harris \"the best-looking ...", "Stephen Stills on Hilary 2016 and Obama's CPI manuever": "On Hilary: Stephanie asks rock legend, Stephen Stills, if Hillary Clinton is going to run in 2016. Still says, “Are you kidding, she is the Energizer Bunny. The idea of her taking a year off is as ridiculous as Justice Scalia making sense.”", "THE OBAMA PARADOX": "DUMMERSTON, Vt. -- It was a joke when he said, \"My next 100 days will be so successful I will be able to complete them in 72 days. And on the 73rd day, I will rest.\" Right? Wasn't it a joke? When President Barack Obama debuted his comic styling at the ...", "Obama, Scorsese, Winfrey lead tributes to Roger Ebert": "President Obama led a chorus of voices paying tribute to legendary film critic Roger Ebert, who died Thursday at the age of 70 after a prolonged battle with cancer. The fellow Chicagoan and Pulitzer Prize-winning writer \"was the movies,\" Obama said.", "President Obama and the Kamala Harris appearance SNAFU": "And so the morality comedy (tragedy?) currently being acted out in public over the importance of appearance continues. Last week at a fundraiser in California, President Obama called California Attorney General Kamala Harris (below left, at the ..."}}}
